var a = 0;
var text;
var selects; //记录玩家的选项
var selectt;
var buynum = 0;
var Mtype = 1;
var Mtypet = "";
//椅子
//稀有椅子
//绝版点装
//05190011(宠物训练技能)

var itemname = Array(
    "神秘能手册", "必成卷", "点卷商城",
    "抵用卷商城", "帽子", "脸饰", "武器",
    "披风", "衣服", "裤子", "戒指", "鞋子", "手套", "140级副手武器", "喇叭"
)
var Itemlist2 = Array(
    //神秘能手册
    Array(
        Array(2290245, 2, 1000), //尖兵的神秘能手册
        Array(2290448, 2, 1000), //英雄的神秘能手册
        Array(2290449, 2, 1000), //圣骑士的神秘能手册
        Array(2290450, 2, 1000), //黑骑士的神秘能手册
        Array(2290451, 2, 1000), //火毒魔导师的神秘能手册
        Array(2290452, 2, 1000), //冰雷魔导师的神秘能手册
        Array(2290453, 2, 1000), //主教的神秘能手册
        Array(2290454, 2, 1000), //神射手的神秘能手册
        Array(2290455, 2, 1000), //箭神的神秘能手册
        Array(2290456, 2, 1000), //侠盗的神秘能手册
        Array(2290457, 2, 1000), //隐士的神秘能手册
        Array(2290458, 2, 1000), //暗影双刀的神秘能手册
        Array(2290459, 2, 1000), //冲锋队长的神秘能手册
        Array(2290460, 2, 1000), //船长的神秘能手册
        Array(2290461, 2, 1000), //火炮手的神秘能手册
        Array(2290462, 2, 1000), //战神的神秘能手册
        Array(2290463, 2, 1000), //龙神的神秘能手册
        Array(2290464, 2, 1000), //双弩精灵的神秘能手册
        Array(2290465, 2, 1000), //恶魔猎手的神秘能手册
        Array(2290467, 2, 1000), //豹弩游侠的神秘能手册
        Array(2290468, 2, 1000), //机械师的神秘能手册
        Array(2290571, 2, 1000), //幻影的神秘能手册
        Array(2290602, 2, 1000), //米哈尔的神秘能手册
        Array(2290722, 2, 1000), //夜光法师的神秘的能手册
        Array(2290723, 2, 1000), //狂龙战士神秘能手册
        Array(2290724, 2, 1000), //爆莉萌天使神秘能手册
        Array(2290914, 2, 1000), //恶魔复仇者的神秘能手册
        Array(2291137, 2, 1000) //隐月的神秘能手册
    ),
    //所有武器必成卷//     3000点
    Array(
        Array(2043003, 1, 3000), //单手剑攻击必成卷
        Array(2043103, 1, 3000), //单手斧攻击必成卷
        Array(2043203, 1, 3000), //单手钝器攻击必成卷
        Array(2043303, 1, 3000), //短剑攻击必成卷
        Array(2043703, 1, 3000), //短杖攻击必成卷
        Array(2043803, 1, 3000), //长杖攻击必成卷
        Array(2044003, 1, 3000), //双手剑攻击必成卷
        Array(2044019, 1, 3000), //双手剑魔力必成卷
        Array(2044103, 1, 3000), //双手斧攻击必成卷
        Array(2044203, 1, 3000), //双手钝器攻击必成卷
        Array(2044303, 1, 3000), //枪攻击必成卷
        Array(2044403, 1, 3000), //矛攻击必成卷
        Array(2044503, 1, 3000), //弓攻击必成卷
        Array(2044603, 1, 3000), //弩攻击必成卷
        Array(2044703, 1, 3000), //拳套攻击必成卷
        Array(2044815, 1, 3000), //指节攻击必成卷
        Array(2044908, 1, 3000) //短枪攻击必成卷
    ),
    //点卷商城
    Array(
        Array(1402014, 1, 300000), //温度计
        Array(5360015, 1, 3000), //双倍爆率卡一天权
        Array(5211060, 1, 6000), //三倍经验卡（2小时）
        Array(2340000, 1, 6000), //祝福
        Array(2614012, 1, 1500), //突破一万之石 50%
        Array(2614013, 1, 15000), //突破十万之石 50%
        Array(2614014, 1, 140000), //突破百万之石 50%
        Array(4001839, 1, 150), //
        // Array(5750000, 1, 800),
        Array(2070016, 1, 12000), //水晶飞镖
        Array(5150040, 1, 800), //
        Array(5152053, 1, 980), //
        Array(5062009, 1, 1400), //超级神奇魔方
        Array(5190011, 1, 6000), //宠物训练技能
        Array(5064000, 1, 6000) //防暴卷
    ),
    //抵用卷商城
    Array(
        Array(5062000, 2, 600), //神奇魔方
        Array(5062002, 2, 1300), //高级神奇魔方
        // Array(5062009, 2, 1300), //超级神奇魔方
        Array(5062500, 2, 1300), //大师附加神奇魔方
        Array(5530268, 2, 2000), //银光潜能附加印章交换卷
        Array(5530269, 2, 3000), //金光潜能附加印章交换卷
        Array(2048309, 2, 3000), //附加潜能附加卷
        Array(2049704, 2, 3000), //A级潜能附加卷轴 40%
        Array(5050000, 2, 100), //洗能力卷轴
        Array(5050001, 2, 2000), //洗1转技能卷轴
        Array(5050002, 2, 2000), //洗2转
        Array(5050003, 2, 2000), //洗3转
        Array(2049704, 2, 3000), //A级潜能附加卷轴 40%
        Array(2049303, 2, 800), //高级装备强化卷轴
        Array(5062400, 2, 5000) //神奇铁占
    ),
    //帽子
    Array(
        Array(1004504, 1, 40000), //贵族花纹帽子
        Array(1003519, 1, 40000), //霞草帽
        Array(1003460, 1, 40000), //奶油巧克力帽子
        Array(1002568, 1, 40000), //手工编织发夹
        Array(1052059, 1, 40000), //14法国足球服No.
        Array(1003393, 1, 40000), //帝国伯爵冠
        Array(1003436, 1, 40000), //怪盗幻影渡鸦帽
        Array(1003207, 1, 40000), //胡萝卜兔爆炸头
        Array(1002721, 1, 40000), //狸毛护耳
        Array(1002714, 1, 40000), //圣诞树帽
        Array(1004125, 1, 40000), //歌唱大菠萝帽
        Array(1003006, 1, 40000), //猫猫野营帽
        Array(1004041, 1, 40000), //松鼠耳朵
        Array(1004040, 1, 40000), //小熊猫耳朵
        Array(1003538, 1, 40000), //纽扣控玩具帽
        Array(1003461, 1, 40000), //玫瑰秀秀
        Array(1003077, 1, 40000), //花别针尼龙帽
        Array(1002845, 1, 40000), //粉红兔耳帽
        Array(1002888, 1, 40000), //丝带发箍(红色)
        Array(1002890, 1, 40000), //丝带发箍(蓝色)
        Array(1004181, 1, 40000), //糖果晚会丝带发卡
        Array(1004275, 1, 40000), //幸运帽
        Array(1004250, 1, 40000), //星星糖果雪糕
        Array(1042285, 1, 40000), //拼色点点T恤
        Array(1003920, 1, 40000), //夏威夷草帽
        Array(1002846, 1, 40000), //华尔兹丝带贝雷帽
        Array(1004026, 1, 40000), //黑猫无边帽
        Array(1004027, 1, 40000), //白猫无边帽
        Array(1004028, 1, 40000), //黄猫无边帽
        Array(1004029, 1, 40000), //北极熊无边帽
        Array(1004112, 1, 40000), //可爱兔纸帽
        Array(1004092, 1, 40000), //小马乖乖帽
        Array(1001037, 1, 40000), //豹皮帽
        Array(1004453, 1, 40000), //雪兔贝雷帽
        Array(1003760, 1, 40000), //猫咪耳机
        Array(1004403, 1, 40000), //嘻哈兔子
        Array(1003921, 1, 40000), //咕噜噜鸭舌帽
        Array(1003910, 1, 40000), //小龙角
        Array(1004042, 1, 40000), //兔耳朵
        Array(1004472, 1, 40000), //饿狼传说帽子
        Array(1000046, 1, 40000), //男款精灵王假发-
        Array(1001069, 1, 40000), //女款精灵王假发-
        // Array(1001076, 1, 40000), //樱桃雪水晶
        // Array(1000050, 1, 40000), //薄荷雪水晶
        // Array(1102659, 1, 40000), //真?高贵之神
        Array(1004332, 1, 40000) //我爱小狗
        // Array(1004156, 1, 40000), //来自星星的你
        // Array(1004157, 1, 40000) //来自星星的你
    ),
    //脸饰
    Array(
        Array(1012253, 1, 40000), //心跳唇彩
        Array(1012134, 1, 40000), //泪滴
        Array(1022194, 1, 40000), //烈焰之瞳(黑)
        Array(1022217, 1, 40000), //烈焰之瞳
        Array(1012131, 1, 40000), //好白的牙
        Array(1012179, 1, 40000), //鹿鼻子
        Array(1012208, 1, 40000), //害羞了
        Array(1012165, 1, 40000), //小丑鼻子
        Array(1012412, 1, 40000), //岩炎之泪
        Array(1012413, 1, 40000), //双面人
        Array(5010044, 1, 40000), //幻影残像
        Array(5010005, 1, 40000), //求爱人
        Array(5010103, 1, 40000), //求基友
        Array(5010104, 1, 40000), //求包养
        Array(1012436, 1, 40000), //坏笑的表情
        Array(1012134, 1, 40000) //泪滴
    ),
    //武器
    Array(
        Array(1702559, 1, 40000), //泰迪小伙伴(白)
        Array(1702560, 1, 40000), //泰迪小伙伴(棕)
        Array(1702571, 1, 40000), //天下第一铲
        Array(1702549, 1, 40000), //拉拉队手摇花
        Array(1702567, 1, 40000), //漂浮小虎
        Array(1702566, 1, 40000), //羊羊魔术棒
        Array(1702489, 1, 40000), //丝滑巧克力棒棒糖
        Array(1702486, 1, 40000), //茶花纷飞
        Array(1702488, 1, 40000), //邦尼的胡萝卜
        Array(1702557, 1, 40000), //清扫掸子
        Array(1702534, 1, 40000), //嘟嘟奶嘴
        Array(1702505, 1, 40000), //粉嘟嘟熊的竹节
        Array(1702533, 1, 40000), //咔嚓拍摄器
        Array(1702503, 1, 40000), //巴尼兔的彩虹泡沫
        Array(1702528, 1, 40000), //木琴旋律
        Array(1702305, 1, 40000), //胡萝卜武器
        Array(1702478, 1, 40000), //猫猫爪
        Array(1702530, 1, 40000), //莎啦啦糖果
        Array(1702382, 1, 40000), //满月柿子树枝
        Array(1702466, 1, 40000), //薄荷巧克力蛋糕魔法棒
        Array(1702334, 1, 40000), //水晶幻想曲
        Array(1702480, 1, 40000), //月亮女神
        Array(1702485, 1, 40000), //大包小包
        Array(1702509, 1, 40000), //彩糖棒
        Array(1702013, 1, 40000), //熊宝宝
        Array(1702374, 1, 40000), //剑豪的刀
        Array(1702512, 1, 40000), //主人公权杖
        Array(1702508, 1, 40000), //草莓牛奶武器
        Array(1702233, 1, 40000), //彩虹画笔
        Array(1702228, 1, 40000), //可可香蕉
        Array(1702155, 1, 40000), //绚丽彩虹
        Array(1702208, 1, 40000), //搞怪鳄鱼
        Array(1702285, 1, 40000), //蓝色蝴蝶结手提包
        Array(1702168, 1, 40000), //闪亮圣诞树
        Array(1702367, 1, 40000), //玫瑰苏菲亚
        Array(1322102, 1, 40000), //蛋糕大战馅饼兵器
        Array(1702366, 1, 40000), //冰鲨鱼
        Array(1702352, 1, 40000), //奶茶搅拌勺
        Array(1702330, 1, 40000), //银河星群
        Array(1702346, 1, 40000), //福袋
        Array(1702324, 1, 40000), //冲击波
        Array(1702340, 1, 40000), //帽中兔
        Array(1402110, 1, 40000), //[派对]黄色电吉他
        Array(1702310, 1, 40000), //星光魔法棒
        Array(1702329, 1, 40000), //草莓果篮
        Array(1702430, 1, 40000), //动态极光
        Array(1702309, 1, 40000), //彩虹烟火棒
        Array(1702408, 1, 40000), //纪念日专用武器
        Array(1702415, 1, 40000), //睡梦绵羊枕头
        Array(1702402, 1, 40000), //高尔夫球棒
        Array(1702375, 1, 40000), //亚特兰蒂斯
        Array(1702348, 1, 40000), //雪片
        Array(1702442, 1, 40000), //棒球棒
        Array(1702422, 1, 40000), //冒险明星麦克风
        Array(1702446, 1, 40000), //和海獭一起
        Array(1702303, 1, 40000), //牛奶瓶
        Array(1702108, 1, 40000), //七彩棒棒果
        Array(1702261, 1, 40000), //樱花棒
        Array(1702091, 1, 40000), //网球拍
        Array(1342069, 1, 40000), //空气刃
        Array(1702469, 1, 40000), //阿拉克尼
        Array(1702379, 1, 40000), //阿拉伯魔术洋灯
        Array(1702403, 1, 40000), //侦探的巨型放大镜
        Array(1702507, 1, 40000), //波点娃娃小扇子
        Array(1702466, 1, 40000), //薄荷巧克力蛋糕魔法棒
        Array(1702595, 1, 40000), //薄荷喵下午茶
        Array(1702487, 1, 40000), //花红
        Array(1702302, 1, 40000), //杯具
        Array(1702459, 1, 40000), //棉花糖武器
        Array(1702423, 1, 40000), //鬼火
        Array(1702566, 1, 40000), //羊羊魔术棒
        Array(1702509, 1, 40000), //彩糖棒
        Array(1003268, 1, 40000), //粉嫩爱心帽
        Array(1003271, 1, 40000), //红心透明帽子
        Array(1003276, 1, 40000), //蓝心透明帽子
        Array(1702570, 1, 40000), //绵软雪兔
        Array(1702501, 1, 40000), //玫瑰花舞
        Array(1702506, 1, 40000), //普通平底锅
        Array(1702508, 1, 40000), //草莓牛奶武器
        Array(1702347, 1, 40000), //怪盗幻影权杖
        Array(1702565, 1, 40000) //死亡地狱
    ),

    //披风

    Array(
        Array(1102707, 1, 40000), //蓝色梦想披风
        Array(1102389, 1, 40000), //金色天使
        Array(1102643, 1, 40000), //金色之翼
        Array(1102225, 1, 40000), //嫦娥披风
        Array(1102217, 1, 40000), //九尾披风
        Array(1102695, 1, 40000), //灵魂九尾狐披风
        Array(1102420, 1, 40000), //星尘披肩
        Array(1102232, 1, 40000), //小王子的星星
        Array(1102808, 1, 40000), //啵啵鼠气球
        Array(1102390, 1, 40000), //银色天使
        Array(1102707, 1, 40000), //蓝色梦想海螺
        Array(1102789, 1, 40000), //白熊围巾
        Array(1102778, 1, 40000), //棒棒糖披风
        Array(1102812, 1, 40000), //决战！暴雪！
        Array(1102377, 1, 40000), //普赛克时空
        Array(1102378, 1, 40000), //普赛克旋律
        Array(1102376, 1, 40000), //粉色旋律翅膀
        Array(1102644, 1, 40000), //粉色光芒之翼
        Array(1102708, 1, 40000), //粉色梦想海螺
        Array(1102450, 1, 40000), //天使光芒之翼
        Array(1102451, 1, 40000), //黑暗光芒之翼
        Array(1102452, 1, 40000), //精灵光芒之翼
        Array(1102532, 1, 40000), //光芒智天使
        Array(1102730, 1, 40000), //闪耀光芒之翼
        Array(1102551, 1, 40000), //蓝宝石翅膀
        Array(1102550, 1, 40000), //绿宝石翅膀
        Array(1102551, 1, 40000), //蓝宝石翅膀
        Array(1102702, 1, 40000), //红宝石蝴蝶
        Array(1102624, 1, 40000), //天王星光芒之翼
        Array(1102644, 1, 40000), //粉色光芒之翼
        // Array(1102555, 1, 40000), //大天使的翅膀
        Array(1102385, 1, 40000), //路易斯四翼天使
        Array(1102386, 1, 40000) //诺克斯四翼天使
    ),

    //衣服
    Array(
        Array(1052061, 1, 40000), //巴西足球服
        Array(1052924, 1, 40000), //贵族花纹套服
        Array(1052925, 1, 40000), //红粉飘飘
        Array(1042142, 1, 40000), //彩虹条背心
        Array(1042104, 1, 40000), //小绿叶T恤
        Array(1042105, 1, 40000), //小红叶T恤
        Array(1052224, 1, 40000), //草莓baby装
        Array(1052731, 1, 40000), //黑色可爱游泳服
        Array(1051152, 1, 40000), //玫瑰红晚宴裙
        Array(1052634, 1, 40000), //简洁白衬衫
        Array(1042336, 1, 40000), //微笑玉米衫
        Array(1042337, 1, 40000), //熊熊春游T
        Array(1042337, 1, 40000), //熊熊春游T
        Array(1042338, 1, 40000), //熊孩子套衫(黄)
        Array(1050152, 1, 40000), //水兵服
        Array(1051180, 1, 40000), //水兵裙
        Array(1042315, 1, 40000), //蓝色萌萌象T恤
        Array(1042316, 1, 40000), //粉色萌萌象T恤
        Array(1050299, 1, 40000), //小娃娃普卡
        Array(1051366, 1, 40000), //小娃娃皮卡
        Array(1050210, 1, 40000), //蓝色小背带服
        Array(1051256, 1, 40000), //蓝色小背带裙
        Array(1042242, 1, 40000), //无袖水手上衣
        Array(1042252, 1, 40000), //高尔夫无袖T恤
        Array(1051150, 1, 40000), //宝石蓝晚宴裙
        Array(1052626, 1, 40000), //海洋风条纹装
        Array(1042312, 1, 40000), //蘑蘑菇T恤(冰雪蓝)
        Array(1042313, 1, 40000) //爱心萦绕T恤
    ),

    //裤子

    Array(
        Array(1062203, 1, 40000), //兔兔熊短裤
        Array(1062211, 1, 40000), //奶牛短裤
        Array(1060001, 1, 40000), //黑西裤
        Array(1061113, 1, 40000), //夏威夷草裙
        Array(1062204, 1, 40000), //彩糖短裤
        Array(1062171, 1, 40000), //大明星短裤
        Array(1062172, 1, 40000), //芭比格子塑身裤
        Array(1061207, 1, 40000), //流星雨短裙
        Array(1060181, 1, 40000), //流星雨裤子
        Array(1062156, 1, 40000), //紫色马赛克短裤
        Array(1062157, 1, 40000), //草莓巧克力短裤
        Array(1062174, 1, 40000), //蓬蓬星塑身裤
        Array(1062072, 1, 40000), //BAND牛仔裤
        Array(1062173, 1, 40000), //明星短裤
        Array(1062093, 1, 40000), //嫩绿休闲短裤
        Array(1052200, 1, 40000), //罗丽粉色娃娃套服
        Array(1061148, 1, 40000), //巨星粉色短裙
        Array(1052846, 1, 40000), //桃太郎的背带裤
        Array(1062216, 1, 40000) //不对称短裤
    ),
    //戒指
    Array(
        Array(1112904, 1, 40000), //彩虹星环绕戒指
        Array(1112157, 1, 40000), //我爱胡子名片戒指(蓝色)
        Array(1112269, 1, 40000), //我爱胡子聊天戒指(蓝色)
        Array(1112158, 1, 40000), //我爱胡子名片戒指(红色)
        Array(1112270, 1, 40000), //我爱胡子聊天戒指(红色)
        Array(1112176, 1, 40000), //旋律音符名片戒指
        Array(1112288, 1, 40000), //旋律音符聊天戒指
        Array(1112949, 1, 40000), //旋律戒指
        Array(1112925, 1, 40000), //蓝色闪烁之星戒指(90天权)
        Array(1112928, 1, 40000), //粉色流星戒指90天
        Array(1112924, 1, 40000), //黄色流星戒指90天
        Array(1112957, 1, 40000), //90天西红柿效果
        Array(1112253, 1, 40000), //木乃伊对话框戒指
        Array(1112142, 1, 40000), //木乃伊名片戒指
        Array(1112141, 1, 40000), //红玫瑰名片戒指
        Array(1112252, 1, 40000), //红玫瑰聊天戒指
        Array(1112153, 1, 40000), //草莓名片戒指
        Array(1112265, 1, 40000), //草莓聊天戒指
        Array(1112151, 1, 40000), //草莓蛋糕名片戒指
        Array(1112263, 1, 40000), //草莓蛋糕聊天戒指
        Array(1112156, 1, 40000), //猪猪名片戒指
        Array(1112268, 1, 40000), //猪猪聊天戒指
        Array(1112150, 1, 40000), //天使降临名片戒指
        Array(1112784, 1, 40000), //天使聊天戒指
        // Array(1112164,1, 40000), //夏日甜心名片戒指
        // Array(1112276,1, 40000), //夏日甜心聊天戒指
        Array(1112171, 1, 40000), //狗狗名片戒指(白)
        Array(1112283, 1, 40000), //狗狗聊天戒指(白)
        Array(1112172, 1, 40000), //狗狗名片戒指(棕)
        Array(1112284, 1, 40000), //狗狗聊天戒指(棕)
        Array(1112178, 1, 40000), //梦境雪景名片戒指
        Array(1112290, 1, 40000), //梦境雪景对话框戒指
        Array(1112941, 1, 40000), //WelcomeBack戒指
        Array(1112161, 1, 40000), //小黄鸭名片戒指
        Array(1112273, 1, 40000), //小黄鸭聊天戒指
        Array(1112118, 1, 40000), //可乐名片戒指
        Array(1112119, 1, 40000), //可乐(Red)名片戒指
        Array(1112120, 1, 40000), //可乐(White)名片戒指
        Array(1112228, 1, 40000), //可乐聊天戒指
        Array(1112229, 1, 40000), //可乐(Red)聊天戒指
        Array(1112230, 1, 40000), //可乐(White)聊天戒指
        Array(1112159, 1, 40000), //非洲之星名片戒指
        Array(1112271, 1, 40000), //非洲之星聊天戒指
        Array(1112135, 1, 40000), //水墨花名片戒指
        Array(1112238, 1, 40000), //水墨花聊天戒指
        Array(1112916, 1, 40000) //寂寞单身戒指
    ),
    //鞋子
    Array(
        Array(1071079, 1, 40000), //粉色巴尼兔小皮鞋
        Array(1072779, 1, 40000), //圣洁天使拖
        Array(1072821, 1, 40000), //金铃派对鞋
        Array(1072942, 1, 40000), //海鸥拖拖鞋
        Array(1072911, 1, 40000), //肃清者暗靴
        Array(1072860, 1, 40000), //明星闪耀
        Array(1072808, 1, 40000), //软软绵羊拖鞋
        Array(1072862, 1, 40000), //闪购拖鞋
        Array(1072919, 1, 40000), //蓝色蝴蝶鞋
        Array(1071076, 1, 40000), //秋游小黄鞋
        Array(1071078, 1, 40000), //派对公主的水晶鞋
        Array(1070061, 1, 40000), //派对王子的玻璃鞋
        Array(1072543, 1, 40000), //[派对]双色跑鞋
        Array(1072337, 1, 40000), //喜洋洋拖鞋
        Array(1072843, 1, 40000), //泡泡拖
        Array(1072749, 1, 40000), //泡泡巧克力鞋子
        Array(1072832, 1, 40000), //海滩拖鞋
        Array(1072820, 1, 40000) //明星熊仔鞋)
    ),
    // 手套
    Array(
        Array(1082565, 1, 40000), //巧克力丝带装饰
        Array(1082555, 1, 40000), //精灵闪电手套
        Array(1082548, 1, 40000), //星光手镯
        Array(1080008, 1, 40000) //蓝莓泡芙球
    ),

    //140级副手武器
    Array(
        Array(1098006, 1, 300000), //名誉灵魂之盾(米哈尔)
        Array(1099011, 1, 300000), //银河之咒盾（恶魔猎手）

        Array(1352009, 1, 300000), //银河之箭矢(双弩精灵)
        Array(1352109, 1, 300000), //银河之卡片(幻影)
        Array(1352206, 1, 300000), //银河之吊坠(英雄)
        Array(1352216, 1, 300000), //银河之念珠(圣骑)
        Array(1352226, 1, 300000), //银河之锁链(黑骑)
        Array(1352236, 1, 300000), //银河之赤铜之书(火毒)
        Array(1352246, 1, 300000), //银河之青银之书(冰雷)
        Array(1352256, 1, 300000), //银河之白金之书(主教)
        Array(1352266, 1, 300000), //银河之风暴羽毛(神射手)
        Array(1352276, 1, 300000), //银河之扳指(箭神)
        Array(1352286, 1, 300000), //银河之剑鞘(侠盗)
        Array(1352296, 1, 300000), //银河之灵符(隐士)
        Array(1352304, 1, 300000), //超越的八卦宝盒(海盗)
        Array(1352406, 1, 300000), //银河之魂珠(夜光法师)
        Array(1352506, 1, 300000), //银河之精髓(狂龙战士)
        Array(1352606, 1, 300000), //银河之灵魂手镯(爆莉萌天使)
        Array(1352707, 1, 300000), //银河之麦林弹(机械师)
        Array(1352906, 1, 300000), //银河之腕轮(冲锋队长)
        Array(1352916, 1, 300000), //银河之鹰眼(船长)
        Array(1352928, 1, 300000), //银河之火药桶(火炮手)
        Array(1352935, 1, 300000), //银河之天龙锤(战神)
        Array(1352945, 1, 300000), //银河之龙神的遗产(龙神)
        Array(1352957, 1, 300000), //银河之极限球(幻灵斗师)
        Array(1352967, 1, 300000), //银河之狂野之矛(豹弩游侠)
        Array(1352975, 1, 300000), //银河之圣地之光(骑士团)
        Array(1353006, 1, 300000) //银河之控制器(尖兵)
    ),
    //喇叭
    Array(
        Array(5071000, 1, 4000), //高质地喇叭
        Array(5390000, 1, 6000), //炽热情景喇叭
        Array(5390001, 1, 30000), //绚烂情景喇叭
        Array(5390002, 1, 30000), //爱心情景喇叭
        Array(5390003, 1, 30000), //新年庆祝喇叭1
        Array(5390004, 1, 30000), //新年庆祝喇叭2
        Array(5390005, 1, 30000), //小老虎情景喇叭
        Array(5390006, 1, 30000), //咆哮老虎情景喇叭
        Array(5390007, 1, 30000), //球进了!情景喇叭
        Array(5390008, 1, 30000), //世界杯情景喇叭
        Array(5390010, 1, 30000), //鬼出没情景喇叭
        Array(5390011, 1, 30000), //钻石VIP专用喇叭
        Array(5390012, 1, 30000), //黄金VIP专用喇叭
        Array(5390013, 1, 30000), //白银VIP专用喇叭
        Array(5390018, 1, 30000), //赤兔马情景喇叭
        Array(5390019, 1, 30000), //新闻主播室情景喇叭
        Array(5390020, 1, 30000), //我的演唱会情景喇叭
        Array(5390022, 1, 30000) //追赶小羊的狼情景喇叭
    )

)




function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            text = "#h0#,你好！请问需要些什么呢?\r\n#b";
            for (var i = 0; i < itemname.length; i++) {
                // text += "#L" + i + "#" + itemname[i] + "#  \r\n";
                text += "#L" + i + "#" + itemname[i] + "#l";
                if (i != 0 && (i + 1) % 5 == 0) {
                    text += "\r\n";
                }
            }
            cm.sendSimple(text);

        } else if (a == 1) {
            text = "#h0#,你好！在这里可以选择你想要购买的物品,点击购买#b";
            if (selection != null && selection != -1) {
                selectt = selection;
            }
            // cm.worldSpouseMessage(0x20, selectt+"  "+selection);
            for (var i = 0; i < Itemlist2[selectt].length; i++) {

                //text += "#L" + i + "##i" + Itemlist2[selectt][i] + "# #b#t" + Itemlist2[selectt][i] + "##k   #r" + Itemlist2[selectt][i][2];

                text += "\r\n#L" + i + "##i" + Itemlist2[selectt][i] + ":# #b#t" + Itemlist2[selectt][i] + "##k   #r" + Itemlist2[selectt][i][2];

                if (Itemlist2[selectt][i][1] == 1) {
                    // text += "#k点劵 #l \r\n";
                    text += "#k点卷#l";
                } else {
                    // text += "#k抵用券 #l \r\n";
                    text += "#k抵用券#l";

                }
                // text += "#L" + i + "#i" + Itemlist2[selectt][i]  + "#  ";
                // if (i != 0 && (i + 1) % 5 == 0) {
                //     text += "\r\n";
                // }
                // text += "#L" + i + "##i" +  Itemlist2[selectt][i] + "#  ";
                // if (i != 0 && (i + 1) % 5 == 0) {
                //     text += "\r\n";
                // }
            }
            cm.sendNextPrev(text);

        } else if (a == 2) {
            if (selection != null && selection != -1) {
                selects = selection;
            }
            Mtype = Itemlist2[selectt][selects][1];
            if (Mtype == 1) {
                Mtypet = "点劵";
            } else {
                Mtypet = "抵用劵";
            }
            // cm.worldSpouseMessage(0x20, selects+"  "+selection);
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r - 1个需要" + Itemlist2[selectt][selects][2] + Mtypet, 0, 0, 999999);
        } else if (a == 3) {
            if (selection != null && selection != -1) {
                buynum = selection;
            }
            cm.sendNextPrev("你想购买" + buynum + "个#r#i" + Itemlist2[selectt][selects][0] + "##k？\r\n你将使用掉" + (buynum * Itemlist2[selectt][selects][2]) + Mtypet + "。");
        } else if (a == 4) {
            if (cm.getChar().getCSPoints(Mtype) >= buynum * Itemlist2[selectt][selects][2]) {
                cm.getChar().modifyCSPoints(Mtype, -buynum * Itemlist2[selectt][selects][2]);
                cm.gainItem(Itemlist2[selectt][selects][0], buynum);
                cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的" + Mtypet + "。");
                cm.dispose();
            }
        }
    } //mode
} //f

// var itemlist = Array(
//     Array(5062000,1, 500),
//     Array(5062002,1, 1000),
//     Array(5062500,1, 1000),
//     Array(5064000,1, 4900),
//     Array(5064100,1, 30000),
//     Array(5050000,1, 100),
//     Array(2614002,1, 80000),
//     Array(5072000,1, 100),
//     Array(5073000,1, 500),
//     Array(5074000,1, 500),
//     Array(5076000,1, 800),
//     Array(5390000,1, 1000),
//     Array(5390001,1, 1000),
//     Array(5390002,1, 1000),
//     Array(5390003,1, 1000),
//     Array(5390004,1, 1000),
//     Array(5390005,1, 2000),
//     Array(5390006,1, 5000),
//     Array(5390007,1, 3000),
//     Array(5390008,1, 3000),
//     Array(5079001,1, 1000),
//     Array(5079002,1, 1000),
//     Array(5390010,1, 5000),
//     Array(5390018,1, 5000),
//     Array(5520000,1, 3000),
//     Array(5520001,1, 5000));
