importPackage(java.util);
importPackage(net.sf.odinms.client);
importPackage(net.sf.odinms.server);


var status = 0;
var typed=0;
var slot = Array();
var stats = Array("Strength", "Dexterity", "Intellect", "Luck", "HP", "MP", "Weapon Attack", "Magic Attack", "Weapon Defense", "Magic Defense", "Accuracy", "Avoidability", "Hands", "Speed", "Jump");
var selected;
var statsSel;
var item = 
Array(
			//-------耳环-------
			Array(1032025,400,1), //叶子耳环
			Array(1032026,400,1), //黄水晶耳环
			Array(1032027,400,1), //黑水晶耳环
			Array(1032028,400,1), //红水晶耳环
			Array(1032035,300,1), //枫叶耳环
			Array(1032040,300,1), //枫叶型耳环
			Array(1032041,300,1), //枫叶型耳环
			Array(1032042,300,1), //枫叶型耳环
			Array(1032047,200,1), //可乐耳环
			Array(1032055,200,1), //工作人员C的旧收信机
			Array(1032056,200,1), //工作人员C的旧收信机
			Array(1032057,200,1), //工作人员C的旧收信机
			Array(1032058,200,1), //工作人员C钛质收信机
			//-------帽子-------
			Array(1002418,100,1), //废报纸头盔
			Array(1002419,300,1), //枫叶帽
			Array(1002424,300,1), //红马术帽
			Array(1002425,300,1), //蓝马术帽
			Array(1002436,300,1), //长老斯坦之帽
			Array(1002441,300,1), //热血头带
			Array(1002448,300,1), //紫色头巾
			Array(1002452,300,1), //黑星白头巾
			Array(1002453,300,1), //白星黑头巾
			Array(1002454,300,1), //红星黑头巾
			Array(1002455,300,1), //黑星红头巾
			Array(1002492,300,1), //白色棒球帽
			Array(1002543,300,1), //板栗帽
			Array(1002550,300,1), //黑色格莱西头盔
			Array(1002551,300,1), //蓝龙头盔
			Array(1002554,300,1), //武艺头绳
			Array(1002562,300,1), //青苹果帽
			Array(1002583,300,1), //蝙蝠客头套
			Array(1002609,300,1), //兔耳魔法帽
			Array(1002610,300,1), //水手头巾
			Array(1002613,300,1), //水手帽
			Array(1002616,300,1), //水兵头巾
			Array(1002619,300,1), //兵长头巾
			Array(1002622,300,1), //水兵帽
			Array(1002625,300,1), //海盗睡帽
			Array(1002628,300,1), //三眼海盗帽
			Array(1002631,300,1), //船头
			Array(1002634,300,1), //骷髅巾
			Array(1002637,300,1), //绞杀包头
			Array(1002640,10,1), //冲锋帽
			Array(1002643,10,1), //血海头巾
			Array(1002656,10,1), //白色忍者头巾
			Array(1002663,10,1), //可乐帽子
			Array(1002665,10,1), //西红柿帽
			Array(1002677,10,1), //玩具匠人帽
			Array(1002695,10,1), //幽灵帽
			Array(1002699,10,1), //南瓜帽子
			Array(1002707,10,1), //假面绅士帽子
			Array(1002711,10,1), //白乖乖猫耳
			Array(1002712,10,1), //黑乖乖猫耳
			Array(1002723,10,1), //月饼帽
			Array(1002760,10,1), //地球帽
			Array(1002761,10,1), //枫叶面具
			Array(1002773,10,1), //金龙头盔
			Array(1002776,10,1), //永恒冠军盔
			Array(1002777,10,1), //永恒玄妙帽
			Array(1002778,10,1), //永恒霓翎帽
			Array(1002779,10,1), //永恒迷踪帽
			Array(1002780,10,1), //永恒海王星
			Array(1002790,10,1), //重生冠军盔
			Array(1002791,10,1), //重生玄妙帽
			Array(1002792,10,1), //重生霓翎帽
			Array(1002793,10,1), //重生迷踪帽
			Array(1002794,10,1), //重生海王星
			//------披风------
			Array(1102029,300,1), //白妖精披风
			Array(1102030,300,1), //黑妖精披风
			Array(1102031,300,1), //绿龙纹披风
			Array(1102032,300,1), //紫龙纹披风
			Array(1102033,300,1), //红龙纹披风
			Array(1102034,300,1), //蓝龙纹披风
			Array(1102035,300,1), //黑龙纹披风
			Array(1102040,100,1), //浪人披风(黄)
			Array(1102041,100,1), //浪人披风(粉)
			Array(1102042,100,1), //浪人披风(紫)
			Array(1102043,100,1), //浪人披风(褐)
			Array(1102046,30,1), //侯爵披风
			Array(1102047,20,1), //伯爵披风
			Array(1102048,10,1), //公爵披风
			Array(1102140,20,1), //卡帕莱特披风
			Array(1102147,20,1), //玩具匠人披风
			Array(1102172,10,1), //永恒不灭披风
			Array(1102174,100,1), //工作人员披风
			Array(1102166,100,1), //枫叶披风
			Array(1102167,100,1), //枫叶披风
			Array(1102168,100,1), //枫叶披风
			//------手套------
			Array(1082108,300,1), //黑神眼手套
			Array(1082109,300,1), //红天使手套
			Array(1082110,300,1), //蓝天使手套
			Array(1082111,300,1), //绿天使手套
			Array(1082112,300,1), //黑天使手套
			Array(1082114,300,1), //马尔斯蓝拳套
			Array(1082115,300,1), //马尔斯绿拳套
			Array(1082116,300,1), //马尔斯红拳套
			Array(1082117,300,1), //马尔斯黑拳套
			Array(1082118,300,1), //德古拉蓝手套
			Array(1082119,300,1), //德古拉紫手套
			Array(1082120,300,1), //德古拉红手套
			Array(1082121,300,1), //魔力绿手套
			Array(1082122,300,1), //魔力蓝手套
			Array(1082123,300,1), //魔力青手套
			Array(1082125,300,1), //弦影手套(红)
			Array(1082126,300,1), //弦影手套(绿)
			Array(1082127,300,1), //弦影手套(黑)
			Array(1082128,300,1), //裂天手套(绿)
			Array(1082129,300,1), //裂天手套(紫)
			Array(1082130,300,1), //裂天手套(紫)
			Array(1082131,300,1), //杰斯特手套(蓝)
			Array(1082132,300,1), //杰斯特手套(绿)
			Array(1082133,300,1), //杰斯特手套(红)
			Array(1082134,300,1), //杰斯特手套(黑)
			Array(1082135,300,1), //侠盗手套(蓝)
			Array(1082136,300,1), //侠盗手套(绿)
			Array(1082137,300,1), //侠盗手套(红)
			Array(1082138,300,1), //侠盗手套(黑)
			Array(1082139,300,1), //混天手套(黄)
			Array(1082140,300,1), //混天手套(紫)
			Array(1082141,300,1), //混天手套(褐)
			Array(1082142,300,1), //幻光手套(蓝)
			Array(1082143,300,1), //幻光手套(紫)
			Array(1082144,300,1), //幻光手套(红)
			Array(1082145,100,1), //工地手套(黄)
			Array(1082146,100,1), //工地手套(红)
			Array(1082147,100,1), //工地手套(蓝)
			Array(1082148,100,1), //工地手套(紫)
			Array(1082149,100,1), //工地手套(褐)
			Array(1082150,100,1), //工地手套(灰)
			Array(1082151,50,1), //幻魔手套(绿)
			Array(1082152,50,1), //幻魔手套(蓝)
			Array(1082153,50,1), //幻魔手套(红)
			Array(1082154,50,1), //幻魔手套(黑)
			Array(1082158,300,1), //红色条纹手套
			Array(1082159,300,1), //蓝色条纹手套
			Array(1082160,300,1), //绿色条纹手套
			Array(1082163,300,1), //红猎人手套
			Array(1082164,300,1), //蓝色元素手套
			Array(1082167,300,1), //黑色格丽纳手套
			Array(1082168,300,1), //青龙手套
			Array(1082175,300,1), //马绍尔手套(赤)
			Array(1082176,300,1), //马绍尔手套(青)
			Array(1082177,300,1), //马绍尔手套(紫
			Array(1082178,300,1), //马绍尔手套(桃)
			Array(1082179,300,1), //马绍尔手套(黄)
			Array(1082234,10,1), //永恒定边手套
			Array(1082235,10,1), //永恒逍遥手套
			Array(1082236,10,1), //永恒白云手套
			Array(1082237,10,1), //永恒探云手套
			Array(1082238,10,1), //永恒抚浪手套
			Array(1082239,10,1), //重生定边手套
			Array(1082240,10,1), //重生逍遥手套
			Array(1082241,10,1), //重生白云手套
			Array(1082242,10,1), //重生探云手套
			Array(1082243,10,1), //重生抚浪手套
			//-------武器------
			Array(1302016,300,1), //黄色雨伞
			Array(1302049,300,1), //光线鞭子
			Array(1302050,300,1), //战剑
			Array(1302051,300,1), //树灵之剑
			Array(1302052,300,1), //奇型刀
			Array(1302053,300,1), //奇型刀
			Array(1302054,300,1), //汤勺
			Array(1302056,300,1), //一刀两断
			Array(1302058,300,1), //冒险岛伞
			Array(1302059,300,1), //狂龙闪电剑
			Array(1302060,300,1), //战剑
			Array(1302061,300,1), //蔓藤鞭子
			Array(1302063,300,1), //燃烧的火焰刀
			Array(1302064,300,1), //枫叶突击剑
			Array(1302066,300,1), //枫叶3年旗
			Array(1302067,300,1), //枫叶庆典旗
			Array(1302068,300,1), //薄光刃
			Array(1302071,300,1), //粉色花边游泳圈
			Array(1302077,300,1), //新手战士之剑
			Array(1302080,300,1), //七彩霓虹灯泡
			Array(1302081,10,1), //永恒破甲剑
			Array(1302084,300,1), //火柴
			Array(1302085,300,1), //叉子
			Array(1302086,10,1), //重生破甲剑
			Array(1302087,300,1), //火炬
			Array(1302104,300,1), //鱿鱼剑
			Array(1302105,10,1), //圣诞六翼天使武器(单手剑)
			Array(1312030,300,1), //烛影摇红
			Array(1312031,300,1), //狂龙怒斩
			Array(1312032,300,1), //枫叶破击斧
			Array(1312033,300,1), //枫叶3年旗
			Array(1312034,300,1), //粉色花边游泳圈
			Array(1312037,10,1), //永恒断蚺斧
			Array(1312038,10,1), //重生断蚺斧
			Array(1312039,10,1), //圣诞六翼天使武器(单手斧)
			Array(1322000,300,1), //铁瓜锤
			Array(1322001,300,1), //锤子
			Array(1322002,300,1), //钢锤
			Array(1322003,300,1), //棒棒果
			Array(1322004,300,1), //奇型锤
			Array(1322005,300,1), //棍棒
			Array(1322006,300,1), //钢管
			Array(1322007,300,1), //皮制手提包
			Array(1322008,300,1), //007提包
			Array(1322009,100,1), //马桶吸
			Array(1322010,300,1), //方形铁铲
			Array(1322011,300,1), //三角铁铲
			Array(1322012,100,1), //红色砖头
			Array(1322014,300,1), //大战斗锤
			Array(1322015,300,1), //骑士锤
			Array(1322016,300,1), //重锤
			Array(1322017,300,1), //旋风锤
			Array(1322018,300,1), //巨型锤
			Array(1322019,300,1), //暴风锤
			Array(1322020,300,1), //黄金暴风锤
			Array(1322021,300,1), //黑游泳圈
			Array(1322022,300,1), //红花纹游泳圈
			Array(1322023,300,1), //蓝花纹游泳圈
			Array(1322024,300,1), //紫游泳圈
			Array(1322025,300,1), //救命游泳圈
			Array(1322026,300,1), //彩虹游泳圈
			Array(1322027,10,1), //米伽勒的平底锅
			Array(1322028,300,1), //钉头锤
			Array(1322029,300,1), //雷神钉
			Array(1322031,300,1), //葵花宝典
			Array(1322032,300,1), //铁头锤
			Array(1322033,300,1), //鬼怪棒
			Array(1322034,300,1), //铁棍
			Array(1322035,300,1), //大战斗锤
			Array(1322036,300,1), //旋风锤
			Array(1322037,300,1), //巨型锤
			Array(1322038,300,1), //暴风锤
			Array(1322051,300,1), //七夕
			Array(1322052,300,1), //狂龙地锤
			Array(1322054,300,1), //枫叶地震锤
			Array(1322055,300,1), //枫叶3年旗
			Array(1322056,300,1), //粉色花边游泳圈
			Array(1322060,10,1), //永恒惊破天
			Array(1322061,10,1), //重生惊破天
			Array(1322065,10,1), //圣诞六翼天使武器(单手钝器)
			Array(1332026,300,1), //闪电刃
			Array(1332027,300,1), //飞羽刃
			Array(1332028,300,1), //烈焰之刃
			Array(1332029,300,1), //双古剑
			Array(1332030,300,1), //团扇
			Array(1332031,300,1), //龙刃
			Array(1332032,300,1), //圣诞树
			Array(1332033,300,1), //水晶刃
			Array(1332034,300,1), //破碎刃
			Array(1332035,300,1), //双翼刃
			Array(1332036,300,1), //凤凰刃
			Array(1332037,300,1), //黑精灵拳刃
			Array(1332038,300,1), //水晶刃
			Array(1332039,300,1), //破碎刃
			Array(1332040,300,1), //双翼刃
			Array(1332041,300,1), //凤凰刃
			Array(1332042,300,1), //黑精灵拳刃
			Array(1332043,300,1), //水晶刃
			Array(1332044,300,1), //破碎刃
			Array(1332045,300,1), //双翼刃
			Array(1332046,300,1), //凤凰刃
			Array(1332047,300,1), //黑精灵拳刃
			Array(1332049,300,1), //蝉翼龙牙破
			Array(1332050,300,1), //半月龙鳞裂
			Array(1332051,300,1), //黄金双牙钩
			Array(1332052,300,1), //阴风碎魂刃
			Array(1332053,300,1), //野外烧烤串
			Array(1332054,300,1), //闪电飞刀
			Array(1332055,300,1), //枫叶锁魄铗
			Array(1332056,300,1), //枫叶追魂刺
			Array(1332057,300,1), //枫叶3年旗
			Array(1332059,300,1), //粉色花边游泳圈
			Array(1332063,300,1), //初级盗贼的短剑
			Array(1332066,300,1), //新手刮胡刀
			Array(1332073,10,1), //永恒狂鲨锯
			Array(1332074,10,1), //永恒断首刃
			Array(1332075,10,1), //重生狂鲨锯
			Array(1332076,10,1), //重生断首刃
			Array(1332081,10,1), //圣诞六翼天使武器(短剑)
			Array(1372008,300,1), //金属短杖
			Array(1372009,300,1), //慈悲为怀
			Array(1372010,300,1), //嗜魂法杖
			Array(1372011,300,1), //羽扇
			Array(1372012,300,1), //水晶短杖
			Array(1372013,300,1), //竹杖
			Array(1372014,300,1), //火焰之杖
			Array(1372015,300,1), //天使之翼
			Array(1372016,300,1), //凤凰短杖
			Array(1372017,300,1), //领路灯
			Array(1372018,300,1), //法师短杖
			Array(1372019,300,1), //大魔法师短杖
			Array(1372020,300,1), //火焰之杖
			Array(1372021,300,1), //天使之翼
			Array(1372022,300,1), //法师短杖
			Array(1372023,300,1), //大魔法师短杖
			Array(1372024,300,1), //火焰之杖
			Array(1372025,300,1), //天使之翼
			Array(1372027,300,1), //法师短杖
			Array(1372028,300,1), //大魔法师短杖
			Array(1372029,300,1), //火焰之杖
			Array(1372030,300,1), //天使之翼
			Array(1372031,300,1), //圣贤短杖
			Array(1372032,300,1), //佘太君龙杖
			Array(1372033,300,1), //圣贤短杖
			Array(1372034,300,1), //枫叶仙姬杖
			Array(1372035,300,1), //火灵珠短杖
			Array(1372036,300,1), //毒灵珠短杖
			Array(1372037,300,1), //冰灵珠短杖
			Array(1372038,300,1), //雷灵珠短杖
			Array(1372039,300,1), //爆炎之杖
			Array(1372040,300,1), //剧毒之杖
			Array(1372041,300,1), //寒冰之杖
			Array(1372042,300,1), //狂雷之杖
			Array(1372043,300,1), //初级魔法师的杖
			Array(1372044,10,1), //永恒蝶翼杖
			Array(1372045,10,1), //重生蝶翼杖
			Array(1372046,10,1), //圣诞六翼天使武器(短杖)
			Array(1382000,300,1), //木制长杖
			Array(1382001,300,1), //精灵长杖
			Array(1382002,300,1), //法师长杖
			Array(1382003,300,1), //蓝宝石长杖
			Array(1382004,300,1), //古树长杖
			Array(1382005,300,1), //祖母綠长杖
			Array(1382006,300,1), //白龙之杖
			Array(1382007,300,1), //魔灵之翼
			Array(1382008,300,1), //魔灵之魂
			Array(1382009,300,1), //枫叶权杖
			Array(1382010,300,1), //死灵法杖
			Array(1382011,300,1), //枫树杖
			Array(1382012,300,1), //枫叶杖
			Array(1382013,300,1), //烈焰之杖
			Array(1382014,300,1), //孙家之杖
			Array(1382015,10,1), //毒蘑菇
			Array(1382016,10,1), //香菇
			Array(1382017,300,1), //金轮杖
			Array(1382018,300,1), //翡翠之杖
			Array(1382019,300,1), //护法之杖
			Array(1382020,300,1), //精灵长杖
			Array(1382021,300,1), //白龙之杖
			Array(1382022,300,1), //魔灵之翼
			Array(1382023,300,1), //死灵法杖
			Array(1382024,300,1), //魔灵之魂
			Array(1382025,300,1), //精灵长杖
			Array(1382026,300,1), //白龙之杖
			Array(1382027,300,1), //魔灵之翼
			Array(1382028,300,1), //死灵法杖
			Array(1382029,300,1), //魔灵之魂
			Array(1382030,300,1), //精灵长杖
			Array(1382031,300,1), //白龙之杖
			Array(1382032,300,1), //魔灵之翼
			Array(1382033,300,1), //死灵法杖
			Array(1382034,300,1), //魔灵之魂
			Array(1382035,300,1), //冰肌玲珑杖
			Array(1382036,300,1), //黑精灵王杖
			Array(1382037,300,1), //偃月之杖
			Array(1382039,300,1), //枫叶丹心杖
			Array(1382040,300,1), //枫叶3年旗
			Array(1382041,300,1), //夜行權杖
			Array(1382042,300,1), //粉色花边游泳圈
			Array(1382045,300,1), //火灵珠长杖
			Array(1382046,300,1), //毒灵珠长杖
			Array(1382047,300,1), //冰灵珠长杖
			Array(1382048,300,1), //雷灵珠长杖
			Array(1382049,10,1), //朱雀长杖
			Array(1382050,10,1), //玄武长杖
			Array(1382051,10,1), //白虎长杖
			Array(1382052,10,1), //青龙长杖
			Array(1382057,10,1), //永恒冰轮杖
			Array(1382059,10,1), //重生冰轮杖
			Array(1382062,10,1), //圣诞六翼天使武器(长杖)
			Array(1402006,300,1), //高原之剑
			Array(1402007,300,1), //半月巨刀
			Array(1402008,300,1), //钢铁剑
			Array(1402009,300,1), //木球棍
			Array(1402010,300,1), //铝球棍
			Array(1402011,300,1), //无极剑
			Array(1402012,300,1), //霸王剑
			Array(1402013,300,1), //白日剑
			Array(1402014,10,1), //温度计
			Array(1402015,300,1), //亚历山大之剑
			Array(1402016,300,1), //所罗门之剑
			Array(1402017,300,1), //船长佩剑
			Array(1402018,300,1), //幻木剑
			Array(1402019,300,1), //大刀
			Array(1402020,300,1), //虎剑
			Array(1402021,300,1), //无极剑
			Array(1402022,300,1), //霸王剑
			Array(1402023,300,1), //亚历山大之剑
			Array(1402024,300,1), //大刀
			Array(1402025,300,1), //虎剑
			Array(1402026,300,1), //无极剑
			Array(1402027,300,1), //霸王剑
			Array(1402028,300,1), //亚历山大之剑
			Array(1402029,300,1), //鬼刺狼牙棒
			Array(1402030,300,1), //大刀
			Array(1402031,300,1), //虎剑
			Array(1402032,300,1), //无极剑
			Array(1402033,300,1), //霸王剑
			Array(1402034,300,1), //亚历山大之剑
			Array(1402035,300,1), //斩天刀
			Array(1402036,300,1), //飞龙巨剑
			Array(1402037,50,1), //龙背刃
			Array(1402039,300,1), //枫叶枭首剑
			Array(1402040,300,1), //枫叶3年旗
			Array(1402041,300,1), //粉色花边游泳圈
			Array(1402044,300,1), //南瓜灯笼
			Array(1402046,10,1), //永恒玄冥剑
			Array(1402047,10,1), //重生玄冥剑
			Array(1402053,10,1), //圣诞六翼天使武器(双手剑)
			Array(1412000,300,1), //双手斧
			Array(1412001,300,1), //铁斧
			Array(1412002,300,1), //钢铁斧
			Array(1412003,300,1), //太阳之斧
			Array(1412004,300,1), //绿蛇刀
			Array(1412005,300,1), //格斗斧
			Array(1412006,300,1), //重型巨斧
			Array(1412007,300,1), //光明斧
			Array(1412008,300,1), //雷电斧
			Array(1412009,300,1), //大力神之斧
			Array(1412021,300,1), //龙魂祭
			Array(1412022,300,1), //太阳之斧
			Array(1412023,300,1), //光明斧
			Array(1412024,300,1), //雷电斧
			Array(1412025,300,1), //大力神之斧
			Array(1412026,300,1), //炼狱魔龙斧
			Array(1412027,300,1), //枫叶乾坤轮
			Array(1412028,300,1), //枫叶3年旗
			Array(1412029,300,1), //粉色花边游泳圈
			Array(1412033,10,1), //永恒碎鼋斧
			Array(1412034,10,1), //重生碎鼋斧
			Array(1412035,10,1), //圣诞六翼天使武器(双手斧)
			Array(1422004,300,1), //板手
			Array(1422005,300,1), //黄金锤
			Array(1422006,300,1), //十字镐
			Array(1422007,300,1), //巨人锤
			Array(1422008,300,1), //大锤
			Array(1422009,300,1), //妖精之锤
			Array(1422010,300,1), //封魂之锤
			Array(1422011,300,1), //酒瓶
			Array(1422012,300,1), //雷神之锤
			Array(1422013,300,1), //狮子之魂
			Array(1422014,300,1), //枫叶锤
			Array(1422015,300,1), //黄金锤
			Array(1422028,300,1), //金龙轰天锤
			Array(1422029,300,1), //枫叶轰天镗
			Array(1422030,100,1), //粉红海豹抱枕
			Array(1422031,100,1), //蓝色海豹抱枕
			Array(1422032,300,1), //枫叶3年旗
			Array(1422033,300,1), //粉色花边游泳圈
			Array(1422036,300,1), //玩具匠人的锤子
			Array(1422037,10,1), //永恒威震天
			Array(1422038,10,1), //重生威震天
			Array(1422039,10,1), //圣诞六翼天使武器(双手钝器)
			Array(1432028,300,1), //奥丁手戟
			Array(1432030,300,1), //红莲落神枪
			Array(1432031,300,1), //三支枪
			Array(1432032,300,1), //长八蛇矛
			Array(1432033,300,1), //十字枪
			Array(1432034,300,1), //银龙枪
			Array(1432035,300,1), //奥丁手戟
			Array(1432037,300,1), //枫叶大将旗
			Array(1432038,10,1), //盘龙七冲枪
			Array(1432039,300,1), //钓鱼竿
			Array(1432040,300,1), //枫叶钻天枪
			Array(1432041,300,1), //枫叶3年旗
			Array(1432042,300,1), //粉色花边游泳圈
			Array(1432046,10,1), //圣诞树手杖
			Array(1432047,10,1), //永恒显圣枪
			Array(1432048,300,1), //铲子
			Array(1432049,10,1), //重生显圣枪
			Array(1432050,10,1), //圣诞六翼天使武器(枪)
			Array(1442002,300,1), //月灵戟
			Array(1442003,300,1), //斧戟
			Array(1442004,300,1), //拖把
			Array(1442005,300,1), //九龙刀
			Array(1442006,300,1), //蓝铁锤
			Array(1442007,300,1), //幻影
			Array(1442008,300,1), //黄龙刀
			Array(1442009,300,1), //月牙戟
			Array(1442010,300,1), //方天戟
			Array(1442011,300,1), //冲浪板
			Array(1442012,300,1), //天空雪板
			Array(1442013,300,1), //沧海雪板
			Array(1442014,300,1), //银雪板
			Array(1442015,300,1), //黄金雪板
			Array(1442016,300,1), //黑雪板
			Array(1442017,300,1), //赤血雪板
			Array(1442018,10,1), //冻冻鱼
			Array(1442019,300,1), //月神刀
			Array(1442020,300,1), //巨灵开山斧
			Array(1442021,300,1), //黄拖把
			Array(1442022,300,1), //白拖把
			Array(1442023,300,1), //黑拖把
			Array(1442024,300,1), //枫叶矛
			Array(1442025,300,1), //青龙偃月刀
			Array(1442026,300,1), //红色冲浪板
			Array(1442027,300,1), //绿色冲浪板
			Array(1442028,300,1), //蓝色冲浪板
			Array(1442029,300,1), //紫色冲浪板
			Array(1442030,300,1), //枫之雪板
			Array(1442031,300,1), //九龙刀
			Array(1442032,300,1), //方天戟
			Array(1442033,300,1), //黄龙刀
			Array(1442034,300,1), //月神刀
			Array(1442035,300,1), //九龙刀
			Array(1442036,300,1), //方天戟
			Array(1442037,300,1), //黄龙刀
			Array(1442038,300,1), //月神刀
			Array(1442039,300,1), //冻冻鱼
			Array(1442040,300,1), //九龙刀
			Array(1442041,300,1), //方天戟
			Array(1442042,300,1), //黄龙刀
			Array(1442043,300,1), //月神刀
			Array(1442044,300,1), //战魂斗杀戟
			Array(1442045,300,1), //血龙神斧
			Array(1442046,300,1), //超级滑雪板
			Array(1442051,300,1), //枫叶强袭斧
			Array(1442052,300,1), //枫叶3年旗
			Array(1442053,300,1), //粉色花边游泳圈
			Array(1442054,300,1), //红色滑水板
			Array(1442055,300,1), //绿色滑水板
			Array(1442056,300,1), //蓝色滑水板
			Array(1442057,300,1), //紫色滑水板
			Array(1442063,10,1), //永恒神光戟
			Array(1442065,300,1), //蓝色冲浪板
			Array(1442066,300,1), //红色冲浪板
			Array(1442067,10,1), //重生神光戟
			Array(1442069,300,1), //红色冲浪板
			Array(1442070,300,1), //绿色冲浪板
			Array(1442071,10,1), //圣诞六翼天使武器(矛)
			Array(1452000,300,1), //战斗弓
			Array(1452001,300,1), //打猎弓
			Array(1452002,300,1), //长弓
			Array(1452003,300,1), //钢铁弓
			Array(1452004,300,1), //凤凰之弓
			Array(1452005,300,1), //雷电
			Array(1452006,300,1), //火焰之弓
			Array(1452007,300,1), //暴风弓
			Array(1452008,300,1), //天弓
			Array(1452009,300,1), //赤神弓
			Array(1452010,300,1), //青神弓
			Array(1452011,300,1), //黄神弓
			Array(1452012,300,1), //青龙弓
			Array(1452013,300,1), //朱雀弓
			Array(1452014,300,1), //黄虎弓
			Array(1452015,300,1), //玄武弓
			Array(1452016,300,1), //漂云之弓
			Array(1452017,300,1), //魔翼之弓
			Array(1452018,300,1), //天蝎之弓
			Array(1452019,300,1), //天鹰弓(白)
			Array(1452020,300,1), //天鹰弓(黄)
			Array(1452021,300,1), //天鹰弓(黑)
			Array(1452022,300,1), //枫叶弓
			Array(1452023,300,1), //曹家之弓
			Array(1452024,300,1), //绿林弓
			Array(1452025,300,1), //蓝色梅杜斯
			Array(1452026,300,1), //黑色梅杜斯
			Array(1452044,300,1), //金龙振翅弓
			Array(1452045,300,1), //枫叶HAPPY弓
			Array(1452046,300,1), //枫叶3年旗
			Array(1452048,300,1), //粉色花边游泳圈
			Array(1452051,300,1), //初级弓手的弓
			Array(1452057,10,1), //永恒惊电弓
			Array(1452059,10,1), //重生惊电弓
			Array(1452062,10,1), //圣诞六翼天使武器(弓)
			Array(1462000,300,1), //山羊弩
			Array(1462001,300,1), //弩弓
			Array(1462002,300,1), //战斗弩弓
			Array(1462003,300,1), //猎弩弓
			Array(1462004,300,1), //鹰弩
			Array(1462005,300,1), //双弦弩
			Array(1462006,300,1), //白银弩
			Array(1462007,300,1), //炎弩
			Array(1462008,300,1), //黄金弩
			Array(1462014,300,1), //枫叶玉弩
			Array(1462015,300,1), //光圣鹞弩(白)
			Array(1462016,300,1), //金圣鹞弩(黄)
			Array(1462017,300,1), //黑暗圣鹞弩
			Array(1462018,300,1), //红炎神机弩
			Array(1462019,300,1), //枫叶弩
			Array(1462020,300,1), //烈焰之弩
			Array(1462021,300,1), //闇黑弩
			Array(1462022,300,1), //黄色可撒弩
			Array(1462023,300,1), //山羊弩
			Array(1462024,300,1), //炎弩
			Array(1462025,300,1), //黄金弩
			Array(1462026,300,1), //破天弩弓
			Array(1462027,300,1), //黑暗弩弓
			Array(1462028,300,1), //山羊弩
			Array(1462029,300,1), //炎弩
			Array(1462030,300,1), //黄金弩
			Array(1462031,300,1), //破天弩弓
			Array(1462032,300,1), //黑暗弩弓
			Array(1462033,300,1), //山羊弩
			Array(1462034,300,1), //炎弩
			Array(1462035,300,1), //黄金弩
			Array(1462036,300,1), //破天弩弓
			Array(1462037,300,1), //黑暗弩弓
			Array(1462039,300,1), //黄金飞龙弩
			Array(1462040,300,1), //枫叶击星弩
			Array(1462041,300,1), //枫叶3年旗
			Array(1462043,300,1), //粉色花边游泳圈
			Array(1462050,10,1), //永恒冥雷弩
			Array(1462051,10,1), //重生冥雷弩
			Array(1462056,10,1), //圣诞六翼天使武器(弩)
			Array(1472051,300,1), //寒木升龙拳
			Array(1472052,300,1), //碧水落龙拳
			Array(1472053,300,1), //逆龙咆哮拳
			Array(1472054,300,1), //信玄
			Array(1472055,300,1), //枫叶定天拳
			Array(1472056,300,1), //枫叶3年旗
			Array(1472058,300,1), //粉色花边游泳圈
			Array(1472061,300,1), //初级飞侠拳套
			Array(1472063,300,1), //魔法手套
			Array(1472068,10,1), //永恒大悲赋
			Array(1472071,10,1), //重生大悲赋
			Array(1472077,10,1), //圣诞六翼天使武器(拳套)
			Array(1472800,300,1), //黄铜拳套
			Array(1482000,300,1), //指套
			Array(1482001,300,1), //拳甲
			Array(1482002,300,1), //格斗指虎
			Array(1482003,300,1), //三日月冲拳
			Array(1482004,300,1), //全覆式拳甲
			Array(1482005,300,1), //双翼拳甲
			Array(1482006,300,1), //刺棘拳甲
			Array(1482007,300,1), //蛇吻
			Array(1482008,300,1), //列翼拳甲
			Array(1482009,300,1), //强袭拳甲
			Array(1482010,300,1), //破坏者
			Array(1482011,300,1), //三刃雪钩
			Array(1482012,300,1), //剑龙拳甲
			Array(1482013,300,1), //撕裂者
			Array(1482014,300,1), //新手专用指套
			Array(1482015,300,1), //轻型覆拳甲
			Array(1482016,300,1), //轻型蛇吻
			Array(1482017,300,1), //比翼鸟
			Array(1482018,300,1), //突击拳甲
			Array(1482019,300,1), //冲击者
			Array(1482023,10,1), //永恒孔雀翎
			Array(1482024,10,1), //重生孔雀翎
			Array(1482025,300,1), //粉色花边游泳圈
			Array(1482029,10,1), //圣诞六翼天使武器(指节)
			Array(1482030,300,1), //枫叶3年旗
			Array(1492000,300,1), //短枪
			Array(1492001,300,1), //单发手铳
			Array(1492002,300,1), //大型手铳
			Array(1492003,300,1), //突击手铳
			Array(1492004,300,1), //银枪
			Array(1492005,300,1), //红杰克
			Array(1492006,300,1), //黑郁金香
			Array(1492007,300,1), //金钱豹
			Array(1492008,300,1), //速射手铳
			Array(1492009,300,1), //重装手铳
			Array(1492010,300,1), //雷明顿
			Array(1492011,300,1), //鲁格
			Array(1492012,300,1), //金枪
			Array(1492013,300,1), //枭龙
			Array(1492014,300,1), //新手专用短枪
			Array(1492015,300,1), //镀银枪
			Array(1492016,300,1), //猞猁
			Array(1492017,300,1), //急速手铳
			Array(1492018,300,1), //集火手铳
			Array(1492019,300,1), //德林杰
			Array(1492023,10,1), //永恒凤凰铳
			Array(1492025,10,1), //重生凤凰铳
			Array(1492026,300,1), //粉色花边游泳圈
			Array(1492030,10,1), //圣诞六翼天使武器(手枪)
			Array(1492034,300,1), //枫叶3年旗
			Array(1702138,300,1), //大火腿
			Array(1302073,300,1), //新加坡国旗（初学者）
			Array(1302074,300,1), //马来西亚国旗（初学者）
			Array(1302075,300,1), //新加坡国旗（单手剑）
			Array(1302076,300,1), //马来西亚国旗（单手剑）
			Array(1312035,300,1), //新加坡国旗（单手斧）
			Array(1312036,300,1), //马来西亚国旗（单手斧）
			Array(1322057,300,1), //新加坡国旗（单手杖）
			Array(1322058,300,1), //马来西亚国旗（单手杖）
			Array(1332060,300,1), //新加坡国旗（短剑）
			Array(1332061,300,1), //马来西亚国旗（短剑）
			Array(1382043,300,1), //新加坡国旗（长杖）
			Array(1382044,300,1), //马来西亚国旗（长杖）
			Array(1402042,300,1), //新加坡国旗（双手剑）
			Array(1412030,300,1), //新加坡国旗（双手斧）
			Array(1412031,300,1), //马来西亚国旗（双手斧）
			Array(1422034,300,1), //新加坡国旗（双手杖）
			Array(1432043,300,1), //新加坡国旗（枪）
			Array(1432044,300,1), //马来西亚国旗（枪）
			Array(1442058,300,1), //新加坡国旗（矛）
			Array(1452049,300,1), //新加坡国旗（弓）
			Array(1452050,300,1), //马来西亚国旗（弓）
			Array(1462044,300,1), //新加坡国旗（弩）
			Array(1462045,300,1), //马来西亚国旗（弩）
			Array(1472059,300,1), //新加坡国旗（指节）
			Array(1472060,300,1), //马来西亚国旗（指节）
			//------药水------
			Array(2000004,900,20), //特殊药水
			Array(2000005,700,20), //超级药水
			//-----椅子-----
			Array(3010013,20,1), //悠长假期
			Array(3010014,20,1), //月亮弯
			Array(3010018,20,1), //椰子树沙滩椅
			Array(3010019,20,1), //寿司椅
			Array(3010021,20,1), //暖暖桌
			Array(3010025,20,1), //枫叶纪念凳
			Array(3010028,20,1), //海盗的俘虏
			Array(3010029,20,1), //蓝环凳
			Array(3010030,20,1), //黑环凳
			Array(3010031,20,1), //红环凳
			Array(3010032,20,1), //黄环凳
			Array(3010033,20,1), //绿环凳
			Array(3010037,20,1), //猪猪凳
			Array(3010044,20,1), //同一红伞下
			Array(3012001,20,1), //篝火
			Array(3012002,20,1), //浴桶
			Array(3010073,20,1), //PB克缤
			Array(3012003,20,1) //爱心椅子

);
var itemjf=new Array("1122019","1122024","1122025","1132000","1132001","1132002","1142000","1142001","1142002","1142003","1142004","1142005","1142006","1142007","1142008","1142014","1142015","1142016","1142017","1142074","1142151","1142173","1142174","1142175","1142176","1142177","1142178","1142179","1142186","1142189","1142124","1142167");
var itemjfcost=new Array("200","800","800","300","400","500","200","800","600","600","600","1500","2000","1800","1800","800","800","800","800","2000","2000","3000","3000","3000","3000","3000","3000","10000","10000","10000","10000","10000");

var itemgp=new Array("1122019","1122024","1122025","1132000","1132001","1132002","1142000","1142001","1142002","1142003","1142004","1142005","1142006","1142007","1142008","1142014","1142015","1142016","1142017","1142074","1142151","1142173","1142174","1142175","1142176","1142177","1142178","1142179","1142186","1142189","1142124","1142167");
var itemgpcost=new Array("500","1500","1500","800","1200","1800","800","2500","2400","2400","2400","3000","3800","3600","3600","2500","2500","2500","2500","5000","5000","6000","6000","7000","7000","7000","8000","30000","30000","30000","30000","25000");
var chanced = Math.floor(Math.random()*2)+1;

function start() {
if(cm.getChar().getVip() >= 8) {
	status = -1;
	action(1, 0, 0);
    } else {
    cm.sendOk("我专为VIP8以上会员服务.\r\n你不是超级VIP8或者你不在超级VIP地图里，所以什么都看不到...")
    }
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
				cm.sendSimple("飞升系统已经开放，快来看看如何快速飞升吧！！\r\n\r\n  #b#L2##b我要转生[vip8转管理员]#l#L11#转生抽奖关闭中#l\r\n\r\n #L5##e#r↓↓当转生达到50转，请看下面的飞升说明↓↓#n#b#l\r\n\r\n#L6#☆☆查询飞升条件以及好处[本服特色-详细说明]☆☆#l\r\n\r\n     #L8#开始进行飞升[成仙吧，我就是神....]#l\r\n#L9#飞升装备合成[可合至帝王]#l#L10#飞升副本挑战[暴飞升装备]#l\r\n");
		} else if (status == 1) {
			if (selection >= 1001) {
				cm.dispose();
			}
			if (selection == 10) {
				cm.dispose();
			}
			if (selection == 6) {
				cm.sendNext("#r问：飞升是什么意思，为何要开通飞升？#k\r\n答：新来的玩家可能没有什么觉得，但是当你玩了一段时间后，转生达到一定等级，就感觉很无聊，所以我们为了改变这一状况，特开通#b飞升系统#k，飞升来自于火暴3D游戏#b[诛仙]#k，经过我们技术的改编，最终制作成了我们冒险岛自己的一种模式，简单的说就是：#b一次飞升，保留属性点，同时能穿飞升的装备#k。下面我简单的把飞升前和飞升后作一个对比，让大家对飞升有更清晰的了解：\r\n#d飞升目前大致分为：圣人 - 神仙 - 帝王\r\n分别有这三种的装备为[圣]，[仙]，[帝],由怪暴出不同属性，随机的飞升装备，飞升的装备各种属性都比普通的好，你可能在打怪的过程中已经暴出，但是不能穿，双击会提示您没有飞升，不能穿戴，属性大致为：\r\n     #b[圣]  比普通的要高10-15随机提升\r\n     [仙]  比普通的要高20-30随机提升\r\n     [帝]  比普通的要高30-45随机提升\r\n------------------------------------------------\r\n飞升前：[经验倍数没有]#r后：[圣]1.3倍[仙]1.6倍[帝]2倍\r\n#b飞升前：[PK倍数没有]#r飞升后：[圣]1.3倍[仙]1.6倍[帝]2倍\r\n飞升前：[转生后的属性点为:100+转生次数*100点]\r\n#r飞升后：\r\n[圣][转生后的属性点为:500+转生次数*100点]\r\n[仙][转生后的属性点为:1000+转生次数*100点]\r\n[帝][转生后的属性点为:2000+转生次数*100点]");
				cm.dispose();

			}
			if (selection == 8) {
				typed=80;
				cm.sendSimple("勇敢的人类，现在就是你得道成仙的最佳时期:\r\n[提醒:目前只开放神仙]\r\n[当有10个玩家都飞升为神仙就会激活#r帝王#k的飞升]\r\n#r[飞升注意事项]\r\n[飞升后你的转生等级变为0转，提升飞升等级，其它不变]\r\n[飞升后，在转一次生属性点就变正常]\r\n#L1001##r------------------------------------------------#b#l\r\n#b#L1#我是凡人，立即飞升为圣人[需要到达50转生]#l\r\n#L2#我是圣人，立即飞升为神仙[需要到达100转生]#l\r\n#L3#我是神仙，立即飞升为帝王[需要到达300转生]#l\r\n#L1002##r------------------------------------------------#b#l");
				

			}
			if (selection == 9) {
				typed=10;
				cm.sendNext("勇敢的人类，我相信你能超越所有的凡人，维护世界和平，创造和谐冒险的任务就要落到你的头上了..\r\n     #r[请将要要合成的装备放在装备栏最前面]");

			}
			if (selection == 11) {
				//typed=20;
				cm.sendNext("嘿，你转了几转了呀，如果你的转生等级为#r5#k的倍数，就可以来我这里抽奖咯，每转仅限抽一次哟，#b打个比方：你现在5转，那你就有一次抽奖机会，你到10转的时候，你又有一次机会,以此类推..\r\n#k怎么样，来试一次么?我这里的抽奖和飞天猪那里不一样，有机率获得#r+属性攻击项链和腰带和椅子#k哟..\r\n#eLet's GO.....您目前转生: #r"+cm.getChar().getzs()+"#k次");
			}
			if (selection == 2) {
				typed=27;
				if(cm.getJob().getId() >= 1000 && cm.getJob().getId() <= 1600 && cm.getLevel() > 179){
					if(cm.getChar().getzs()>=50){
						cm.sendNext("伟大的#b#h ##k,您目前转生: #r"+cm.getChar().getzs()+"#k次 共有元宝:#r"+cm.getzb()+"#k个.\r\n你已经通过一个漫长而充满挑战的道路,终于成为了风起云涌的人物.按照您目前的转生等级,如果您能给我#b[0元宝]#k,我可以用我的乾坤大挪移心法,助你进行投胎转世!您将成为1级的 #b新手#k, #r技能保留#k.转生后你能获得#r(#r保留100点#k+转生次数*100)#k个属性点。\r\n#k#e你是否想#r转生#k呢?.现在转生还有可能得到神秘礼品.\r\n#b[如果你已经#r飞升#b，将得到更多的属性点,请查飞升说明]");
					}else{
						cm.sendNext("伟大的#b#h ##k,您目前转生: #r"+cm.getChar().getzs()+"#k次 共有元宝:#r"+cm.getzb()+"#k个.\r\n你已经通过一个漫长而充满挑战的道路,终于成为了风起云涌的人物.按照您目前的转生等级,如果您能给我#b(转生次数*0个元宝)即:"+((cm.getChar().getzs()+1)*0)+"个[如果超过50转，每转则只需要0元宝]#k,我可以用我的乾坤大挪移心法,助你进行投胎转世!您将成为1级的 #b新手#k, #r技能保留#k.转生后你能获得#r(#r保留100点#k+转生次数*200)#k个属性点。\r\n#k#e你是否想#r转生#k呢?.现在转生还有可能得到神秘礼品.\r\n#b[如果你已经#r飞升#b，将得到更多的属性点,请查飞升说明]");
					}
                
            	}else if (cm.getLevel() > 199) { 
							if(cm.getChar().getzs()>=50){
								cm.sendNext("伟大的#b#h ##k,您目前转生: #r"+cm.getChar().getzs()+"#k次 共有元宝:#r"+cm.getzb()+"#k个.\r\n你已经通过一个漫长而充满挑战的道路,终于成为了风起云涌的人物.按照您目前的转生等级,如果您能给我#b[0元宝]#k,我可以用我的乾坤大挪移心法,助你进行投胎转世!您将成为1级的 #b新手#k, #r技能保留#k.转生后你能获得#r(#r保留100点#k+转生次数*100)#k个属性点。\r\n#k#e你是否想#r转生#k呢?.现在转生还有可能得到神秘礼品.\r\n#b[如果你已经#r飞升#b，将得到更多的属性点,请查飞升说明]");
							}else{
								cm.sendNext("伟大的#b#h ##k,您目前转生: #r"+cm.getChar().getzs()+"#k次 共有元宝:#r"+cm.getzb()+"#k个.\r\n你已经通过一个漫长而充满挑战的道路,终于成为了风起云涌的人物.按照您目前的转生等级,如果您能给我#b(转生次数*0个元宝)即:"+((cm.getChar().getzs()+1)*0)+"个[如果超过50转，每转则只需要0元宝]#k,我可以用我的乾坤大挪移心法,助你进行投胎转世!您将成为1级的 #b新手#k, #r技能保留#k.转生后你能获得#r(#r保留100点#k+转生次数*200)#k个属性点。\r\n#k#e你是否想#r转生#k呢?.现在转生还有可能得到神秘礼品.\r\n#b[如果你已经#r飞升#b，将得到更多的属性点,请查飞升说明]");
							}
				
				}else{
					cm.sendOk("对不起，骑士团职业必须达到180级 ,其它职业必须200级才能转生");
					cm.dispose();
				}
			}
		} else if (status == 2) {
			if(typed==27){
				var yubao=(cm.getChar().getzs()+1)*0;
					if(cm.getChar().getzs()>=50){
					yubao=0;
					}
					if(cm.getzb()>=yubao){
						typed=28;
						cm.sendSimple("元宝已经成功扣除，请选择你要转的职业#b\r\n#L0#转身管理员(新开)#l");
					}else{
						cm.sendOk("#b对不起，你没有足够的元宝★目前来看，你需要"+yubao+"个元宝");    
						cm.dispose();
						return;
					}
			}
			if(typed==80){
				if(selection==1){
					if(cm.getChar().getzs()>=50 && cm.getChar().getfs()==0){
						cm.getChar().setfs(1);
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[圣人]，超越了凡人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[圣人]，超越了凡人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[圣人]，超越了凡人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[圣人]，超越了凡人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[圣人]，超越了凡人!");
						cm.getChar().setzs(0);
						cm.sendOk("[恭喜]您成功的由凡人变成了#r[圣人]#k\r\n注意：你现在必须转一次生，才能恢复正常的属性点！\r\n从现在开始，你可以装备[圣]属性的装备，同时转生将得到更多的点，经验也比凡人要高，PK也高哟，快去体验一下吧！");
					}else{
						cm.sendOk("对不起，您没有达到50转，或者您已经不是凡人了。！");
					}
				}
				if(selection==2){
					if(cm.getChar().getzs()>=100 && cm.getChar().getfs()==1){
						cm.getChar().setfs(2);
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[神仙]，超越了圣人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[神仙]，超越了圣人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[神仙]，超越了圣人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[神仙]，超越了圣人!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[神仙]，超越了圣人!");
						cm.getChar().setzs(0);
						cm.sendOk("[恭喜]您成功的由凡人变成了#r[神仙]#k\r\n注意：你现在必须转一次生，才能恢复正常的属性点！\r\n从现在开始，你可以装备[仙]属性的装备，同时转生将得到更多的点，经验也比圣人要高，PK也高哟，快去体验一下吧！");
					}else{
						cm.sendOk("对不起，您没有达到100转，或者您不是[圣人]。！");
					}
				}
				if(selection==3){
					if(cm.getChar().getzs()>=300 && cm.getChar().getfs()==2){
						cm.getChar().setfs(3);
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[帝王]，超越了神仙!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[帝王]，超越了神仙!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[帝王]，超越了神仙!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[帝王]，超越了神仙!");
						cm.serverNotice(5,"[冒险岛公告]玩家:"+cm.getChar().getName()+" 飞升成功，正式升为[帝王]，超越了神仙!");
						cm.getChar().setzs(0);
						cm.sendOk("[恭喜]您成功的由神仙变成了#r[帝王]#k\r\n注意：你现在必须转一次生，才能恢复正常的属性点！\r\n从现在开始，你可以装备[帝王]属性的装备，同时转生将得到更多的点，经验也比圣人要高，PK也高哟，快去体验一下吧！");
					}else{
					cm.sendOk("对不起，您没有达到300转，或者您不是[帝王]。！");
					}
				}
				cm.dispose();
				return;
			}
			if(typed==10){
				typed=11;
				cm.sendSimple("请选择你要合成的装备:#b\r\n#L1#开始合成[仙]级别装备#l\r\n#L2#开始合成[帝]级别装备#l\r\n\r\n#r合成装备条件如下:#d\r\n1.需要5个低一级装备，比如你要合成[仙]属性的魔法杖，则需要5个[圣]属性的魔法杖\r\n2.需要10个力量水晶+10个敏捷水晶+10智慧水晶+10幸运水晶+500个枫叶+5000元宝+5000万冒险币\r\n3.合成有一定机率成功与失败，如果失败，除装备不回收以外，其它全回收，#rVIP会员的成功机率为1/2,普通玩家为1/4。\r\n4.合成成功后，装备将按高一级别的，如[仙]的属性随机给属性！");
			}
			if(typed==212){
				if(cm.getChar().getgodpoint()>=itemgpcost[selection]){
					cm.gainItem(itemgp[selection],1);
					cm.getChar().setgodpoint(-itemgpcost[selection]);
					cm.sendOk("恭喜您，兑换成功，扣除:"+itemgpcost[selection]+"点能量点！");
					cm.dispose();
					return;
				}else{
					cm.sendOk("对不起，您没有足够的能量点，能量点只能在市场站着泡点获得！");
					cm.dispose();
					return;
				}
			}
			if(typed==202){
				if(cm.getjf()>=itemjfcost[selection]){
					cm.gainItem(itemjf[selection],1);
					cm.setjf(-itemjfcost[selection]);
					cm.sendOk("恭喜您，兑换成功，扣除:"+itemjfcost[selection]+"点积分！");
					cm.dispose();
					return;
				}else{
					cm.sendOk("对不起，您没有足够的积分，积分可通过一些任务获得！");
					cm.dispose();
					return;
				}
			}
			if(typed==20){
					var str = (cm.getChar().getzs()/5);
					if(cm.getChar().getzs()==0){
						cm.sendOk("你目前的转生等级除以5不能整除，请在5，10，15，20....这些转生等级来抽奖，谢谢");
								cm.dispose();
								return;
					}
					var stred=str.toString();
					if(stred.split(".").length==1){
						if(cm.getBossLog(cm.getChar().getzs()+"ZS")>=1){
							cm.sendOk("对不起，您目前的转生等级已经抽过奖了！");
							cm.dispose();
							return;
						}
						var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
						for(var i = 1;i<=5;i++){
							if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
								cm.sendOk("您至少应该让所有包裹都空出一格");
								cm.dispose();
								return;
							}
						}
						var chance = Math.floor(Math.random()*1000);
						var finalitem = Array();
						for(var i = 0 ;i<item.length;i++){
							if(item[i][1] >= chance){
								finalitem.push(item[i]);
							}
						}
						if(finalitem.length != 0){
							var random = new java.util.Random();
							var finalchance = random.nextInt(finalitem.length);
							var itemId = finalitem[finalchance][0];
							var quantity = finalitem[finalchance][2];
							if(ii.getInventoryType(itemId).getType() == 1){
								var toDrop = ii.randomizeStats(ii.getEquipById(itemId));
							}else{
								var toDrop = new net.sf.odinms.client.Item(itemId, 0, quantity);
							}
							net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop);
							cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null,net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "通过转生抽奖功能获得，大家恭喜它！！！",toDrop, true).getBytes());
							
							cm.sendOk("希望你下次再来哦哈哈！");
							cm.setBossLog(cm.getChar().getzs()+"ZS");
							cm.dispose();
						}else{
							cm.sendOk("哎呀……你RP差到什么都没拿到！过段时间再来吧！");
							cm.setBossLog(cm.getChar().getzs()+"ZS");
							cm.dispose();
						}
					}else{
						cm.sendOk("你目前的转生等级除以5不能整除，请在5，10，15，20....这些转生等级来抽奖，谢谢！");
						cm.dispose();
					}
					return;
			}
			
		} else if (status == 3) {
			if(typed==28){
				if(cm.getChar().getzs()>=50){
				cm.setzb(-0);
			}else{
				cm.setzb(-(cm.getChar().getzs()+1)*0);
			}
			var statup = new java.util.ArrayList();
				var p = cm.getChar();
				var totAp = (cm.getChar().getzs()+1)*300+150;
				if(cm.getChar().getfs()==1){
					totAp+=500;
				}
				if(cm.getChar().getfs()==2){
					totAp+=1000;
				}
				if(cm.getChar().getfs()==3){
					totAp+=2000;
				}
				cm.getChar().setzs(cm.getChar().getzs()+1);
				p.setLevel(1);
				var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
				var toDrop = ii.randomizeStats(ii.getEquipById(4001129));
				if (selection == 0) {
					cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "成功进行了一次转世轮回变为管·理·员·职业，大家祝贺它吧！！！",toDrop, true).getBytes());
					cm.changeJob(net.sf.odinms.client.MapleJob.GM);
				}
				if (selection == 1) {
					cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "成功进行了一次转世轮回变为初心者，大家祝贺它吧！！！",toDrop, true).getBytes());
					cm.changeJob(net.sf.odinms.client.MapleJob.KNIGHT);
				}
				if (selection == 2) {
					cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMegas(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "成功进行了一次转世轮回变为战童，大家祝贺它吧！！！",toDrop, true).getBytes()); 
					cm.changeJob(net.sf.odinms.client.MapleJob.Ares);
				}
				p.setRemainingAp(totAp);
				p.setStr(4);
				p.setDex(4);
				p.setInt(4);
				p.setLuk(4);
				p.setExp(0);
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.STR, java.lang.Integer.valueOf(4)));
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.DEX, java.lang.Integer.valueOf(4)));
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.LUK, java.lang.Integer.valueOf(4)));
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.INT, java.lang.Integer.valueOf(4)));
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.EXP, java.lang.Integer.valueOf(0)));
				statup.add (new net.sf.odinms.tools.Pair(net.sf.odinms.client.MapleStat.AVAILABLEAP, java.lang.Integer.valueOf(p.getRemainingAp())));
				p.getClient().getSession().write (net.sf.odinms.tools.MaplePacketCreator.updatePlayerStats(statup));
                         if(cm.getChar().getfs()==1){
					cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★\r\n#r[由于你是圣人，属性点比凡人多500点，在次恭喜您]"); 
				}
				else if(cm.getChar().getfs()==2){
					cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★\r\n#r[由于你是神仙，属性点比凡人多1000点，在次恭喜您]"); 
				}
				else if(cm.getChar().getfs()==3){
					cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★\r\n#r[由于你是帝王，属性点比凡人多2000点，在次恭喜您]"); 
				}else{
					cm.sendOk("#b您做得非常好#k, 为你成功#e投胎转世#n高兴吧！★"); 
				}
				cm.getChar().levelUp();   
				cm.dispose();
			}
			if(typed==11){
				if(selection==1){
				var item1 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(1);
				var item2 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(2);
				var item3 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(3);
				var item4 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(4);
				var item5 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(5);
				var itemtext="";
				var check=true;
				var fscheck=0;
				var itemcheck=true;
				if(item1==null){
					itemtext+="#r第[1]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[1]格#v"+item1.getItemId()+"#\r\n"
					if(item1.getOwner().length()>0){
						if(item1.getOwner().substring(0, 3).equals("[圣]")==true){
							fscheck+=1;
						}
					}
				}
				if(item2==null){
					itemtext+="#r第[2]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[2]格#v"+item2.getItemId()+"#\r\n"
					if(item2.getOwner().length()>0){
						if(item2.getOwner().substring(0, 3).equals("[圣]")==true){
							fscheck+=1;
						}
					}
				}
				if(item3==null){
					itemtext+="#r第[3]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[3]格#v"+item3.getItemId()+"#\r\n"
					if(item3.getOwner().length()>0){
						if(item3.getOwner().substring(0, 3).equals("[圣]")==true){
							fscheck+=1;
						}
					}
				}
				if(item4==null){
					itemtext+="#r第[4]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[4]格#v"+item4.getItemId()+"#\r\n"
					if(item4.getOwner().length()>0){
						if(item4.getOwner().substring(0, 3).equals("[圣]")==true){
							fscheck+=1;
						}
					}
				}
				if(item5==null){
					itemtext+="#r第[5]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[5]格#v"+item5.getItemId()+"#\r\n"
					if(item5.getOwner().length()>0){
						if(item5.getOwner().substring(0, 3).equals("[圣]")==true){
							fscheck+=1;
						}
					}
				}
				if(cm.haveItem(4005000,10)==false || cm.haveItem(4005001,10)==false || cm.haveItem(4005002,10)==false || cm.haveItem(4005003,10)==false || cm.haveItem(4001126,500)==false || cm.getzb()<5000 || cm.getMeso()<50000000){
					itemcheck=false;
					itemtext+="[所需物品不齐，请检查]\r\n-----------------------------------\r\n";
				}
				if(check==false || fscheck<5 || itemcheck==false){
					cm.sendNext("OK，让我来检查一下你的装备栏位情况:\r\n"+itemtext+"\r\n#b对不起，按照目前的情况来看，你不符合条件，具体如下：\r\n1.前五格有的没有装备，或者不为同属性的[圣]级别装备.\r\n2.物品不齐全，请检查，需要10个力量水晶+10个敏捷水晶+10智慧水晶+10幸运水晶+500个枫叶+5000元宝+5000万冒险币");
					cm.dispose();
					return;
				}else{
					typed=13;
					cm.sendNext("OK，让我来检查一下你的装备栏位情况:\r\n"+itemtext+"\r\n#e恭喜，满足合成条件，点击下项开始合成!");
				}
				}
			if(selection==2){
				var item1 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(1);
				var item2 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(2);
				var item3 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(3);
				var item4 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(4);
				var item5 = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(5);
				var itemtext="";
				var check=true;
				var fscheck=0;
				var itemcheck=true;
				if(item1==null){
					itemtext+="#r第[1]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[1]格#v"+item1.getItemId()+"#\r\n"
					if(item1.getOwner().length()>0){
						if(item1.getOwner().substring(0, 3).equals("[仙]")==true){
							fscheck+=1;
						}
					}
				}
				if(item2==null){
					itemtext+="#r第[2]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[2]格#v"+item2.getItemId()+"#\r\n"
					if(item2.getOwner().length()>0){
						if(item2.getOwner().substring(0, 3).equals("[仙]")==true){
							fscheck+=1;
						}
					}
				}
				if(item3==null){
					itemtext+="#r第[3]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[3]格#v"+item3.getItemId()+"#\r\n"
					if(item3.getOwner().length()>0){
						if(item3.getOwner().substring(0, 3).equals("[仙]")==true){
							fscheck+=1;
						}
					}
				}
				if(item4==null){
					itemtext+="#r第[4]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[4]格#v"+item4.getItemId()+"#\r\n"
					if(item4.getOwner().length()>0){
						if(item4.getOwner().substring(0, 3).equals("[仙]")==true){
							fscheck+=1;
						}
					}
				}
				if(item5==null){
					itemtext+="#r第[5]格没有装备\r\n"
					check=false;
				}else{
					itemtext+="第[5]格#v"+item5.getItemId()+"#\r\n"
					if(item5.getOwner().length()>0){
						if(item5.getOwner().substring(0, 3).equals("[仙]")==true){
							fscheck+=1;
						}
					}
				}
				if(cm.haveItem(4005000,10)==false || cm.haveItem(4005001,10)==false || cm.haveItem(4005002,10)==false || cm.haveItem(4005003,10)==false || cm.haveItem(4001126,500)==false || cm.getzb()<5000 || cm.getMeso()<50000000){
					itemcheck=false;
					itemtext+="[所需物品不齐，请检查]\r\n-----------------------------------\r\n";
				}
				if(check==false || fscheck<5 || itemcheck==false){
					cm.sendNext("OK，让我来检查一下你的装备栏位情况:\r\n"+itemtext+"\r\n#e对不起，按照目前的情况来看，你不符合条件，具体如下：\r\n1.前五格有的没有装备，或者不为同属性的[仙]级别装备.\r\n2.物品不齐全，请检查，需要10个力量水晶+10个敏捷水晶+10智慧水晶+10幸运水晶+500个枫叶+5000元宝+5000万冒险币");
					cm.dispose();
					return;
				}else{
					typed=14;
					cm.sendNext("OK，让我来检查一下你的装备栏位情况:\r\n"+itemtext+"\r\n#e恭喜，满足合成条件，点击下项开始合成!");
				}
			}
			}
		} else if (status == 4) {
			if(typed==14){
				fsxian();
			}
			if(typed==13){
				var chance =Math.floor((Math.random()*3))+1;
				cm.gainItem(4005000,-10);
				cm.gainItem(4005001,-10);
				cm.gainItem(4005002,-10);
				cm.gainItem(4005003,-10);
				cm.gainItem(4001126,-500);
				cm.gainMeso(-50000000);
				cm.setzb(-5000);
				if(cm.getChar().getVip()>0){
					if(chance>=2 && chance<=3){
						var item = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(1);
						item.setOwner("[仙]☆飞升☆");
						if(item.getStr()!=0){
						   item.setStr(item.getStr()+(Math.random() * 10+10));
						}
						if(item.getDex()!=0){
						   item.setDex(item.getDex()+(Math.random() * 10+10));
						}
						if(item.getInt()!=0){
						   item.setInt(item.getInt()+(Math.random() * 10+10));
						}
						if(item.getLuk()!=0){
						   item.setLuk(item.getLuk()+(Math.random() * 10+10));
						}
						if(item.getMatk()!=0){
						   item.setMatk(item.getMatk()+(Math.random() * 10+10));
						}
						if(item.getWatk()!=0){
						   item.setWatk(item.getWatk()+(Math.random() * 10+10));
						}
						if(item.getAcc()!=0){
						   item.setAcc(item.getAcc()+(Math.random() * 5+5));
						}
						if(item.getWdef()!=0){
						   item.setWdef(item.getWdef()+(Math.random() * 3+7));
						}
						if(item.getMdef()!=0){
						   item.setMdef(item.getMdef()+(Math.random() * 3+7));
						}
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 5, 1, true);
						MapleInventoryManipulator.addFromDrop(cm.getChar().getClient(), item);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 1, 1, true);
						cm.getC().getSession().write(MaplePacketCreator.getCharInfo(cm.getChar()));
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 2, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 3, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 4, 1, true);
						cm.sendNext("#b恭喜您，成功啦，快去看看包包吧，相信你一定会喜欢的！");
						cm.dispose();
						return;
					}else{
						cm.sendNext("#r真失败，合成没有成功，在接在历，相信你一定能成功的！");
						cm.dispose();
						return;
					}

				}else{//非会员
					if(chance>=1){
						var item = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(1);
						item.setOwner("[仙]☆飞升☆");
						if(item.getStr()!=0){
						   item.setStr(item.getStr()+(Math.random() * 10+10));
						}
						if(item.getDex()!=0){
						   item.setDex(item.getDex()+(Math.random() * 10+10));
						}
						if(item.getInt()!=0){
						   item.setInt(item.getInt()+(Math.random() * 10+10));
						}
						if(item.getLuk()!=0){
						   item.setLuk(item.getLuk()+(Math.random() * 10+10));
						}
						if(item.getMatk()!=0){
						   item.setMatk(item.getMatk()+(Math.random() * 10+10));
						}
						if(item.getWatk()!=0){
						   item.setWatk(item.getWatk()+(Math.random() * 10+10));
						}
						if(item.getAcc()!=0){
						   item.setAcc(item.getAcc()+(Math.random() * 5+5));
						}
						if(item.getWdef()!=0){
						   item.setWdef(item.getWdef()+(Math.random() * 3+7));
						}
						if(item.getMdef()!=0){
						   item.setMdef(item.getMdef()+(Math.random() * 3+7));
						}
						
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 5, 1, true);
						MapleInventoryManipulator.addFromDrop(cm.getChar().getClient(), item);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 1, 1, true);
						cm.getC().getSession().write(MaplePacketCreator.getCharInfo(cm.getChar()));
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 2, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 3, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 4, 1, true);
						cm.sendNext("#b恭喜您，成功啦,你需要换一线，否则可能包包快去看看包包吧，相信你一定会喜欢的！");
						cm.dispose();
						return;
					}else{
						cm.sendNext(chance+"#r真失败，合成没有成功，在接在历，相信你一定能成功的！");
						cm.dispose();
						return;
					}
				}
			}
			
			cm.dispose();
		}
	}
}











function fsxian() {//合成帝属性装备
				var chance =Math.floor((Math.random()*3))+1;
				cm.gainItem(4005000,-10);
				cm.gainItem(4005001,-10);
				cm.gainItem(4005002,-10);
				cm.gainItem(4005003,-10);
				cm.gainItem(4001126,-500);
				cm.gainMeso(-50000000);
				cm.setzb(-5000);
				if(cm.getChar().getVip()>0){
					if(chance>=2 && chance<=3){
						var item = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(1);
						item.setOwner("[帝]☆飞升☆");
						if(item.getStr()!=0){
						   item.setStr(item.getStr()+(Math.random() * 15+15));
						}
						if(item.getDex()!=0){
						   item.setDex(item.getDex()+(Math.random() * 15+15));
						}
						if(item.getInt()!=0){
						   item.setInt(item.getInt()+(Math.random() * 15+15));
						}
						if(item.getLuk()!=0){
						   item.setLuk(item.getLuk()+(Math.random() * 15+15));
						}
						if(item.getMatk()!=0){
						   item.setMatk(item.getMatk()+(Math.random() * 15+15));
						}
						if(item.getWatk()!=0){
						   item.setWatk(item.getWatk()+(Math.random() * 15+15));
						}
						if(item.getAcc()!=0){
						   item.setAcc(item.getAcc()+(Math.random() * 5+7));
						}
						if(item.getWdef()!=0){
						   item.setWdef(item.getWdef()+(Math.random() * 3+9));
						}
						if(item.getMdef()!=0){
						   item.setMdef(item.getMdef()+(Math.random() * 3+9));
						}
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 5, 1, true);
						MapleInventoryManipulator.addFromDrop(cm.getChar().getClient(), item);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 1, 1, true);
						cm.getC().getSession().write(MaplePacketCreator.getCharInfo(cm.getChar()));
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 2, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 3, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 4, 1, true);
						cm.sendNext("#b恭喜您，成功啦，快去看看包包吧，相信你一定会喜欢的！");
						cm.dispose();
						return;
					}else{
						cm.sendNext("#r真失败，合成没有成功，在接在历，相信你一定能成功的！");
						cm.dispose();
						return;
					}

				}else{//非会员
					if(chance>=1){
						var item = cm.getChar().getInventory(MapleInventoryType.EQUIP).getItem(1);
						item.setOwner("[仙]☆飞升☆");
						if(item.getStr()!=0){
						   item.setStr(item.getStr()+(Math.random() * 15+15));
						}
						if(item.getDex()!=0){
						   item.setDex(item.getDex()+(Math.random() * 15+15));
						}
						if(item.getInt()!=0){
						   item.setInt(item.getInt()+(Math.random() * 15+15));
						}
						if(item.getLuk()!=0){
						   item.setLuk(item.getLuk()+(Math.random() * 15+15));
						}
						if(item.getMatk()!=0){
						   item.setMatk(item.getMatk()+(Math.random() * 15+15));
						}
						if(item.getWatk()!=0){
						   item.setWatk(item.getWatk()+(Math.random() * 15+15));
						}
						if(item.getAcc()!=0){
						   item.setAcc(item.getAcc()+(Math.random() * 5+7));
						}
						if(item.getWdef()!=0){
						   item.setWdef(item.getWdef()+(Math.random() * 3+9));
						}
						if(item.getMdef()!=0){
						   item.setMdef(item.getMdef()+(Math.random() * 3+9));
						}
						
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 5, 1, true);
						MapleInventoryManipulator.addFromDrop(cm.getChar().getClient(), item);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 1, 1, true);
						cm.getC().getSession().write(MaplePacketCreator.getCharInfo(cm.getChar()));
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 2, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 3, 1, true);
						MapleInventoryManipulator.removeFromSlot(cm.getC(), MapleInventoryType.EQUIP, 4, 1, true);
						cm.sendNext("#b恭喜您，成功啦,你需要换一线，否则可能包包快去看看包包吧，相信你一定会喜欢的！");
						cm.dispose();
						return;
					}else{
						cm.sendNext(chance+"#r真失败，合成没有成功，在接在历，相信你一定能成功的！");
						cm.dispose();
						return;
					}
				}
}