var a = 0;
var text;
var selects; //记录玩家的选项
var buynum = 0;
var itemlist = Array(
Array(2049005, 6000),//白衣卷轴-神
Array(2049400, 6000),
//Array(2049601, 6000),//还原20%
//Array(2049605, 15000),//还原40%
//Array(2049165, 10000),//惊人正义混沌卷轴50%	
Array(2049135, 6000),//惊人正义混沌卷轴 20%	
Array(2049137, 15000),//惊人正义混沌卷轴 40%
//Array(2049750, 20000),//S级潜能卷轴 80%	
//Array(2614000, 2000),//突破1万100%
Array(2049300, 6000),//有损
Array(2049323, 15000),//无损
//Array(2049704, 10),//A潜
Array(2048309, 30000),//附加潜能附加卷轴
Array(2049405, 30000),//真·觉醒冒险之心专用潜能力卷轴
Array(2614004, 15000),//突破10万100%
Array(2614005, 150000),//突破100万100%
//Array(2049124, 15),//正向
//Array(2049116, 15),//强混
Array(2046010,30000), // 周年庆单手武器攻击力卷轴100%	
Array(2046011,30000), // 周年庆单手武器魔法力卷轴100%	
Array(2046110,30000), // 周年庆双手武器攻击力卷轴100%	
Array(2046913,45000), // 宿命正义单手武器攻击力卷轴 100% // 为单手武器增加攻击力属性。
Array(2046914,45000), // 宿命正义单手武器魔力卷轴 100% // 为单手武器增加魔法攻击力属性。
Array(2046173,45000), // 宿命正义双手武器攻击力卷轴 100% // 为双手武器增加攻击力属性。
Array(2046074,60000), // 祥龙单手武器攻击力卷轴99%	
Array(2046075,60000), // 祥龙单手武器魔法力卷轴99%	
Array(2046149,60000), // 祥龙双手武器攻击力卷轴99%
Array(2613000,85000),//  - 星火单手武器攻击力卷轴 - 为单手武器附加提升攻击力的属性。
Array(2613001,85000),//  - 星火单手武器魔法力卷轴 - 为单手武器附加提升魔力的属性。
Array(2612010,85000),//  - 星火双手武器攻击力卷轴 - 为双手武器附加提升攻击力的属性。
Array(2613016,90000),// RED单手武器攻击力卷轴	
Array(2047840,90000),// RED双手武器攻击力卷轴	
Array(2613017,90000),// RED单手武器魔力卷轴	
Array(2047818,105000), // - 惊人的双手武器攻击力卷轴100% - 在双手武器上附加提升攻击力的属性。
Array(2046996,105000), // - 惊人的单手武器攻击力卷轴100% - 对单手武器增加攻击力提高属性。
Array(2046997,105000), // - 惊人的单手武器魔力卷轴100% - 对单手武器增加魔力提高属性。
Array(2048094,100000), // 专属宠物装备攻击力卷轴	
Array(2048095,100000), // 专属宠物装备魔力卷轴	
Array(2046856,100000), // 专属饰品装备攻击力卷轴	
Array(2046857,100000), // 专属饰品装备魔力卷轴	
Array(2046577,30000), // 宿命正义防具力量卷轴 100% // 为防具增加力量属性。
Array(2046578,30000), // 宿命正义防具智力卷轴 100% // 为防具增加智力属性。
Array(2046579,30000), // 宿命正义防具敏捷卷轴 100% // 为防具增加敏捷属性。
Array(2046580,30000), // 宿命正义防具运气卷轴 100% // 为防具增加运气属性。
Array(2046763,45000), // 宿命正义饰品力量卷轴 100% // 为饰品增加力量属性。
Array(2046764,45000), // 宿命正义饰品智力卷轴 100% // 为饰品增加智力属性。
Array(2046765,45000), // 宿命正义饰品敏捷卷轴 100% // 为饰品增加敏捷属性。
Array(2046766,45000)// 宿命正义饰品运气卷轴 100% // 为饰品增加运气属性。
					);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			text = "亲爱的 #r#h ##k 您好，请点击图片购买物品：\r\n#b";
			for (var i=0; i<itemlist.length; i++) {
				text += "#L" + i + "##i" + itemlist[i] + ":# ";
				if (i != 0 && (i+1) % 5 == 0) {
					text += "\r\n";
				}
			}
            cm.sendSimple(text);
        } else if (a == 1) {
			selects = selection;
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r1个需要" + itemlist[selects][1] + "点卷", 1, 0, 999999);
        } else if (a == 2) {
            buynum = selection;
            cm.sendNext("你想购买" + buynum + "个#r#i" + itemlist[selects][0] + "##k？\r\n你将使用掉" + (buynum * itemlist[selects][1]) + "点卷。");
        } else if (a == 3) {
            if (cm.getChar().getCSPoints(1) >= buynum * itemlist[selects][1]) {
                cm.getChar().modifyCSPoints(1, -buynum * itemlist[selects][1]);
                cm.gainItem(itemlist[selects][0], buynum);
  				cm.worldSpouseMessage(0x20,"[点卷商城] ：" + "玩家 " + cm.getChar().getName() + " 用点卷购买了极品卷轴,离超神更近了一步！");             
				cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的点卷。");
                cm.dispose();
            }
        }
    }//mode
}//f