function action(mode, type, selection) {
        cm.sendNext("#e钓鱼大赛活动：#n每月进行钓鱼大赛活动，钓鱼前20名将会获得以下大礼哦！\r\n#r[注意：每月底进行清零积分统计,每月1号统计发奖]\r\n#r#e第1名奖励：#n#b奖励50W久久币、4888修为点、30个超级礼物箱子、3个超级椅子袋、突破顶级3W2装备箱2个\r\n\r\n#e#r第2名-4名奖励：#n#b奖励30W久久币、3888修为点、20个超级礼物箱子、2个超级椅子袋、突破极品武器箱5个\r\n\r\n#r#e第5名-10名奖励：#b#n奖励5W久久币、1888修为点、15个超级礼物箱子、1个超级椅子袋、突破极品武器箱3个\r\n\r\n#r#e第11名-20名奖励：#n#b奖励2W久久币、888修为点、8个超级礼物箱子、突破极品武器箱1个\r\n\r\n#v2431296##b突破极品武器箱#k：可100%开出1000-10000属性魔攻150法佛系列极品武器装备。\r\n\r\n#b#v2431988#突破顶级极限装备箱:可开出法佛系列装备、暴君、漩涡装备10000-32767极品属性。");
            cm.dispose();
}
