var status;
var rare = Array(
Array(3010966, 1), //幽灵船
Array(2432153, 1), //冲击式伤害皮肤 
Array(2432603, 1), //冲击式伤害皮肤
Array(2432638, 1), //冲击式伤害皮肤
Array(2432659, 1), //冲击式伤害皮肤
Array(2432154, 1), //甜美传统韩果伤害皮肤
Array(2432637, 1), //甜美传统韩果伤害皮肤
Array(2432658, 1), //甜美传统韩果伤害皮肤
Array(2433106, 1), //甜美传统韩果伤害皮肤
Array(2432207, 1), //射手村俱乐部伤害皮肤
Array(2432354, 1), //圣诞快乐伤害皮肤
Array(2432355, 1), //雪花伤害皮肤
Array(2432972, 1), //雪花伤害皮肤
Array(2432465, 1), //阿丽莎的伤害皮肤
Array(2433199, 1), //阿丽莎的伤害皮肤
Array(2432479, 1), //桃乐丝的伤害皮肤
Array(2432526, 1), //键盘战士伤害皮肤
Array(2432639, 1), //键盘战士伤害皮肤
Array(2432660, 1), //键盘战士伤害皮肤
Array(2433105, 1), //键盘战士伤害皮肤
Array(2432532, 1), //轻柔春风伤害皮肤
Array(2433107, 1), //轻柔春风伤害皮肤
Array(2432592, 1), //单身部队伤害皮肤
Array(2433132, 1), //单身部队伤害皮肤
Array(2432640, 1), //回忆伤害皮肤
Array(2432661, 1), //回忆伤害皮肤
Array(2432710, 1), //花蘑菇伤害皮肤
Array(2432836, 1), //王冠伤害皮肤
Array(2432973, 1), //灰白伤害皮肤
Array(2433063, 1), //Star Planet伤害皮肤
Array(2432591, 1), //樱吹雪伤害皮肤
Array(2432695, 1), //金灿灿伤害皮肤
Array(2432748, 1), //血色伤害皮肤
Array(2432749, 1), //僵尸伤害皮肤
Array(2432804, 1), //紫色妖姬伤害皮肤
Array(2433112, 1), //卧虎藏龙伤害皮肤
Array(2433113, 1), //冰淇淋伤害皮肤
Array(2433038, 1), //粉笔效果伤害皮肤
Array(2433197, 1), //蘑菇公主伤害皮肤
Array(2433182, 1), //万圣节南瓜伤害皮肤
Array(2433183, 1), //万圣节幽灵伤害皮肤
Array(2433588, 1)  //烟花伤害皮肤
);

var psrw = Array(//普通的随机道具
Array(1004140, 1), //军团长斯乌面具
Array(1004141, 1), //军团长德米面具
Array(1004142, 1), //军团长鲁希德面具
Array(1004143, 1), //军团长麦格纳斯面具
Array(1004144, 1), //军团长班.雷面具
Array(1004145, 1), //军团长阿卡伊勒面具
Array(1004146, 1), //军团长奥尔卡面具
Array(1004147, 1), //军团长威尔面具
Array(1004148, 1), //军团长希拉面具
Array(1050305, 1), //血红雷欧套服
Array(1050012, 1), //灰骨套服
Array(1052709, 1), //肃清者套服
Array(1052602, 1), //管家套服
Array(1052408, 1), //热血高校套服
Array(1072925, 1), //未来医生鞋子
Array(1072417, 1), //小丑鞋子
Array(1112683, 1), //艾菲尼亚戒指
Array(1112920, 1), //僵尸戒指
Array(1112920, 1), //僵尸戒指
Array(1112920, 1), //僵尸戒指
Array(1113089, 1), //伊柏哑戒指
Array(1102673, 1), //僵尸新娘披风
Array(1102704, 1), //精灵翅膀
Array(1102702, 1), //蝴蝶羽翼
Array(1142376, 1), //神出鬼没称号
Array(1142376, 1), //神出鬼没称号
Array(1142713, 1), //永恒守夜
Array(1142713, 1), //永恒守夜
Array(1012486, 1), //愤怒僵尸
Array(1012487, 1), //垃圾僵尸
Array(1012488, 1), //僵尸拳击手
Array(2432153, 1), //冲击式伤害皮肤
Array(2431966, 1), //数码式伤害皮肤
Array(2431967, 1), //克里蒂亚斯伤害皮肤
Array(2432131, 1), //组队任务伤害皮肤
Array(2431124, 1), //多情万圣糖
Array(2431124, 1), //多情万圣糖
Array(2431124, 1), //多情万圣糖
Array(2431124, 1), //多情万圣糖
Array(2431124, 1) //多情万圣糖
);
var rand = Math.floor(Math.random() * psrw.length);
var rand2 = Math.floor(Math.random() * rare.length);
var gailv = Math.floor(Math.random() * 100);
var eff ="#fEffect/CharacterEff/1003393/0/0#";
var zzz ="#fEffect/CharacterEff/1082565/2/0#";

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
        cm.sendYesNo("                   "+ eff +"#e#d抽奖大厅#n#k"+ eff +"\r\n======================================================\r\n"+
	""+ zzz +"累计消费额： #r"+cm.getBossLog("校园币消费累计",1)+" #k 点"+ zzz +"      "+ zzz +"累计抽奖次数： #r"+cm.getBossLog("校园币抽奖次数",1)+" #k 次"+ zzz +"\r\n#b如果您在专柜消费达到 #e#r388#n#k #b校园币，即可获得一次抽奖机会，拿到别人梦寐以求的珍稀道具哦！你将有几率获得以下道具：#k\r\n======================================================\r\n#e#d - 现金道具#k#n\r\n\r\n#v1012486#、#v1012487#、#v1012488#\r\n\r\n#e#d - 稀有椅子#k#n\r\n\r\n#v3010966#\r\n\r\n#e#d - 豪华cosplay#k#n\r\n\r\n#v1004140##v1004141##v1004142##v1004143##v1004144##v1004145##v1004146##v1004147##v1004148#  #v1052408# #v1052709# #v1050012# #v1052602# #v1050305# #v1072925# #v1072417# #v1112683# #v1113089##v1112920##v1102673##v1102704##v1102702# \r\n\r\n#e#d - 绝版称号#k#n\r\n\r\n#v1142376# #v1142713#\r\n\r\n#e#d - 伤害皮肤#k#n\r\n\r\n#v2432153##v2431966# #v2431967# #v2432131# #v2432153# #v2432154# #v2432207# #v2432354# #v2432355# #v2432465# #v2432479# #v2432526# #v2432532# #v2432592# #v2432640# #v2432710# #v2432973# #v2433063# #v2432591# #v2432695# #v2432748# #v2432749# #v2432804# #v2433112# #v2433113# #v2433038# #v2433197# #v2433183# #v2433588#\r\n======================================================\r\n#e#r（注：累计抽奖十次后，下次抽奖必定抽中稀有道具）#k#n");
    } else if (status == 1) {
          if (cm.getBossLog("校园币消费累计",1) < 388) {
		cm.sendOk("你没有在专柜消费累计 388 校园币。");
		cm.dispose();
         } else if (cm.getSpace(1) < 1 && cm.getSpace(2) < 1 && cm.getSpace(3) < 1 && cm.getSpace(4) < 1 && cm.getSpace(5) < 1) {
		cm.sendOk("你保证你包裹的每一栏都有空位？");
		cm.dispose();
            } else {
	   var getpsrw = 0;
	   var getnum = 0;
	   if (cm.getBossLog("校园币消费累计",1) >= 388) {
		   if(gailv > 90 || cm.getBossLog("校园币抽奖次数",1) >= 10){
		   if(cm.getBossLog("校园币抽奖次数",1) >= 10) {
		   cm.resetBossLog("校园币抽奖次数",1);
		   }
		   cm.gainGachaponItem(rare[rand2][0], rare[rand2][1], "校园商城累计消费抽奖", 3);//珍稀道具随机
		   getpsrw = rare[rand2][0];
		   getnum = rare[rand2][1];
		   }else{
		   cm.gainGachaponItem(psrw[rand][0], psrw[rand][1], "校园商城累计消费抽奖", 3);//普通道具随机
		   getpsrw = psrw[rand][0];
		   getnum = psrw[rand][1];
		   } 
		    cm.setBossLog("校园币消费累计",1,-388);
			cm.setBossLog("校园币抽奖次数",1,1);
		}
	   cm.sendOk("获取了 #v"+getpsrw+"# "+getnum+" 个");
	   cm.dispose(); 
	}
}
}
