/* 点卷商店 */

var status = -1;
var itemList = Array(
Array(1112915, 60000), //蓝调戒指
Array(1112793, 90000), //快乐戒指
Array(1012319, 90000), //8周年点点红
Array(1113064, 90000), //狂战士的匠人不朽戒指	
Array(1113063, 90000), //守卫之巨匠不朽戒	
Array(1113065, 90000), //霸王的匠人永恒戒指	
Array(1113066, 90000), //神使匠人的永恒戒指	
Array(1113069, 90000), //探险之黑暗暴击戒指	

Array(1022148, 90000), //神秘眼部装饰	
Array(1122208, 90000), //神秘吊坠	
Array(1132182, 90000), //神秘腰带	
Array(1032156, 90000), //神秘耳环	
Array(1012331, 90000), //神秘面饰	

Array(1113042, 150000), //超越保护戒指
Array(1022237, 150000), //传说赏金猎人眼镜
Array(1113168, 150000), //传说赏金猎人戒指
Array(1032246, 150000), //传说赏金猎人耳环
Array(1122289, 150000), //传说赏金猎人项链

Array(1152077, 200000), //希望之树之传说护肩
Array(1132135, 200000), //希望之树之传说腰带
Array(1122185, 200000), //希望之树之传说项链
Array(1112688, 200000), //希望之树之传说戒指
Array(1032129, 200000), //希望之树之传说耳环

//Array(1113056, 600000), //超越证明戒指
//Array(1032201, 600000), //超越证明耳环	
//Array(1012414, 600000), //超越证明脸饰	
//Array(1022195, 600000), //超越证明眼饰	
//Array(1122259, 600000), //超越证明吊坠

Array(1003893, 400000), // 外形碎片头盔 
Array(1132230, 400000), // 外形碎片腰带
Array(1113038, 400000), // 外形碎片戒指
Array(1122256, 400000), // 外形碎片项链
Array(1032191, 400000), // 外形碎片耳环

//Array(1122241, 450000), //超越的心之项链	
//Array(1122242, 450000), //超越的心之项链		
//Array(1122243, 450000), //超越的心之项链		
//Array(1122244, 450000), //超越的心之项链		
//Array(1122245, 450000), //超越的心之项链	

//Array(1122122, 9999999), // 真·觉醒冒险之心战士
//Array(1122123, 9999999), // 真·觉醒冒险之心法师
//Array(1122124, 9999999), // 真·觉醒冒险之心弓箭
//Array(1122125, 9999999), // 真·觉醒冒险之心飞侠
//Array(1122126, 9999999), // 真·觉醒冒险之心海盗
/*
Array(1082543, 5098), // 暴君西亚戴斯手套 // (无描述)
Array(1082544, 5098), // 暴君赫尔梅斯手套 // (无描述)
Array(1082545, 5098), // 暴君凯伦手套 // (无描述)
Array(1082546, 5098), // 暴君利卡昂手套 // (无描述)
Array(1082547, 5908), // 暴君阿尔泰手套 // (无描述)
Array(1102481, 2918), // 暴君西亚戴斯披风 // (无描述)
Array(1102482, 2918), // 暴君赫尔梅斯披风 // (无描述)
Array(1102483, 2918), // 暴君凯伦披风 // (无描述)
Array(1102484, 2918), // 暴君利卡昂披风 // (无描述)
Array(1102485, 2918), // 暴君阿尔泰披风 // (无描述)
Array(1072743, 2918), // 暴君西亚戴斯靴 // (无描述)
Array(1072744, 2198), // 暴君赫尔梅斯靴 // (无描述)
Array(1072745, 2198), // 暴君凯伦靴 // (无描述)
Array(1072746, 2198), // 暴君利卡昂靴 // (无描述)
Array(1072747, 2918), // 暴君阿尔泰靴 // (无描述)
Array(1132174, 2918), // 暴君西亚戴斯腰带 // (无描述)
Array(1132175, 2918), // 暴君赫尔梅斯腰带 // (无描述)
Array(1132176, 2918), // 暴君凯伦腰带 // (无描述)
Array(1132177, 2918), // 暴君利卡昂腰带 // (无描述)
Array(1132178, 2918), // 暴君阿尔泰腰带 // (无描述)*/
Array(1132243, 250000), // 低级贝勒德腰带
Array(1122264, 250000), // 低级贝勒德吊坠
Array(1032220, 250000), // 低级贝勒德耳环
Array(1113072, 250000), // 低级贝勒德戒指
Array(1132244, 300000), // 中级贝勒德腰带
Array(1122265, 300000), // 中级贝勒德吊坠
Array(1032221, 300000), // 中级贝勒德耳环
Array(1113073, 300000), // 中级贝勒德戒指
Array(1132245, 400000), // 高级贝勒德腰带
Array(1122266, 400000), // 高级贝勒德吊坠
Array(1032222, 400000), // 高级贝勒德耳环
Array(1113074, 400000), // 高级贝勒德戒指
Array(1132246, 450000),// 最高级贝勒德腰带
Array(1122267, 450000),// 最高级贝勒德吊坠
Array(1032223, 450000),// 最高级贝勒德耳环
Array(1113075, 450000)// 最高级贝勒德戒指
//Array(1142210, 33), // 王座收藏家勋章
//Array(1142178, 33),// 冒险岛形象大使
//Array(1142751, 200), //传说赏金猎人奖牌
//Array(1672027, 9999000),//极真锂心脏
//Array(1032219, 9999000),  // 遗忘之神话耳环	
//Array(1152124, 9999000),  // 冒险岛强韧意志黑色肩膀装饰	
//Array(1132215, 9999000)  // 冒险岛强韧意志黑色腰带	
//
);
var selectedItem = -1;
var selectedCost = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0# 请选择您想要购买的物品：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k   #r" + itemList[i][1]  + "#k点卷#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1];
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 点卷？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getPlayer().getCSPoints(1) >= selectedCost) {
            var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "点卷商店", 3, true);
            if (gachaponItem != -1) {
                cm.gainNX( - selectedCost );
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多点卷。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 点卷。");
        }
        cm.dispose();
    }
}