
var status = -1;
var text;
var sel;
var rmb;
var aaa ="#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";

// 每个礼包所需的充值金额
var condition = new Array(10, 50, 100, 200, 300, 500, 800, 1000, 1500,2000, 3000, 5000, 7000, 10000);
var reward = new Array(// 礼包编号、道具id、数量
					// 礼包1-10
					Array(1, 4000379, 300),	
					Array(1, 4310036, 100),//征服币
					//Array(1, 2340000, 1),
					//Array(1, 2049137, 1),
					Array(1, 1112743, 1),//专属紫金枫叶戒
					Array(1, 1152089, 1),//专属紫金枫叶肩
                    Array(1, 1132154, 1),//专属紫金枫叶腰
					Array(1, 3010118, 1),//水果音符椅子	
					Array(1, 4001714, 1),//100w金币
					//Array(1, 2082000, 10),//高质地喇叭
					
					// 礼包2-50
					//Array(2, 5062002, 30),
                    Array(2, 2431047, 1),//风暴装备箱
					Array(2, 4310036, 500),//征服币
                    Array(2, 5062000, 5),//神奇魔方
					Array(2, 5064000, 1),//防爆卷轴
					//Array(2, 2430865, 1, 3), //VIP
					Array(2, 2340000, 1),//祝福卷轴
					Array(2, 2049116, 1),//强化混沌卷轴
					//Array(2, 5121009, 10),//火红玫瑰
					Array(2, 5072000, 50),//高质地喇叭
                    Array(2, 5076000, 50),//道具喇叭
					Array(2, 3010283, 1),//飞毯椅子
					Array(2, 4001785, 1),//500w金币

					// 礼包3-100
					Array(3, 2430917, 1),//风暴首饰箱子
					Array(3, 4310036, 1000),//征服币
					Array(3, 5062000, 10),//神奇魔方
					Array(3, 5062002, 5),//高级神奇魔方
					Array(3, 5064000, 2),//防暴
					Array(3, 2340000, 2),//祝福
                    Array(3, 2049417, 1),//B潜卷
					Array(3, 2049116, 2),//强化混沌卷轴
					Array(3, 5121032, 10),//火红玫瑰
					Array(3, 5073000, 50),//心脏高级喇叭
                    Array(3, 5074000, 50),//白骨高级喇叭
					Array(3, 3010825, 1),//金星椅子
					Array(3, 4001785, 2),//1000w金币				

					// 礼包4-200
					Array(4, 4310049, 400),//外星币
					Array(4, 4310036, 2000),//征服币
					Array(4, 5062000, 20),//神奇魔方
                    Array(4, 5062002, 10),//高级神奇魔方
					//Array(4, 2430865, 1, 30), //VIP
					Array(4, 5064000, 4),//防爆卷轴
					Array(4, 2340000, 4),//祝福卷轴
					Array(4, 2049417, 2),//B潜卷
					Array(4, 2049116, 4),//强化混沌
					Array(4, 5121032, 20),//火红玫瑰
					Array(4, 5390003, 50),//新年庆祝喇叭1
					Array(4, 5390004, 50),//新年庆祝喇叭2
					Array(4, 3010827, 1),//火星椅子
					Array(4, 4001785, 4),//2000w金币

					// 礼包5-300
					Array(5, 4310088, 600),//RED币
					Array(5, 4310036, 3000),//征服币
				    Array(5, 1142216, 1),//vip勋章
                    Array(5, 5062000, 30),//神奇魔方
					//Array(5, 2430865, 1, 7), //VIP
					Array(5, 5062002, 15),//高级神奇魔方
					Array(5, 5064000, 6),//防爆卷轴
					Array(5, 2340000, 6),//祝福卷轴
					Array(5, 2049417, 3),//B潜卷
					Array(5, 2049137, 3),//惊人正义40%
					Array(5, 5121032, 30),//火红玫瑰
					Array(5, 5073000, 50),//心脏高级喇叭
                    Array(5, 5074000, 50),//白骨高级喇叭
					Array(5, 3010944, 1),//冥王星椅子
					Array(5, 4001785, 4),//2000w金币

					// 礼包6-500	
					Array(6, 2431945, 1),//140级防具箱子
                    Array(6, 1190300, 1),//白银枫叶徽章
					Array(6, 1112140, 1),//白银vip戒指
                    Array(6, 1112247, 1),//白银vip戒指
					Array(6, 5062000, 50),//神奇魔方
					Array(6, 5062002, 20),//高级神奇魔方
					Array(6, 5062500, 20),//大师级神奇魔方
					Array(6, 5064000, 10),//防爆卷轴
					Array(6, 2340000, 10),//祝福卷轴
					Array(6, 2049700, 1),//A潜
					Array(6, 2049137, 5),//惊人正义40%
				    Array(6, 5121032, 50),//火红玫瑰
					Array(6, 5390003, 50),//新年庆祝喇叭1
					Array(6, 5390004, 50),//新年庆祝喇叭2
					Array(6, 3010824, 1),//水星椅子
					Array(6, 4001785, 8),//金币4000w

					// 礼包7-800
					Array(7, 2431944, 1),//140级武器箱子
                    Array(7, 1202083, 1),//图腾
					Array(7, 1112787, 1),//白银vip戒指
					Array(7, 3010509, 1),//白银vip椅子
					Array(7, 5062000, 80),//神奇魔方
					Array(7, 5062002, 25),//高级神奇魔方
					Array(7, 5062500, 25),//大师级神奇魔方
					Array(7, 5064000, 15),//防爆卷轴
					Array(7, 2340000, 15),//祝福卷轴
					Array(7, 2049756, 1),//S潜					
					Array(7, 2049137, 8),//惊人正义40%
					Array(7, 5121032, 80),//火红玫瑰
					Array(7, 5390002, 50),//爱心情景
                    Array(7, 5390001, 50),//绚烂情景
                    Array(7, 3010826, 1),//地球椅子
					Array(7, 4001785, 8),//金币4000w
					
					// 礼包8-1000
					Array(8, 2431938, 1),//法弗纳武器箱子
					Array(8, 2432069, 1),//暴君
					Array(8, 1190301, 1),//金色枫叶徽章
					Array(8, 1112139, 1),//黄金VIP
                    Array(8, 1112246, 1),//黄金VIP
					Array(8, 4310036, 3000),//征服币
                    Array(8, 5062000, 100),//神奇魔方
					Array(8, 5062002, 35),//高级神奇魔方
					Array(8, 5062500, 35),//大师级神奇魔方
					Array(8, 5064000, 20),//防爆卷轴
					Array(8, 2340000, 20),//祝福卷轴
					Array(8, 2048307, 1),//特殊附加潜能附加卷轴
					Array(8, 2049137, 10),//惊人正义40
					Array(8, 5121032, 100),//火红玫瑰
					Array(8, 5390000, 50),//炽热喇叭
					Array(8, 5390018, 50),//跑马喇叭
					Array(8, 3010830, 1),//天王星椅子
					Array(8, 4001785, 10),//定居金5000万金币
					
					// 礼包9-1500
					Array(9, 2432069, 1),//暴君
					Array(9, 2430226, 1),//翅膀包
					Array(9, 1142328, 1),//vip勋章	
				    Array(9, 1112786, 1),//黄金戒指
					Array(9, 3010508, 1),//黄金椅子
					Array(9, 4310036, 3000),//征服币
					Array(9, 5062002, 50),//高级神奇魔方
					Array(9, 5062500, 50),//大师级神奇魔方
					Array(9, 5062009, 15),//超级神奇魔方
					Array(9, 2340000, 25),//祝福
					Array(9, 5064000, 25),//防暴
					Array(9, 2049756, 1),//S潜	
					Array(9, 2049137, 15),//惊人正义

					Array(9, 5390002, 50),//爱心情景
                    Array(9, 5390001, 50),//绚烂情景
					Array(9, 3010831, 1),//海王星椅子
					Array(9, 4001785, 15),//定居金7500万金币
					
					// 礼包10-2000
					Array(10, 3994417, 1),//红色蜡笔
					Array(10, 2432341, 1),//150防具箱子
					Array(10, 2432069, 1),//暴君
					Array(10, 1190302, 1),//水晶枫叶徽章
					Array(10, 1112138, 1),//钻石戒指
                    Array(10, 1112245, 1),//钻石戒指
					Array(10, 5062002, 70),//高级神奇
					Array(10, 5062500, 70),//大师级神奇
				    Array(10, 5062009, 20),//超级神奇魔方
					Array(10, 2048307, 1),//特殊附加潜能附加卷轴
					Array(10, 2340000, 30),//祝福
					Array(10, 5064000, 30),//防暴
					Array(10, 2049137, 20),//惊人正义

					Array(10, 5390000, 50),//炽热喇叭
					Array(10, 5390018, 50),//跑马喇叭
					Array(10, 3010876, 1),//冒险岛行星椅子
					Array(10, 4001715, 1),//1亿金币

					// 礼包11-3000
					Array(11, 3994418, 1),//橙色蜡笔
					Array(11, 2432341, 1),//150防具箱子
					Array(11, 2432069, 1),//暴君
					Array(11, 2431991, 1),//土豪心
					Array(11, 2049337, 1),//3星卷
			        Array(11, 1142145, 1),//vip勋章
					Array(11, 1112785, 1),//钻石戒指
					Array(11, 3010507, 1),//钻石椅子
					Array(11, 5062002, 100),//高级
					Array(11, 5062500, 100),//大师
					Array(11, 5062009, 30),//超级神奇魔方
					Array(11, 2049405, 1),//土豪心潜能卷
					Array(11, 5064000, 35),//防暴
					Array(11, 2340000, 35),//祝福
					Array(11, 2049137, 30),//惊人正义
					Array(11, 5390020, 50),//演唱喇叭
					Array(11, 5390019, 50),//新闻喇叭
					Array(11, 3010829, 1),//土星椅子
					Array(11, 4001715, 3),//3亿金币

					// 礼包12-5000
				    Array(12, 1102730, 1),//闪耀之翼
					Array(12, 3994419, 1),//黄色蜡笔
					Array(12, 2432341, 1),//150防具箱子
					Array(12, 2431991, 1),//土豪心
					Array(12, 2049405, 1),//觉醒潜能
				    Array(12, 2049339, 1),//5星卷
					Array(12, 4031454, 1),//圣杯
				    Array(12, 5062002, 170),//高级神奇魔方
					Array(12, 5062500, 170),//大师级神奇魔方
					Array(12, 5062009, 50),//超级神奇魔方
					Array(12, 5064000, 50),//防爆卷轴
					Array(12, 2340000, 50),//祝福卷轴
					Array(12, 2049137, 50),//惊人正义
					Array(12, 5390010, 50),//鬼出喇叭
					Array(12, 5390022, 50),//小羊喇叭
					Array(12, 3010828, 1),//木星椅子
					Array(12, 4001715, 5),//5亿金币

					// 礼包13-7000
					Array(13, 1114000, 1),//血盟戒指
					Array(13, 1162016, 1),//口袋物品
					Array(13, 2049341, 1),//7星卷
					Array(13, 3994420, 1),//绿色蜡笔
					Array(13, 3994421, 1),//青色蜡笔
					Array(13, 3994422, 1),//蓝色蜡笔
					Array(13, 5062002, 250),//高级神奇魔方
					Array(13, 5062500, 250),//大师级神奇魔方
					Array(13, 5062009, 70),//超级神奇魔方					
					Array(13, 5064000, 70),//防爆卷轴
					Array(13, 2340000, 70),//祝福卷轴
					Array(13, 2049137, 70),//惊人正义
					Array(13, 5390020, 70),//演唱喇叭
					Array(13, 5390019, 70),//新闻喇叭
                    Array(13, 3010832, 1),//太阳椅子
					Array(13, 4001715, 7),//7亿金币

					// 礼包14-10000
					Array(14, 1672041, 1),//冒险岛爱心心脏
					Array(14, 1666000, 1),//女仆机器人
					Array(14, 1142788, 1),//勋章
					Array(14, 1022226, 1),//眼饰
					Array(14, 2049344, 1),//10星卷
					Array(14, 3994417, 1),//红色蜡笔
					Array(14, 3994418, 1),//橙色蜡笔
					Array(14, 3994419, 1),//黄色蜡笔
					Array(14, 3994420, 1),//绿色蜡笔
					Array(14, 3994421, 1),//青色蜡笔
					Array(14, 3994422, 1),//蓝色蜡笔
					Array(14, 5062002, 350),//高级神奇
					Array(14, 5062500, 350),//大师神奇
					Array(14, 5062009, 100),//超级神奇魔方
		            Array(14, 5064000, 100),//防爆卷轴
					Array(14, 2340000, 100),//祝福卷轴
					Array(14, 2049137, 100),//惊人正义
					Array(14, 5390010, 50),//鬼出喇叭
					Array(14, 5390022, 50),//小羊喇叭
					Array(14, 3015002, 1),//摩天轮椅子
                    Array(14, 4001715, 10)//10亿金币
					);

function start() {
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status == 0 && mode == 0)
	{
		cm.dispose();
		return;
	}
	if (mode == 1)
	{
		status++;
	} else {
		status--;
	}

	rmb = cm.getRMB();
	var curlevel = -1;

	if (status == 0) {
		text = "您累计充值金额为： #r" + rmb + "#k 元\r\n\r\n";
		for (var i = 1; i <= condition.length; i++) {
			text += "#b#L" + i + "#"+aaa+" 累计充值 #r" + condition[i-1] + " #b元奖励";
			if (cm.getBossLogAcc("累计充值礼包" + i) == -1) {
				text += "(已领取)";
				curlevel = curlevel == -1 ? i : curlevel;
			}
			text += "#l\r\n";
		}
		text += "#k";
		cm.sendSimple(text);
	} else if (status == 1) {
		sel = selection;
		text = "\t\t\t\t#e#r- 累计充值" + condition[selection - 1] + "元奖励 -#k#n\r\n\r\n";
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == selection) {
				text += "\t\t\t#i" + reward[i][1] + "# #z" + reward[i][1] + "#[" + reward[i][2] + "个]\r\n";
			}
		}
		cm.sendYesNo(text);
	} else if (status == 2) {
		if (cm.getBossLogAcc("累计充值礼包" + sel) == -1) {
			cm.sendOk("这个礼包您已经领取过了");
			cm.dispose();
			return;
		}
		if (rmb < condition[sel-1]) {
			cm.sendOk("累计充值金额不足，无法领取。");
			cm.dispose();
			return;
		}
		var rewardlist = new Array();
		for (var i = 0; i < reward.length; i++) {
			if (reward[i][0] == sel) {
				if (reward[i][3]==null)
					reward[i][3]=-1;
				rewardlist.push(new Array(reward[i][1], reward[i][2], reward[i][3]));
			}
		}
		if (!cm.canHoldSlots(rewardlist.length)) {
			cm.sendOk("包裹空间不足，请确保包裹每个栏位有至少 " + rewardlist.length + " 格空间");
			cm.dispose();
			return;
		}
		for (var i = 0; i < rewardlist.length; i++) {
			if (rewardlist[i][0]==2430865) {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1], rewardlist[i][2]);
			} else {
				cm.gainItem(rewardlist[i][0], rewardlist[i][1]);
			}
		}
		cm.setBossLogAcc("累计充值礼包" + sel, -2);
		cm.playerMessage(1, "领取成功！");
		cm.worldSpouseMessage(0x15, "[累计充值奖励]" + " : " + "玩家 " + cm.getChar().getName() + " 领取了累计充值 " + condition[sel-1] + " 元奖励，离超神更近了一步！");
		cm.dispose();
	}
}