status = -1;
var itemList = Array(
//-------赫里希安精锐-------
    Array(11102472, 100, 1, 1), //	赫里希安精锐法师披风	
	Array(11102471, 100, 1, 1), //	赫里希安精锐战士披风	
	Array(11102474, 100, 1, 1), //	赫里希安精锐飞侠披风	
	Array(11102473, 100, 1, 1), //	赫里希安精锐弓箭手披风	
	Array(11102475, 100, 1, 1), //	赫里希安精锐海盗披风	
	Array(11132168, 100, 1, 1), //	赫里希安精锐海盗腰带	
	Array(11132166, 100, 1, 1), //	赫里希安精锐弓箭手腰带	
	Array(11132167, 100, 1, 1), //	赫里希安精锐飞侠腰带	
	Array(11132164, 100, 1, 1), //	赫里希安精锐战士腰带	
	Array(11132165, 100, 1, 1), //	赫里希安精锐法师腰带	
	Array(11072736, 100, 1, 1), //	赫里希安精锐海盗靴	
	Array(11072735, 100, 1, 1), //	赫里希安精锐飞侠靴	
	Array(11072734, 100, 1, 1), //	赫里希安精锐弓箭手靴	
	Array(11072733, 100, 1, 1), //	赫里希安精锐法师靴	
	Array(11072732, 100, 1, 1), //	赫里希安精锐战士靴	
//-------至尊不速之客-------
    Array(1112439, 100, 1, 1), //	至尊不速之客戒指	
	Array(1132040, 100, 1, 1), //	至尊不速之客腰带	
	Array(1032084, 100, 1, 1), //	至尊不速之客耳环	
	Array(1122085, 100, 1, 1), //	至尊不速之客项链	
	Array(1092074, 100, 1, 1), //	至尊不速之客战士盾	
	Array(1092079, 100, 1, 1), //	至尊不速之客法师盾	
	Array(1092084, 100, 1, 1), //	至尊不速之客飞侠盾	
	Array(1302147, 100, 1, 1), //	至尊不速之客单手剑	
	Array(1442111, 100, 1, 1), //	至尊不速之客矛	
	Array(1432081, 100, 1, 1), //	至尊不速之客枪	
	Array(1452106, 100, 1, 1), //	至尊不速之客弓	
	Array(1322090, 100, 1, 1), //	至尊不速之客单手钝器	
	Array(1462091, 100, 1, 1), //	至尊不速之客弩	
	Array(1492079, 100, 1, 1), //	至尊不速之客短枪	
	Array(1372078, 100, 1, 1), //	至尊不速之客短杖	
	Array(1422063, 100, 1, 1), //	至尊不速之客双手钝器	
	Array(1482079, 100, 1, 1), //	至尊不速之客指节	
	Array(1382099, 100, 1, 1), //	至尊不速之客长杖	
	Array(1312062, 100, 1, 1), //	至尊不速之客单手斧	
	Array(1472117, 100, 1, 1), //	至尊不速之客拳套	
	Array(1342033, 100, 1, 1), //	至尊不速之客刀	
	Array(1412062, 100, 1, 1), //	至尊不速之客双手斧	
	Array(1402090, 100, 1, 1), //	至尊不速之客双手剑	
	Array(1332120, 100, 1, 1), //	至尊不速之客短剑-运	
	Array(1332125, 100, 1, 1), //	至尊不速之客短剑-力	
//-------血色-------
    Array(1102280, 100, 1, 1), //	阿加雷斯血色披风		
	Array(1082300, 100, 1, 1), //	阿加雷斯血色手套	
	Array(1052319, 100, 1, 1), //	阿加雷斯血色锁子甲		
	Array(1302153, 100, 1, 1), //	阿加雷斯血色拳刃	
	Array(1442117, 100, 1, 1), //	阿加雷斯血色矛	
	Array(1432087, 100, 1, 1), //	阿加雷斯血色枪	
	Array(1322097, 100, 1, 1), //	阿加雷斯血色锤	
	Array(1232013, 100, 1, 1), //	阿加雷斯血色猩红黄道剑	
	Array(1422067, 100, 1, 1), //	阿加雷斯血色大槌		
	Array(1312066, 100, 1, 1), //	阿加雷斯血色斧		
	Array(1412066, 100, 1, 1), //	阿加雷斯血色大斧	
	Array(1402096, 100, 1, 1), //	阿加雷斯血色巨剑		
	Array(1003177, 100, 1, 1), //	阿加雷斯血色头箍	
	Array(1072490, 100, 1, 1), //	阿加雷斯血色鞋	
    Array(1102281, 100, 1, 1), //	艾里格斯血色披风		
	Array(1082301, 100, 1, 1), //	艾里格斯血色手套		
	Array(1052320, 100, 1, 1), //	艾里格斯血色锁子甲		
	Array(1212013, 100, 1, 1), //	艾里格斯血色双头杖	
	Array(1372085, 100, 1, 1), //	艾里格斯血色短杖		
	Array(1382105, 100, 1, 1), //	艾里格斯血色笞鞭	
	Array(1252013, 100, 1, 1), //	艾里格斯热血猫梳魔法棒	
	Array(1003178, 100, 1, 1), //	艾里格斯血色头箍	
	Array(1072491, 100, 1, 1), //	艾里格斯血色鞋
    Array(1102284, 100, 1, 1), //	维帕尔血色披风	
	Array(1082304, 100, 1, 1), //	维帕尔血色手套	
	Array(1052323, 100, 1, 1), //	维帕尔血色锁子甲	
	Array(1532017, 100, 1, 1), //	维帕尔血腥火神炮	
	Array(1242013, 100, 1, 1), //	维帕尔血色狮蝎剑	
	Array(1492086, 100, 1, 1), //	维帕尔血色之鹰	
	Array(1222013, 100, 1, 1), //	维帕尔血月	
	Array(1482085, 100, 1, 1), //	维帕尔血色拳甲	
	Array(1003181, 100, 1, 1), //	维帕尔血色头箍	
	Array(1072494, 100, 1, 1), //	维帕尔血色鞋
    Array(1102283, 100, 1, 1), //	赫尔巴斯血色披风		
	Array(1082303, 100, 1, 1), //	赫尔巴斯血色手套		
	Array(1052322, 100, 1, 1), //	赫尔巴斯血色锁子甲		
	Array(1472123, 100, 1, 1), //	赫尔巴斯血色手套		
	Array(1332131, 100, 1, 1), //	赫尔巴斯血色屠杀者		
	Array(1003180, 100, 1, 1), //	赫尔巴斯血色头箍	
	Array(1072493, 100, 1, 1), //	赫尔巴斯血色鞋
//------风暴------
    Array(1102467, 100, 1, 1), //	风暴披风	
	Array(1112748, 100, 1, 1), //	风暴戒指	
	Array(1022149, 100, 1, 1), //	风暴眼镜	
	Array(1152099, 100, 1, 1), //	风暴肩章	
	Array(1132161, 100, 1, 1), //	风暴腰带	
	Array(1122200, 100, 1, 1), //	风暴吊坠	
	Array(1032148, 100, 1, 1), //	风暴耳环
	Array(1003561, 100, 1, 1), //	风暴羽毛帽子	
	Array(1072672, 100, 1, 1), //	风暴鞋子	
	Array(1082438, 100, 1, 1), //	风暴手套	
	Array(1052467, 100, 1, 1), //	风暴连帽长袍	
	Array(1412123, 100, 1, 1), //	风暴蝶翼斧	
	Array(1532082, 100, 1, 1), //	风暴突击	
	Array(1452190, 100, 1, 1), //	风暴弓	
	Array(1362075, 100, 1, 1), //	风暴神秘天空之杖	
	Array(1432151, 100, 1, 1), //	风暴枪	
	Array(1302249, 100, 1, 1), //	风暴战剑	
	Array(1322182, 100, 1, 1), //	风暴金色锤	
	Array(1492163, 100, 1, 1), //	风暴短枪	
	Array(1522079, 100, 1, 1), //	风暴双弩枪	
	Array(1372162, 100, 1, 1), //	风暴双翼短杖	
	Array(1212040, 100, 1, 1), //	风暴双头杖	
	Array(1222040, 100, 1, 1), //	风暴灵魂手铳	
	Array(1462178, 100, 1, 1), //	风暴岩石	
	Array(1442203, 100, 1, 1), //	风暴半月矛	
	Array(1382193, 100, 1, 1), //	风暴治愈长杖	
	Array(1422125, 100, 1, 1), //	风暴枫叶锤	
	Array(1402174, 100, 1, 1), //	风暴巨剑	
	Array(1332207, 100, 1, 1), //	风暴龙牙破	
	Array(1482152, 100, 1, 1), //	风暴血色拳爪	
	Array(1472198, 100, 1, 1), //	风暴正义	
	Array(1312136, 100, 1, 1), //	风暴斧	
	Array(1252045, 100, 1, 1), //	风暴猫梳魔法棒	
//-------神龙------
    Array(1532040, 100, 1, 1), //	神龙血心火炮	
	Array(1442139, 100, 1, 1), //	神龙女巫之矛	
	Array(1452132, 100, 1, 1), //	神龙水精灵弓		
	Array(1242019, 100, 1, 1), //	神龙惩罚之针	
	Array(1362024, 100, 1, 1), //	神龙堕落天使手杖	
	Array(1362015, 100, 1, 1), //	神龙手杖		
	Array(1432102, 100, 1, 1), //   神龙贝伦之矛	
	Array(1322137, 100, 1, 1), //	神龙水晶锤	
	Array(1212019, 100, 1, 1), //	神龙新月双头杖	
	Array(1522023, 100, 1, 1), //	神龙翻天弩	
	Array(1462121, 100, 1, 1), //	神龙地狱之弓	
	Array(1222019, 100, 1, 1), //	神龙翡翠手铳	
	Array(1492104, 100, 1, 1), //	神龙暴风短枪	
	Array(1232019, 100, 1, 1), //	神龙沉默流浪汉	
	Array(1382127, 100, 1, 1), //	神龙毁灭之杖	
	Array(1402114, 100, 1, 1), //	神龙阿斯卡隆圣剑	
	Array(1482105, 100, 1, 1), //	神龙钻心拳套	
	Array(1312097, 100, 1, 1), //	神龙水晶斧	
	Array(1342042, 100, 1, 1), //	神龙熔岩刀	
	Array(1472144, 100, 1, 1), //	神龙神秘护腕	
	Array(1252021, 100, 1, 1), //	神龙撒加魔法棒	
	Array(1252010, 100, 1, 1), //	神龙猫梳魔法棒	
	Array(1332153, 100, 1, 1), //	神龙纳格林之刃
//-------重生------
	//Array(1082239, 100, 1, 1), //	重生定边手套	
	//Array(1082243, 100, 1, 1), //	重生抚浪手套	
	//Array(1082240, 100, 1, 1), //	重生逍遥手套	
	//Array(1082242, 100, 1, 1), //	重生探云手套	
	//Array(1082241, 100, 1, 1), //	重生白云手套	
	//Array(1052160, 100, 1, 1), //	重生演武铠	
	//Array(1052162, 100, 1, 1), //	重生巡礼者	
	//Array(1052161, 100, 1, 1), //	重生奥神袍	
	//Array(1052164, 100, 1, 1), //	重生霸七海	
	//Array(1052163, 100, 1, 1), //	重生翻云服
    //Array(1002792, 100, 1, 1), //	重生霓翎帽	
	//Array(1002791, 100, 1, 1), //	重生玄妙帽	
	//Array(1002790, 100, 1, 1), //	重生冠军盔	
	//Array(1002793, 100, 1, 1), //	重生迷踪帽	
	//Array(1002794, 100, 1, 1), //	重生海王星	
	//Array(1072364, 100, 1, 1), //	重生舞空靴	
	//Array(1072363, 100, 1, 1), //	重生彩虹鞋	
	//Array(1072362, 100, 1, 1), //	重生缥缈鞋	
	//Array(1072361, 100, 1, 1), //	重生坚壁靴	
	//Array(1072365, 100, 1, 1), //	重生定海靴
    //Array(1952002, 100, 1, 1), //	重生吊坠	
	//Array(1942002, 100, 1, 1), //	重生面罩	
	//Array(1972002, 100, 1, 1), //	重生尾巴	
	//Array(1962002, 100, 1, 1), //	重生飞翼
    //Array(1452059, 100, 1, 1), //	重生惊电弓	
	//Array(1432049, 100, 1, 1), //	重生显圣枪	
	//Array(1532016, 100, 1, 1), //	重生拯救者	
	//Array(1242012, 100, 1, 1), //	重生矛头剑	
	//Array(1442067, 100, 1, 1), //	重生神光戟	
	//Array(1362017, 100, 1, 1), //	重生手杖	
	//Array(1522016, 100, 1, 1), //	重生鲜花弩枪	
	//Array(1462051, 100, 1, 1), //	重生冥雷弩	
	//Array(1212012, 100, 1, 1), //	重生末路双头杖	
	//Array(1322061, 100, 1, 1), //	重生惊破天	
	//Array(1492025, 100, 1, 1), //	重生凤凰铳	
	//Array(1222012, 100, 1, 1), //	重生紫龙	
	//Array(1372045, 100, 1, 1), //	重生蝶翼杖	
	//Array(1482024, 100, 1, 1), //	重生孔雀翎	
	//Array(1232012, 100, 1, 1), //	重生冷酷搜索者	
	//Array(1422038, 100, 1, 1), //	重生威震天	
	//Array(1382059, 100, 1, 1), //	重生冰轮杖	
	//Array(1342012, 100, 1, 1), //	重生之刃	
	//Array(1332076, 100, 1, 1), //	重生断首刃	
	//Array(1332075, 100, 1, 1), //	重生狂鲨锯	
	//Array(1252012, 100, 1, 1), //	重生咪咪凌世魔法棒	
	//Array(1302086, 100, 1, 1), //	重生破甲剑	
	//Array(1412034, 100, 1, 1), //	重生碎鼋斧	
	//Array(1472071, 100, 1, 1), //	重生大悲赋	
	//Array(1312038, 100, 1, 1), //	重生断蚺斧	
	//Array(1402047, 100, 1, 1), //	重生玄冥剑
//-------永恒------
	//Array(1102172, 100, 1, 1), //	永恒不灭披风
    //Array(1082238, 100, 1, 1), //	永恒抚浪手套	
	//Array(1082237, 100, 1, 1), //   永恒探云手套	
	//Array(1082236, 100, 1, 1), //	永恒白云手套	
	//Array(1082235, 100, 1, 1), //	永恒逍遥手套	
	//Array(1082234, 100, 1, 1), //	永恒定边手套
    //Array(1052159, 100, 1, 1), //	永恒霸七海	
	//Array(1052158, 100, 1, 1), //	永恒翻云服	
	//Array(1052157, 100, 1, 1), //	永恒巡礼者	
	//Array(1052156, 100, 1, 1), //	永恒奥神袍	
	//Array(1052155, 100, 1, 1), //	永恒演武铠
    //Array(1002778, 100, 1, 1), //	永恒霓翎帽	
	//Array(1002777, 100, 1, 1), //	永恒玄妙帽	
	//Array(1002776, 100, 1, 1), //	永恒冠军盔	
	//Array(1002779, 100, 1, 1), //	永恒迷踪帽	
	//Array(1002780, 100, 1, 1), //	永恒海王星	
	//Array(1072359, 100, 1, 1), //	永恒定海靴	
	//Array(1072358, 100, 1, 1), //	永恒舞空靴	
	//Array(1072355, 100, 1, 1), //	永恒坚壁靴	
	//Array(1072357, 100, 1, 1), //	永恒彩虹鞋	
	//Array(1072356, 100, 1, 1), //	永恒缥缈鞋
	//Array(1342011, 100, 1, 1), //	永恒之刃	
	//Array(1332073, 100, 1, 1), //	永恒狂鲨锯	
	//Array(1332074, 100, 1, 1), //	永恒断首刃	
	//Array(1252011, 100, 1, 1), //	永恒咪咪凌世魔法棒	
	//Array(1302081, 100, 1, 1), //	永恒破甲剑	
	//Array(1412033, 100, 1, 1), //	永恒碎鼋斧	
	//Array(1472068, 100, 1, 1), //	永恒大悲赋	
	//Array(1312037, 100, 1, 1), //	永恒断蚺斧	
	//Array(1402046, 100, 1, 1), //	永恒玄冥剑
    //Array(1422037, 100, 1, 1), //	永恒威震天
	//Array(1092058, 100, 1, 1), //	永恒寒冰盾	
	//Array(1092057, 100, 1, 1), //	永恒魔光盾	
	//Array(1092059, 100, 1, 1), //	永恒匿踪盾	
	//Array(1452057, 100, 1, 1), //	永恒惊电弓	
	//Array(1432047, 100, 1, 1), //	永恒显圣枪	
	//Array(1532015, 100, 1, 1), //	永恒拯救者	
	//Array(1242011, 100, 1, 1), //	永恒矛头剑	
	//Array(1442063, 100, 1, 1), //	永恒神光戟	
	//Array(1362016, 100, 1, 1), //	永恒手杖	
	//Array(1522015, 100, 1, 1), //	永恒鲜花弩枪	
	//Array(1462050, 100, 1, 1), //	永恒冥雷弩	
	//Array(1212011, 100, 1, 1), //	永恒末路双头杖	
	//Array(1322060, 100, 1, 1), //	永恒惊破天	
	//Array(1492023, 100, 1, 1), //	永恒凤凰铳	
	//Array(1222011, 100, 1, 1), //	永恒紫龙	
	//Array(1372044, 100, 1, 1), //	永恒蝶翼杖	
	//Array(1482023, 100, 1, 1), //	永恒孔雀翎	
	//Array(1232011, 100, 1, 1), //	永恒冷酷搜索者
//-------外星人------
	Array(1112738, 100, 1, 1), //	外星人之戒指		
	Array(1132152, 100, 1, 1), //	外星人之腰带	
	Array(1122197, 100, 1, 1), //	外星人之吊坠	
	Array(1032142, 100, 1, 1), //	外星人之耳环	
	Array(1082432, 100, 1, 1), //	外星人之手套	
	Array(1052460, 100, 1, 1), //	外星人之套装
	Array(1003540, 100, 1, 1), //	外星人之头盔	
	Array(1072664, 100, 1, 1), //	外星人之靴	
	Array(1092110, 100, 1, 1), //	外星人之盾(法师)	
	Array(1092111, 100, 1, 1), //	外星人之盾(飞侠)	
	Array(1092109, 100, 1, 1), //	外星人之盾(战士)	
	Array(1302224, 100, 1, 1), //	外星人之单手剑	
	Array(1532113, 100, 1, 1), //	外星人之手炮	
	Array(1442181, 100, 1, 1), //	外星人之矛	
	Array(1362104, 100, 1, 1), //	外星人之手杖	
	Array(1452168, 100, 1, 1), //	外星人之弓	
	Array(1242086, 100, 1, 1), //	外星人之能量剑	
	Array(1242085, 100, 1, 1), //	外星人之能量剑	
	Array(1432137, 100, 1, 1), //	外星人之枪	
	Array(1492149, 100, 1, 1), //	外星人之短枪	
	Array(1322161, 100, 1, 1), //	外星人之单手钝器	
	Array(1372137, 100, 1, 1), //	外星人之短杖	
	Array(1212084, 100, 1, 1), //	外星人之双头杖	
	Array(1222079, 100, 1, 1), //	外星人之灵魂手铳	
	Array(1462157, 100, 1, 1), //	外星人之弩	
	Array(1522108, 100, 1, 1), //	外星人之双弩枪	
	Array(1232079, 100, 1, 1), //	外星人之亡命剑	
	Array(1382167, 100, 1, 1), //	外星人之长杖	
	Array(1422106, 100, 1, 1), //	外星人之双手钝器	
	Array(1402150, 100, 1, 1), //	外星人之双手剑	
	Array(1482139, 100, 1, 1), //	外星人之指节	
	Array(1472178, 100, 1, 1), //	外星人之拳套	
	Array(1342070, 100, 1, 1), //	外星人之刀	
	Array(1252063, 100, 1, 1), //	外星人之魔法棒	
	Array(1312115, 100, 1, 1), //	外星人之单手斧	
	Array(1332192, 100, 1, 1), //	外星人之短刀	
	Array(1412103, 100, 1, 1), //	外星人之双手斧	
//-------无爱------
	Array(1412122, 100, 1, 1), //	无爱碎鼋斧	
	Array(1532081, 100, 1, 1), //	无爱救世炮	
	Array(1452189, 100, 1, 1), //	无爱惊电弓	
	Array(1242044, 100, 1, 1), //	无爱矛头剑	
	Array(1362079, 100, 1, 1), //	无爱面具	
	Array(1362074, 100, 1, 1), //	无爱手杖	
	Array(1432150, 100, 1, 1), //	无爱显圣枪	
	Array(1302248, 100, 1, 1), //	无爱破甲剑	
	Array(1322181, 100, 1, 1), //	无爱惊破天	
	Array(1492162, 100, 1, 1), //	无爱凤凰铳	
	Array(1522078, 100, 1, 1), //	无爱鲜花弩枪	
	Array(1372161, 100, 1, 1), //	无爱蝶翼杖	
	Array(1212044, 100, 1, 1), //	无爱双头杖	
	Array(1222044, 100, 1, 1), //	无爱紫龙	
	Array(1462177, 100, 1, 1), //	无爱冥雷弩	
	Array(1442202, 100, 1, 1), //	无爱神光戟	
	Array(1232041, 100, 1, 1), //	无爱冷酷搜索者	
	Array(1382192, 100, 1, 1), //	无爱冰轮杖	
	Array(1422124, 100, 1, 1), //	无爱威震天	
	Array(1402172, 100, 1, 1), //	无爱玄冥剑	
	Array(1332205, 100, 1, 1), //	无爱狂鲨锯	
	Array(1482151, 100, 1, 1), //	无爱孔雀翎	
	Array(1472197, 100, 1, 1), //	无爱大悲赋	
	Array(1342075, 100, 1, 1), //	无爱之刃	
	Array(1312135, 100, 1, 1), //	无爱断蚺斧	
	Array(1252031, 100, 1, 1), //	无爱咪咪凌世
//-------布莱客宾------
	Array(1412126, 100, 1, 1), //	布莱克缤双手斧	
	Array(1532089, 100, 1, 1), //	布莱克缤火炮	
	Array(1472205, 100, 1, 1), //	布莱克缤拳套	
	Array(1452196, 100, 1, 1), //	布莱克缤弓	
	Array(1362081, 100, 1, 1), //	布莱克缤手杖	
	Array(1242069, 100, 1, 1), //	布莱克缤能量剑	
	Array(1242070, 100, 1, 1), //	布莱克缤能量剑	
	Array(1432158, 100, 1, 1), //	布莱克缤长枪	
	Array(1492170, 100, 1, 1), //	布莱克缤短枪	
	Array(1322100, 100, 1, 1), //	布莱克缤单手钝器	
	Array(1522085, 100, 1, 1), //	布莱克缤双弩枪	
	Array(1372168, 100, 1, 1), //	布莱克缤短杖	
	Array(1212072, 100, 1, 1), //	布莱克缤双头杖	
	Array(1222067, 100, 1, 1), //	布莱克缤灵魂手铳	
	Array(1462184, 100, 1, 1), //	布莱克缤弩	
	Array(1442209, 100, 1, 1), //	布莱克缤长矛	
	Array(1382199, 100, 1, 1), //	布莱克缤长杖	
	Array(1232064, 100, 1, 1), //	布莱克缤亡命剑	
	Array(1422129, 100, 1, 1), //	布莱克缤双手钝器	
	Array(1332214, 100, 1, 1), //	布莱克缤短刀	
	Array(1402185, 100, 1, 1), //	布莱克缤双手剑	
	Array(1482159, 100, 1, 1), //	布莱克缤指节	
	Array(1342079, 100, 1, 1), //	布莱克缤双刀	
	Array(1252062, 100, 1, 1), //	布莱克缤魔法棒	
	Array(1312142, 100, 1, 1), //	布莱克缤单手斧	
	Array(1302070, 100, 1, 1), //	布莱克缤单手剑
//-------君主------
    Array(1302207, 100, 1, 1), //	君主单手剑	
	Array(1442170, 100, 1, 1), //	君主矛	
	Array(1532068, 100, 1, 1), //   君主火炮	
	Array(1452162, 100, 1, 1), //	君主长弓	
	Array(1242034, 100, 1, 1), //	君主炽热狮蝎剑		
	Array(1242052, 100, 1, 1), //	君主迅捷狮蝎剑		
	Array(1432131, 100, 1, 1), //	君主枪	
	Array(1362056, 100, 1, 1), //	君主手杖	
	Array(1492135, 100, 1, 1), //	君主沙漠之鹰	
	Array(1322150, 100, 1, 1), //	君主锤	
	Array(1522064, 100, 1, 1), //	君主双弩枪	
	Array(1372130, 100, 1, 1), //	君主权杖	
	Array(1212034, 100, 1, 1), //	君主双头杖	
	Array(1222034, 100, 1, 1), //	君主血月	
	Array(1462152, 100, 1, 1), //	君主弩	
	Array(1382158, 100, 1, 1), //	君主长杖	
	Array(1232034, 100, 1, 1), //	君主猩红黄道剑	
	Array(1422102, 100, 1, 1), //	君主巨锤	
	Array(1402142, 100, 1, 1), //	君主双手剑	
	Array(1482135, 100, 1, 1), //	君主指节		
	Array(1342064, 100, 1, 1), //	君主刀	
	Array(1472174, 100, 1, 1), //	君主拳套	
	Array(1252019, 100, 1, 1), //	君主猫梳魔法棒	
	Array(1312110, 100, 1, 1), //	君主斧	
	Array(1412099, 100, 1, 1), //	君主双手斧	
	Array(1332184, 100, 1, 1), //	君主屠杀者
    Array(1102365, 100, 1, 1), //	君主迅捷披风	
	Array(1102366, 100, 1, 1), //	君主炽热披风	
	Array(1102364, 100, 1, 1), //	君主锋锐披风	
	Array(1102363, 100, 1, 1), //	君主记忆披风	
	Array(1102362, 100, 1, 1), //	君主英勇披风
    Array(1082418, 100, 1, 1), //	君主锋锐手套	
	Array(1082419, 100, 1, 1), //	君主迅捷手套	
	Array(1082416, 100, 1, 1), //	君主英勇手套	
	Array(1082417, 100, 1, 1), //	君主记忆手套	
	Array(1082420, 100, 1, 1), //	君主炽热手套
    Array(1003443, 100, 1, 1), //	君主英勇头箍	
	Array(1003445, 100, 1, 1), //	君主锋锐头箍	
	Array(1003444, 100, 1, 1), //	君主记忆头箍	
	Array(1003447, 100, 1, 1), //	君主炽热头箍	
	Array(1003446, 100, 1, 1), //	君主迅捷头箍	
	Array(1072641, 100, 1, 1), //	君主英勇靴	
	Array(1072643, 100, 1, 1), //	君主锋锐靴	
	Array(1072642, 100, 1, 1), //	君主记忆靴	
	Array(1072645, 100, 1, 1), //	君主炽热靴	
	Array(1072644, 100, 1, 1), //	君主迅捷靴
    Array(1052433, 100, 1, 1), //	君主炽热锁子甲	
	Array(1052430, 100, 1, 1), //	君主记忆锁子甲	
	Array(1052431, 100, 1, 1), //	君主锋锐锁子甲	
	Array(1052432, 100, 1, 1), //	君主迅捷锁子甲	
	Array(1052429, 100, 1, 1), //	君主英勇锁子甲
//-------豪华------
	Array(1102445, 100, 1, 1), //	豪华阿加雷斯披风	
	Array(1102449, 100, 1, 1), //	豪华维帕尔披风	
	Array(1102448, 100, 1, 1), //	豪华赫尔巴斯披风	
	Array(1102447, 100, 1, 1), //	豪华伊布斯披风	
	Array(1102446, 100, 1, 1), //	豪华艾里格斯披风
    Array(1082470, 100, 1, 1), //	豪华维帕尔手套	
	Array(1082469, 100, 1, 1), //	豪华赫尔巴斯手套	
	Array(1082467, 100, 1, 1), //	豪华艾里格斯手套	
	Array(1082468, 100, 1, 1), //	豪华伊布斯手套	
	Array(1082466, 100, 1, 1), //	豪华阿加雷斯手套
    Array(1003592, 100, 1, 1), //	豪华赫尔巴斯头箍	
	Array(1003593, 100, 1, 1), //	豪华维帕尔头箍	
	Array(1003590, 100, 1, 1), //	豪华艾里格斯头箍	
	Array(1003591, 100, 1, 1), //	豪华伊布斯头箍	
	Array(1003589, 100, 1, 1), //	豪华阿加雷斯头箍	
	Array(1072705, 100, 1, 1), //	豪华伊布斯靴	
	Array(1072706, 100, 1, 1), //	豪华赫尔巴斯靴	
	Array(1072703, 100, 1, 1), //	豪华阿加雷斯靴	
	Array(1072704, 100, 1, 1), //	豪华艾里格斯靴	
	Array(1072707, 100, 1, 1), //	豪华维帕尔靴
    Array(1052498, 100, 1, 1), //	豪华阿加雷斯锁子甲	
	Array(1052499, 100, 1, 1), //	豪华艾里格斯锁子甲	
	Array(1052500, 100, 1, 1), //	豪华伊布斯锁子甲	
	Array(1052501, 100, 1, 1), //	豪华赫尔巴斯锁子甲	
	Array(1052502, 100, 1, 1), //	豪华维帕尔锁子甲
    Array(1302228, 100, 1, 1), //	豪华阿加雷斯拳刃	
	Array(1442183, 100, 1, 1), //	豪华阿加雷斯之矛	
	Array(1532075, 100, 1, 1), //	豪华维帕尔火炮	
	Array(1452171, 100, 1, 1), //	豪华伊布斯长弓	
	Array(1242043, 100, 1, 1), //	豪华地狱之路狮蝎剑	
	Array(1242046, 100, 1, 1), //	豪华维帕尔狮蝎剑	
	Array(1432139, 100, 1, 1), //	豪华阿加雷斯之矛	
	Array(1362068, 100, 1, 1), //	豪华赫尔巴斯手杖	
	Array(1322163, 100, 1, 1), //	豪华阿加雷斯锤	
	Array(1492153, 100, 1, 1), //	豪华维帕尔之鹰	
	Array(1522072, 100, 1, 1), //	豪华伊布斯双弩枪	
	Array(1372140, 100, 1, 1), //	豪华艾里格斯短杖	
	Array(1212043, 100, 1, 1), //	豪华艾里格斯双头杖	
	Array(1222043, 100, 1, 1), //	豪华维帕尔血月	
	Array(1462160, 100, 1, 1), //	豪华伊布斯弩	
	Array(1232040, 100, 1, 1), //	豪华阿加雷斯猩红黄道剑	
	Array(1382169, 100, 1, 1), //	豪华艾里格斯笞鞭	
	Array(1422108, 100, 1, 1), //	豪华阿加雷斯大槌	
	Array(1402152, 100, 1, 1), //	豪华阿加雷斯双手剑	
	Array(1482141, 100, 1, 1), //	豪华维帕尔指节手套	
	Array(1472180, 100, 1, 1), //	豪华赫尔巴斯手套	
	Array(1252030, 100, 1, 1), //	豪华艾里格斯猫梳魔法棒	
	Array(1312117, 100, 1, 1), //	豪华阿加雷斯头盔	
	Array(1332194, 100, 1, 1), //	豪华赫尔巴斯猎手	
	Array(1412105, 100, 1, 1), //	豪华阿加雷斯拳套
//------皇家------
	Array(1102514, 100, 1, 1), //	皇家英勇披风	
	Array(1102515, 100, 1, 1), //	皇家记忆披风	
	Array(1102518, 100, 1, 1), //	皇家炽热披风	
	Array(1102516, 100, 1, 1), //	皇家锋锐披风	
	Array(1102517, 100, 1, 1), //	皇家迅捷披风
    Array(1082510, 100, 1, 1), //	皇家炽热手套	
	Array(1082507, 100, 1, 1), //	皇家记忆手套	
	Array(1082506, 100, 1, 1), //	皇家英勇手套	
	Array(1082509, 100, 1, 1), //	皇家迅捷手套	
	Array(1082508, 100, 1, 1), //	皇家锋锐手套
    Array(1052581, 100, 1, 1), //	皇家记忆锁子甲	
	Array(1052582, 100, 1, 1), //	皇家锋锐锁子甲	
	Array(1052580, 100, 1, 1), //	皇家英勇锁子甲	
	Array(1052583, 100, 1, 1), //	皇家迅捷锁子甲	
	Array(1052584, 100, 1, 1), //	皇家炽热锁子甲
    Array(1003770, 100, 1, 1), //	皇家英勇头箍	
	Array(1003771, 100, 1, 1), //	皇家记忆头箍	
	Array(1003774, 100, 1, 1), //	皇家炽热头箍	
	Array(1003773, 100, 1, 1), //	皇家迅捷头箍	
	Array(1003772, 100, 1, 1), //	皇家锋锐头箍
    Array(1072787, 100, 1, 1), //	皇家记忆靴	
	Array(1072788, 100, 1, 1), //	皇家锋锐靴	
	Array(1072789, 100, 1, 1), //	皇家迅捷靴	
	Array(1072786, 100, 1, 1), //	皇家英勇靴
    Array(1072790, 100, 1, 1), //	皇家炽热靴
	Array(1412132, 100, 1, 1), //	皇家拳套		
	Array(1532095, 100, 1, 1), //	皇家君主	
	Array(1472211, 100, 1, 1), //	皇家血色手套	
	Array(1362087, 100, 1, 1), //	皇家手杖		
	Array(1242058, 100, 1, 1), //	皇家狮蝎剑	
	Array(1242057, 100, 1, 1), //	皇家狮蝎剑	
	Array(1302264, 100, 1, 1), //	皇家恐惧之剑	
	Array(1432164, 100, 1, 1), //	皇家枪			
	Array(1322199, 100, 1, 1), //	皇家锤	
	Array(1492176, 100, 1, 1), //	皇家沙漠之鹰	
	Array(1522091, 100, 1, 1), //	皇家双弩枪	
	Array(1372174, 100, 1, 1), //	皇家短杖	
	Array(1212060, 100, 1, 1), //	皇家双头杖		
	Array(1222055, 100, 1, 1), //	皇家血月	
	Array(1442219, 100, 1, 1), //	皇家矛	
	Array(1462190, 100, 1, 1), //	皇家弩		
	Array(1232055, 100, 1, 1), //	皇家猩红黄道剑	
	Array(1422136, 100, 1, 1), //	皇家锤	
	Array(1382206, 100, 1, 1), //	皇家笞鞭	
	Array(1332222, 100, 1, 1), //	皇家屠杀者	
	Array(1402191, 100, 1, 1), //	皇家所罗门之剑	
	Array(1482165, 100, 1, 1), //	皇家君主		
	Array(1452202, 100, 1, 1), //	皇家长弓	
	Array(1252059, 100, 1, 1), //	皇家猫梳魔法棒	
	Array(1312150, 100, 1, 1), //	皇家斧	
	Array(1342080, 100, 1, 1), //	皇家刀
//------死灵法师------
	Array(1082593, 100, 1, 1), //	死灵法师战士手套	
	Array(1082594, 100, 1, 1), //	死灵法师魔法师手套	
	Array(1082595, 100, 1, 1), //	死灵法师哨兵手套	
	Array(1082596, 100, 1, 1), //	死灵法师追踪者手套	
	Array(1082597, 100, 1, 1), //	死灵法师船长手套	
	Array(1052787, 100, 1, 1), //	死灵法师追踪者套服	
	Array(1052788, 100, 1, 1), //	死灵法师船长套服	
	Array(1052785, 100, 1, 1), //	死灵法师魔法师套服	
	Array(1052786, 100, 1, 1), //	死灵法师哨兵套服	
	Array(1052784, 100, 1, 1), //	死灵法师战士套服
    Array(1004215, 100, 1, 1), //	死灵法师魔法师帽	
	Array(1004214, 100, 1, 1), //	死灵法师战士帽	
	Array(1004217, 100, 1, 1), //	死灵法师追踪者帽	
	Array(1004216, 100, 1, 1), //	死灵法师哨兵帽	
	Array(1004218, 100, 1, 1), //	死灵法师船长帽	
	Array(1072956, 100, 1, 1), //	死灵法师船长鞋	
	Array(1072955, 100, 1, 1), //	死灵法师追踪者鞋	
	Array(1072954, 100, 1, 1), //	死灵法师哨兵鞋	
	Array(1072953, 100, 1, 1), //	死灵法师魔法师鞋	
	Array(1072952, 100, 1, 1), //	死灵法师战士鞋
    Array(1302213, 100, 1, 1), //	死灵法师单手剑	
	Array(1442171, 100, 1, 1), //	死灵法师矛	
	Array(1532071, 100, 1, 1), //	死灵法师火炮	
	Array(1452163, 100, 1, 1), //	死灵法师长弓	
	Array(1242035, 100, 1, 1), //	死灵法师矛头剑	
	Array(1432133, 100, 1, 1), //	死灵法师枪	
	Array(1362061, 100, 1, 1), //	死灵法师手杖	
	Array(1492136, 100, 1, 1), //	死灵法师沙漠之鹰	
	Array(1322151, 100, 1, 1), //	死灵法师锤	
	Array(1522067, 100, 1, 1), //	死灵法师双弩枪	
	Array(1372132, 100, 1, 1), //	死灵法师权杖	
	Array(1212035, 100, 1, 1), //	死灵法师双头杖	
	Array(1222035, 100, 1, 1), //	死灵法师紫龙	
	Array(1462153, 100, 1, 1), //	死灵法师弩	
	Array(1382159, 100, 1, 1), //	死灵法师长杖	
	Array(1232035, 100, 1, 1), //	死灵法师冷酷搜索者	
	Array(1422103, 100, 1, 1), //	死灵法师大槌	
	Array(1402143, 100, 1, 1), //	死灵法师双手剑	
	Array(1482136, 100, 1, 1), //	死灵法师指节拳甲	
	Array(1472175, 100, 1, 1), //	死灵法师血色拳套	
	Array(1342066, 100, 1, 1), //	死灵法师刀	
	Array(1252020, 100, 1, 1), //	死灵法师猫梳魔法棒	
	Array(1312112, 100, 1, 1), //	死灵法师斧	
	Array(1332188, 100, 1, 1), //	死灵法师狂鲨锯	
	Array(1332187, 100, 1, 1), //	死灵法师屠杀者	
	Array(1412100, 100, 1, 1), //	死灵法师重斧
//------女皇------
	//Array(1302152, 100, 1, 1), //	狮心弯刀	
	//Array(1442116, 100, 1, 1), //	狮心矛	
	//Array(1432086, 100, 1, 1), //	狮心长枪	
	//Array(1322096, 100, 1, 1), //	狮心震雷钉	
	//Array(1232014, 100, 1, 1), //	狮心痛苦命运	
	//Array(1422066, 100, 1, 1), //	狮心巨锤	
	//Array(1312065, 100, 1, 1), //	狮心勇士斧	
	//Array(1412065, 100, 1, 1), //	狮心战斗斧	
	//Array(1402095, 100, 1, 1), //	狮心战斗弯刀	
	//Array(1003172, 100, 1, 1), //	狮心战斗头盔
	//Array(1102275, 100, 1, 1), //	狮心战斗披风	
	//Array(1152108, 100, 1, 1), //	狮心战斗护肩	
	//Array(1082295, 100, 1, 1), //	狮心战斗护腕	
	//Array(1052314, 100, 1, 1), //	狮心战斗锁子甲
	//Array(1072485, 100, 1, 1), //	狮心战斗鞋
	//Array(1532018, 100, 1, 1), //	鲨齿火焰炮	
	//Array(1242014, 100, 1, 1), //	鲨齿女王意志之剑	
	//Array(1492085, 100, 1, 1), //	鲨齿锐利手铳	
	//Array(1222014, 100, 1, 1), //	鲨齿灵魂汲取者	
	//Array(1482084, 100, 1, 1), //	鲨齿巨鹰爪
	//Array(1102279, 100, 1, 1), //	鲨齿船长披风	
	//Array(1152113, 100, 1, 1), //	鲨齿船长护肩	
	//Array(1082299, 100, 1, 1), //	鲨齿船长手套	
	//Array(1052318, 100, 1, 1), //	鲨齿船长外套
	//Array(1003176, 100, 1, 1), //	鲨齿船长帽	
	//Array(1072489, 100, 1, 1), //	鲨齿船长鞋
	//Array(1242042, 100, 1, 1), //	渡鸦之魂女王意志之剑	
	//Array(1362019, 100, 1, 1), //	渡鸦之魂真红手杖	
	//Array(1472122, 100, 1, 1), //	渡鸦之魂钢铁拳套	
	//Array(1332130, 100, 1, 1), //	渡鸦之魂短刀
	//Array(1102278, 100, 1, 1), //	渡鸦之魂猎人披风	
	//Array(1152112, 100, 1, 1), //	渡鸦之魂猎人护肩	
	//Array(1082298, 100, 1, 1), //	渡鸦之魂追踪者手套	
	//Array(1052317, 100, 1, 1), //	渡鸦之魂追踪者盔甲
	//Array(1003175, 100, 1, 1), //	渡鸦之魂追踪者帽	
	//Array(1072488, 100, 1, 1), //	渡鸦之魂追踪者鞋
	//Array(1452111, 100, 1, 1), //	鹰翼组合弓		
	//Array(1462099, 100, 1, 1), //	鹰翼重弩
	//Array(1102277, 100, 1, 1), //	鹰翼哨兵披风	
	//Array(1152111, 100, 1, 1), //	鹰翼哨兵护肩	
	//Array(1082297, 100, 1, 1), //	鹰翼哨兵手套	
	//Array(1052316, 100, 1, 1), //	鹰翼哨兵服
	//Array(1003174, 100, 1, 1), //	鹰翼哨兵便帽	
	//Array(1072487, 100, 1, 1), //	鹰翼哨兵鞋
	//Array(1212014, 100, 1, 1), //	龙尾黑甲凶灵	
	//Array(1372084, 100, 1, 1), //	龙尾精灵短杖	
	//Array(1382104, 100, 1, 1), //	龙尾战斗长杖
	//Array(1102276, 100, 1, 1), //	龙尾法师披风	
	//Array(1152110, 100, 1, 1), //	龙尾法师护肩	
	//Array(1082296, 100, 1, 1), //	龙尾法师手套	
	//Array(1052315, 100, 1, 1), //	龙尾法师长袍
	//Array(1003173, 100, 1, 1), //	龙尾法师帽子	
	//Array(1072486, 100, 1, 1), //	龙尾法师鞋	
//------真红------
	Array(1412136, 100, 1, 1), //	真红战斗斧	
	Array(1532099, 100, 1, 1), //	真红崩溃	
	Array(1472215, 100, 1, 1), //	真红暗黑拳套	
	Array(1362091, 100, 1, 1), //	真红手杖	
	Array(1242063, 100, 1, 1), //	真红分裂剑	
	Array(1242062, 100, 1, 1), //	真红分裂剑		
	Array(1432168, 100, 1, 1), //	真红战斗矛	
	Array(1302276, 100, 1, 1), //	真红战剑	
	Array(1492180, 100, 1, 1), //	真红无限手铳	
	Array(1522095, 100, 1, 1), //	真红鹰翼	
	Array(1372178, 100, 1, 1), //	真红恶魔手杖	
	Array(1212065, 100, 1, 1), //	真红黑甲凶灵	
	Array(1222060, 100, 1, 1), //	真红天使射手	
	Array(1702455, 100, 1, 1), //	真红油漆桶	
	Array(1442224, 100, 1, 1), //	真红地狱鸟	
	Array(1462194, 100, 1, 1), //	真红十字弩	
	Array(1232058, 100, 1, 1), //	真红死亡使者	
	Array(1422141, 100, 1, 1), //	真红战斗锤	
	Array(1382209, 100, 1, 1), //	真红战斗法杖	
	Array(1332226, 100, 1, 1), //	真红十字剑	
	Array(1402197, 100, 1, 1), //	真红巨剑	
	Array(1322204, 100, 1, 1), //	真红战锤	
	Array(1482169, 100, 1, 1), //	真红格里芬爪	
	Array(1452206, 100, 1, 1), //	真红战斗弓	
	Array(1312154, 100, 1, 1), //	真红战斧	
	Array(1342083, 100, 1, 1), //	真红之刀
	Array(1113070, 100, 1, 1), //	真红之环	
	Array(1152155, 100, 1, 1), //	真红护肩
	Array(1032216, 100, 1, 1), //	真红耳环
//------戒指------
Array(1112915, 100, 1, 1), //	蓝调戒指
Array(1112585, 100, 1, 1), //	天使的祝福
Array(1112586, 100, 1, 1), //	黑天使的祝福
//------革命-----
    Array(1102612, 100, 1, 1), //	革命披风	
	Array(1122262, 100, 1, 1), //	革命吊坠	
	Array(1132242, 100, 1, 1), //	革命腰带	
	Array(1082540, 100, 1, 1), //	革命手套	
	Array(1052647, 100, 1, 1), //	革命战斗服	
	Array(1462204, 100, 1, 1), //	革命暗黑弩	
	Array(1412147, 100, 1, 1), //	革命双手战斧	
	Array(1532109, 100, 1, 1), //	革命手炮	
	Array(1362101, 100, 1, 1), //	革命手杖	
	Array(1472226, 100, 1, 1), //	革命拳甲	
	Array(1302289, 100, 1, 1), //	革命剑	
	Array(1242080, 100, 1, 1), //	革命锁链剑	
	Array(1432178, 100, 1, 1), //	革命之矛	
	Array(1492190, 100, 1, 1), //	革命红杰克	
	Array(1372188, 100, 1, 1), //	革命短杖	
	Array(1212079, 100, 1, 1), //	革命双头杖	
	Array(1462093, 100, 1, 1), //	革命弩	
	Array(1222074, 100, 1, 1), //	革命灵魂手铳	
	Array(1492080, 100, 1, 1), //	革命枪	
	Array(1442234, 100, 1, 1), //	革命长戟	
	Array(1522105, 100, 1, 1), //	革命双翼短杖	
	Array(1232074, 100, 1, 1), //	革命恶魔剑	
	Array(1382222, 100, 1, 1), //	革命圣杖	
	Array(1332238, 100, 1, 1), //	革命切割者	
	Array(1312165, 100, 1, 1), //	革命战斧	
	Array(1322215, 100, 1, 1), //	革命铁瓜锤	
	Array(1482179, 100, 1, 1), //	革命冲拳	
	Array(1402210, 100, 1, 1), //	革命双手剑	
	Array(1382101, 100, 1, 1), //	革命长杖	
	Array(1452216, 100, 1, 1), //	革命弓	
	Array(1252046, 100, 1, 1), //	革命猫梳魔法棒	
	Array(1422152, 100, 1, 1), //	革命巨锤	
	Array(1003946, 100, 1, 1), //	革命帽子	
	Array(1072853, 100, 1, 1), //	革命鞋子
// ------ 其他 --------------
Array(2430112, 100, 1, 1), //	神奇魔方碎片
Array(2430481, 100, 1, 1), //	高级神奇魔方碎片
Array(2430915, 100, 1, 1), //	附加神奇魔方碎片
Array(2431893, 100, 1, 1), //	红色魔方碎片
Array(5062000, 100, 1, 1), //	神奇魔方
Array(5062002, 100, 1, 1), //	高级神奇魔方
Array(5062500, 100, 1, 1), //	大师附加神奇魔方
Array(5062009, 100, 1, 1), //	超级神奇魔方
Array(5064000, 100, 1, 1), //	防爆卷轴
Array(2340000, 100, 1, 1), //	祝福卷轴
Array(2049300, 100, 1, 1), //	有损，高级装备强化卷轴
Array(1202023, 100, 1, 1), //	真·乔图腾	
Array(1202027, 100, 1, 1), //	真·海丽蜜图腾	
Array(1202031, 100, 1, 1), //	真·小龙图腾	
Array(1202035, 100, 1, 1), //	真·李卡司图腾
// ------暴风雪公正--------------
    Array(1050278, 100, 1, 1), //	暴风雪连身衣	
	Array(1050279, 100, 1, 1), //	暴风雪连身衣	
	Array(1050282, 100, 1, 1), //	暴风雪连身衣	
	Array(1050280, 100, 1, 1), //	暴风雪连身衣	
	Array(1050281, 100, 1, 1), //	暴风雪连身衣	
	Array(1051343, 100, 1, 1), //	暴风雪连身衣	
	Array(1051342, 100, 1, 1), //	暴风雪连身衣	
	Array(1051341, 100, 1, 1), //	暴风雪连身衣	
	Array(1051340, 100, 1, 1), //	暴风雪连身衣	
	Array(1051344, 100, 1, 1), //	暴风雪连身衣	
	Array(1070054, 100, 1, 1), //	暴风雪鞋	
	Array(1070053, 100, 1, 1), //	暴风雪鞋	
	Array(1070052, 100, 1, 1), //	暴风雪鞋	
	Array(1070056, 100, 1, 1), //	暴风雪鞋	
	Array(1070055, 100, 1, 1), //	暴风雪鞋	
	Array(1071070, 100, 1, 1), //	暴风雪鞋	
	Array(1071071, 100, 1, 1), //	暴风雪鞋	
	Array(1071072, 100, 1, 1), //	暴风雪鞋	
	Array(1071073, 100, 1, 1), //	暴风雪鞋	
	Array(1071069, 100, 1, 1), //	暴风雪鞋
	Array(1050277, 100, 1, 1), //	公正连身衣	
	Array(1050273, 100, 1, 1), //	公正连身衣	
	Array(1050274, 100, 1, 1), //	公正连身衣	
	Array(1050275, 100, 1, 1), //	公正连身衣	
	Array(1050276, 100, 1, 1), //	公正连身衣	
	Array(1051339, 100, 1, 1), //	公正连身衣	
	Array(1051337, 100, 1, 1), //	公正连身衣	
	Array(1051338, 100, 1, 1), //	公正连身衣	
	Array(1051335, 100, 1, 1), //	公正连身衣	
	Array(1051336, 100, 1, 1), //	公正连身衣	
	Array(1070048, 100, 1, 1), //	公正鞋	
	Array(1070049, 100, 1, 1), //	公正鞋	
	Array(1070047, 100, 1, 1), //	公正鞋	
	Array(1070050, 100, 1, 1), //	公正鞋	
	Array(1070051, 100, 1, 1), //	公正鞋	
	Array(1071065, 100, 1, 1), //	公正鞋	
	Array(1071066, 100, 1, 1), //	公正鞋	
	Array(1071064, 100, 1, 1), //	公正鞋	
	Array(1071067, 100, 1, 1), //	公正鞋	
	Array(1071068, 100, 1, 1), //	公正鞋	
// ------ 086添加 ------
Array(2290285, 100, 1, 1) //秘密能手册
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4310143)) {
            cm.sendYesNo("<即将开放>BOSS币商人中有各类#b极品装备、卷轴或稀有道具#k！使用“#b10个#t4310143##k”就可以抽奖，赞助理财和BOSS都有爆。 没有BOSS币，是不可以抽奖的，现在要抽奖么? ");
        } else {
            cm.sendOk("你背包里有5个#b#v4310143##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() *100);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "BOSS币商人", notice);
            if (item != -1) {
                cm.gainItem(4310143, -10);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4310143##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：神奇魔方 一个。)");
            cm.gainItem(4310143, -10);
            cm.gainItem(5062000, 1);
            cm.safeDispose();
        }
    }
}