var a = 0;
var text;
var selects; //记录玩家的选项
var buynum = 0;
var itemlist = Array(
Array(1052439,188), //魔法学校校服 - 装备魔法学校校服和魔法学校皮鞋，魔法学校的学弟学妹就会出现在周围.
Array(1112822,88), //梦幻悬浮戒指
Array(1112947,108), //梦幻悬浮戒指
Array(1052408,188), //热血高校服 - 装备高校服和高校皮鞋，狐朋狗友就会出现在周围.
Array(3994577,88), //iPodtouch
Array(2430868,88), //宠物使用卷
Array(5010102,88), //伤不起
Array(5010103,88), //求基友
Array(5010104,88), //求包养
Array(5160035,88), //搞怪表情
Array(1042279,88), //训字T恤
Array(1042280,88), //民字T恤
Array(1042281,88), //正字T恤
Array(1042282,88), //音字T恤
Array(1042285,88), //拼色点点T恤
Array(1042251,88), //蛇年嘻哈卫衣 - 一年只卖一次的十二生肖礼包专用，镶有蛇年LOGO的纪念道具。蛇年防具4件和冒险岛传说的黑蛇称号一起装备时，发动十二生肖蛇年套装效果
Array(1048000,88), //情侣T恤 - 可以购买的同时赠送给自己的爱人，佩戴该道具的两个角色在一定距离内会显示爱情效果
Array(1048001,88), //兔兔情侣衫 - 可以购买的同时赠送给自己的爱人，佩戴该道具的两个角色在一定距离内会显示爱情效果。
Array(1048002,88), //胡萝卜情侣衫 - 可以购买的同时赠送给自己的爱人，佩戴该道具的两个角色在一定距离内会显示爱情效果。
Array(1049000,88), //友情T恤 - 可以购买的同时赠送给自己的亲友，佩戴该道具的两个角色在一定距离内会显示友情效果。
Array(1112949,88), //旋律戒指
Array(1112170,88), //明星名片戒指
Array(1112282,88), //明星聊天戒指
Array(1112937,88), //催眠曲戒指
Array(1004157,88), //来自心心的我 - 由中国冒险岛玩家"小术"设计。带上耳罩后，漂浮起来。后面出现动画效果。
Array(1004203,88), //喵星人的秘密 - 由中国玩家“小术”设计的喵星人帽子，使用后出现漂浮特效
Array(1004332,88), //我爱小狗 - 由中国玩家“小术”设计的可爱的我爱小狗帽子。使用后，将会产生悬浮特效。
Array(1050221,188), //精灵王服饰-男款 - 精灵王假发、精灵王服饰、精灵王手套、精灵王靴子、精灵王披风，一起穿戴时打入#c/精灵之力#命令语时会发动特殊的动作.
Array(1050220,188), //军团长外套-男款 - 军团长假发、军团长外套、军团长手套、军团长靴子、军团长披风，一起穿戴时打入#c/黑暗力量#命令语时会发动特殊的动作.
Array(1702454,88), //波浪海豹枕
Array(1051271,188), //精灵王服饰-女款 - 精灵王假发、精灵王服饰、精灵王手套、精灵王靴子、精灵王披风，一起穿戴时打入#c/精灵之力#命令语时会发动特殊的动作. 
Array(1051270,188), //军团长外套-女款 - 军团长假发、军团长外套、军团长手套、军团长靴子、军团长披风，一起穿戴时打入#c/黑暗力量#命令语时会发动特殊的动作.   
Array(1052440,88), //武陵道场道服 - 装备武陵道场道鞋和武陵道场道服时周边会出现武陵道场的朋友们. 
Array(1050352,88), //人气模范生套装 - 红色上装搭配蓝色格纹的模范生套装，是最具人气的校园风时装。\n装备后将发动红宝石四叶草特效。
Array(1051421,88), //人气模范生连衣裙 - 红色上装搭配蓝色格纹的模范生连衣裙，是最具人气的校园风时装。\n装备后将发动红宝石四叶草特效。
Array(1051406,88), //夏威夷情侣 - 如果和穿着[夏威夷情侣（男）]套装的#c他在一定距离内#相遇，欢乐的草裙小伙伴们就会出现。 
Array(1051404,88), //落花轻扬优质校服 - 装备时，会出现随风飞扬的色彩斑斓的花瓣。 
Array(1051405,88), //旋律少女 - 创造出最美的旋律的少女。 
Array(1050337,88), //夏威夷情侣 - 如果和穿着[夏威夷情侣（女）]套装的#c她在一定距离内#相遇，欢乐的草裙小伙伴们就会出现。
//Array(8842118,88), //红色格子衬 
//Array(8812253,88), //心跳唇彩   
Array(1112150,88), //天使降临名 
Array(1112262,88), //天使降临聊 
//Array(8802423,88), //白荷兰帽   
//Array(8841125,88), //彩虹衫     
//Array(8802840,88), //嫩黄小鸡   
//Array(8804117,88), //糖果糖果   
//Array(8842265,88), //草莓围脖上 
//Array(8852634,88), //简洁白衬衫 
//Array(8803171,88), //摩斯帽     
Array(1702405,88), //星光之星魔 
//Array(8862211,88), //奶牛短裤   
//Array(8842036,88), //红色冬恋上 
//Array(8852306,88), //雪姬和服   
//Array(8803234,88), //卓别林帽   
//Array(8842076,88), //花点T恤    
//Array(1882564,88), //天衣无缝   
//Array(8802863,88), //小熊熊可爱 
//Array(8842120,88), //蓝色纯情大 
//Array(8842121,88), //粉色纯情大 
//Array(8804192,88), //哆来咪耳麦 
//Array(8803921,88), //咕噜噜鸭舌 
//Array(8842236,88), //苹果绿毛衣 
//Array(8852201,88), //闪亮水手   
//Array(8842278,88), //丁尼卫衣   
//Array(8803919,88), //花花绒线帽 
//Array(8804167,88), //绿色恐龙帽
//Array(8803760,88), //猫咪耳机
//Array(8803748,88), //皇家天使帽
//Array(8842142,88), //彩虹条背心
//Array(8860181,88), //流星雨短裤
//Array(8804027,88), //白猫无边帽
//Array(8802748,88), //绿苹果头套帽
//Array(8842128,88), //苹果绿短袖衫
//Array(8804193,88), //搞怪翅膀帽
//Array(8882592,88), //焰鬼隐布
//Array(8862183,88), //玫红背带裤
//Array(1112883,88), //嫩黄名片戒指
Array(1702250,88) //钞票箱
//Array(8873022,88), //蓝色喵喵球鞋
//Array(8873023,88)  //灰色喵喵球鞋

);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			text = "#h0#,您可以在这里兑换#e#b极品卷轴#n#k,请选择你想要购买的物品\r\n#b";
			for (var i=0; i<itemlist.length; i++) {
				text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# - #r"+itemlist[i][1]+"#b雪花币  \r\n";
				if (i != 0 && (i+1) % 5 == 0) {
					text += "\r\n";
				}
			}
            cm.sendSimple(text);
        } else if (a == 1) {
			selects = selection;
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r1个需要" + itemlist[selects][1] + "个#b雪花币#k", 0, 0, 999999);
        } else if (a == 2) {
            buynum = selection;
            cm.sendNext("你想购买" + buynum + "个#r#i" + itemlist[selects][0] + "##k？\r\n你将使用掉" + (buynum * itemlist[selects][1]) + "雪花币。");
        } else if (a == 3) {
            if (cm.haveItem(4310014,buynum * itemlist[selects][1])) {
                cm.gainItem(4310014, -buynum * itemlist[selects][1]);
                cm.gainItem(itemlist[selects][0], buynum);
                cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的雪花币。");
                cm.dispose();
            }
        }
    }//mode
}//f