status = -1;
var head = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n";
var icon = "#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#";
var itemList = Array(
// ------ 消耗栏 ------
Array(5062000, 500, 5, 1),
Array(5062002, 500, 5, 1),
Array(5062500, 500, 5, 1),
Array(5062000, 500, 5, 1),
Array(5062002, 500, 5, 1),
Array(5062500, 500, 5, 1),
Array(5062000, 500, 5, 1),
Array(5062002, 500, 5, 1),
Array(5062500, 500, 5, 1),
Array(5062000, 500, 5, 1),
Array(5062002, 500, 5, 1),
Array(5062500, 500, 5, 1),
Array(5062000, 500, 5, 1),
Array(5062002, 500, 5, 1),
Array(5062500, 500, 5, 1),
Array(5062000, 500, 5, 1),
Array(5062002, 500, 5, 1),
Array(5062500, 500, 5, 1),
Array(2049323, 100, 1, 3),
Array(2049137, 100, 1, 3),
Array(2049136, 100, 1, 3),
Array(5064000, 500, 1, 2),
Array(2340000, 500, 5, 3),
Array(2049700, 500, 1, 3),
Array(2049704, 500, 1, 3),
Array(2049720, 100, 1, 3),
Array(2049752, 100, 1, 3),
Array(2049323, 100, 1, 3),
Array(2049137, 100, 1, 3),
Array(2049136, 100, 1, 3),
Array(5064000, 500, 1, 1),
Array(2340000, 500, 5, 3),
Array(2049700, 500, 1, 3),
Array(2049704, 500, 1, 3),
Array(2049720, 100, 1, 3),
Array(2049752, 100, 1, 3),
Array(2049323, 100, 1, 3),
Array(2049137, 100, 1, 3),
Array(2049136, 100, 1, 3),
Array(5064000, 500, 1, 1),
Array(2340000, 500, 5, 3),
Array(2049700, 500, 1, 3),
Array(2049704, 500, 1, 3),
Array(2049720, 100, 1, 3),
Array(2049752, 100, 1, 3),
Array(2049323, 100, 1, 3),
Array(2049137, 100, 1, 3),
Array(2049136, 100, 1, 3),
Array(5064000, 500, 1, 1),
Array(2340000, 500, 5, 3),
Array(2049700, 500, 1, 3),
Array(2049704, 500, 1, 3),
Array(2049720, 100, 1, 3),
Array(2049752, 100, 1, 3),
Array(2049323, 100, 1, 3),
Array(2049137, 100, 1, 3),
Array(2049136, 100, 1, 3),
Array(5064000, 500, 1, 1),
Array(2340000, 500, 5, 3),
Array(2049700, 500, 1, 3),
Array(2049704, 500, 1, 3),
Array(2049720, 100, 1, 3),
Array(2049752, 100, 1, 3),
// ------ 150装备 ------
Array(1212011,500, 1, 1), 
Array(1212012,500, 1, 1), 
Array(1222011,500, 1, 1), 
Array(1222012,500, 1, 1), 
Array(1232011,500, 1, 1), 
Array(1232012,500, 1, 1), 
Array(1242011,500, 1, 1), 
Array(1242012,500, 1, 1), 
Array(1302081,500, 1, 1), 
Array(1302086,500, 1, 1),
Array(1312037,500, 1, 1),
Array(1312038,500, 1, 1),
Array(1322060,500, 1, 1),
Array(1322061,500, 1, 1),
Array(1332075,500, 1, 1),
Array(1332076,500, 1, 1),
Array(1342011,500, 1, 1),
Array(1342012,500, 1, 1),
Array(1362016,500, 1, 1),
Array(1362017,500, 1, 1),
Array(1372044,500, 1, 1),
Array(1372045,500, 1, 1),
Array(1382057,500, 1, 1),
Array(1382059,500, 1, 1),
Array(1402046,500, 1, 1),
Array(1402047,500, 1, 1),
Array(1412033,500, 1, 1),
Array(1412034,500, 1, 1),
Array(1422037,500, 1, 1), //
Array(1422038,500, 1, 1), 
Array(1432047,500, 1, 1),
Array(1432049,500, 1, 1),
Array(1442063,500, 1, 1),
Array(1442067,500, 1, 1),
Array(1452057,500, 1, 1),
Array(1452059,500, 1, 1),
Array(1462020,500, 1, 1),
Array(1462051,500, 1, 1),
Array(1472068,500, 1, 1),
Array(1472071,500, 1, 1),
Array(1482023,500, 1, 1),
Array(1482024,500, 1, 1),
Array(1492023,500, 1, 1),
Array(1492025,500, 1, 1),
Array(1522015,500, 1, 1),
Array(1522016,500, 1, 1),
Array(1532015,500, 1, 1),
Array(1532016,500, 1, 1),
Array(1942002,500, 1, 1),
Array(1952002,500, 1, 1),
Array(1002776,500, 1, 1),
Array(1002777,500, 1, 1),
Array(1002778,500, 1, 1),
Array(1002779,500, 1, 1),
Array(1002755,500, 1, 1),
Array(1002790,500, 1, 1),
Array(1002791,500, 1, 1),
Array(1002792,500, 1, 1),
Array(1002793,500, 1, 1),
Array(1002794,500, 1, 1),
Array(1082234,500, 1, 1),
Array(1082235,500, 1, 1),
Array(1082236,500, 1, 1),
Array(1082237,500, 1, 1),
Array(1082238,500, 1, 1),
Array(1082239,500, 1, 1),
Array(1082240,500, 1, 1),
Array(1082241,500, 1, 1),
Array(1082242,500, 1, 1),
Array(1082243,500, 1, 1),
Array(1052155,500, 1, 1),
Array(1052156,500, 1, 1),
Array(1052157,500, 1, 1),
Array(1052158,500, 1, 1),
Array(1052159,500, 1, 1),
Array(1052160,500, 1, 1),
Array(1052161,500, 1, 1),
Array(1052162,500, 1, 1),
Array(1052163,500, 1, 1),
Array(1052164,500, 1, 1),
Array(1072355,500, 1, 1),
Array(1072356,500, 1, 1),
Array(1072357,500, 1, 1),
Array(1072358,500, 1, 1),
Array(1072359,500, 1, 1),
Array(1072361,500, 1, 1),
Array(1072362,500, 1, 1),
Array(1072363,500, 1, 1),
Array(1072364,500, 1, 1),
Array(1072365,500, 1, 1),
Array(1232014,500, 1, 1),
Array(1302152,500, 1, 1),
Array(1312065,500, 1, 1),
Array(1322096,500, 1, 1),
Array(1402095,500, 1, 1),
Array(1412065,500, 1, 1),
Array(1422066,500, 1, 1),
Array(1432086,500, 1, 1),
Array(1442116,500, 1, 1),
Array(1052314,500, 1, 1),
Array(1152108,500, 1, 1),
Array(1003172,500, 1, 1),
Array(1102275,500, 1, 1),
Array(1082295,500, 1, 1),
Array(1072485,500, 1, 1),
Array(1152113,500, 1, 1),
Array(1003176,500, 1, 1),
Array(1102279,500, 1, 1),
Array(1082299,500, 1, 1),
Array(1052318,500, 1, 1),
Array(1072489,500, 1, 1),
Array(1222014,500, 1, 1),
Array(1242014,500, 1, 1),
Array(1482084,500, 1, 1),
Array(1492085,500, 1, 1),
Array(1532018,500, 1, 1),
Array(1152112,500, 1, 1),
Array(1003175,500, 1, 1),
Array(1102278,500, 1, 1),
Array(10825, 1, 3,500, 1, 1),
Array(1052317,500, 1, 1),
Array(1072488,500, 1, 1),
Array(1242042,500, 1, 1),
Array(1332130,500, 1, 1),
Array(1362019,500, 1, 1),
Array(1052316,500, 1, 1),
Array(1452111,500, 1, 1),
Array(1462099,500, 1, 1),
Array(1082297,500, 1, 1),
Array(1003174,500, 1, 1),
Array(1102277,500, 1, 1),
Array(1072487,500, 1, 1),
Array(1152111,500, 1, 1),
Array(1152110,500, 1, 1),
Array(1102276,500, 1, 1),
Array(1003173,500, 1, 1),
Array(1082296,500, 1, 1),
Array(1052315,500, 1, 1),
Array(1072486,500, 1, 1),
Array(1372084,500, 1, 1),
Array(1212014,500, 1, 1),
Array(1382104,500, 1, 1),
Array(1102612,500, 1, 1),
Array(1122262,500, 1, 1),
Array(1132242,500, 1, 1),
Array(1082540,500, 1, 1),
Array(1052647,500, 1, 1),
Array(1462204,500, 1, 1),
Array(1412147,500, 1, 1),

Array(1532109,500, 1, 1),
Array(1362101,500, 1, 1),
Array(1472226,500, 1, 1),
Array(1302289,500, 1, 1),
Array(1242055,500, 1, 1),
Array(1432178,500, 1, 1),
Array(1492190,500, 1, 1),
Array(1372188,500, 1, 1),
Array(1212079,500, 1, 1),
Array(1462093,500, 1, 1),
Array(1222074,500, 1, 1),
Array(1492055,500, 1, 1),
Array(1442234,500, 1, 1),
Array(1522105,500, 1, 1),
Array(1232074,500, 1, 1),
Array(1382222,500, 1, 1),
Array(1332238,500, 1, 1),
Array(1312165,500, 1, 1),
Array(1322215,500, 1, 1),
Array(1482179,500, 1, 1),
Array(1402210,500, 1, 1),
Array(1382101,500, 1, 1),
Array(1452216,500, 1, 1),
Array(1252046,500, 1, 1),
Array(1422152,500, 1, 1),
Array(1003946,500, 1, 1),
Array(1072853,500, 1, 1),
Array(1102365,500, 1, 1),
Array(1102366,500, 1, 1),
Array(1102364,500, 1, 1),
Array(1102363,500, 1, 1),
Array(1102362,500, 1, 1),
Array(1112712,500, 1, 1),
Array(1112784,500, 1, 1),
Array(1112783,500, 1, 1),
Array(1112782,500, 1, 1),
Array(1152116,500, 1, 1),
Array(1152115,500, 1, 1),
Array(1152114,500, 1, 1),
Array(1152079,500, 1, 1),
Array(1132141,500, 1, 1),
Array(1132187,500, 1, 1),
Array(1132189,500, 1, 1),
Array(1132188,500, 1, 1),
Array(1082418,500, 1, 1),
Array(1082419,500, 1, 1),
Array(1082416,500, 1, 1),
Array(1082417,500, 1, 1),
Array(1082420,500, 1, 1),
Array(1052433,500, 1, 1),
Array(1052430,500, 1, 1),
Array(1052431,500, 1, 1),
Array(1052432,500, 1, 1),
Array(1052429,500, 1, 1),
Array(1302207,500, 1, 1),
Array(1442170,500, 1, 1),
Array(1532068,500, 1, 1),
Array(1532095,500, 1, 1),
Array(1452162,500, 1, 1),
Array(1242034,500, 1, 1),
Array(1362033,500, 1, 1),
Array(1242052,500, 1, 1),
Array(1362008,500, 1, 1),
Array(1432131,500, 1, 1),
Array(1362053,500, 1, 1),
Array(1362056,500, 1, 1),
Array(1492135,500, 1, 1),
Array(1322120,500, 1, 1),
Array(1522064,500, 1, 1),
Array(1372130,500, 1, 1),
Array(1212034,500, 1, 1),
Array(1222034,500, 1, 1),
Array(1462152,500, 1, 1),
Array(1382158,500, 1, 1),
Array(1232034,500, 1, 1),
Array(1422102,500, 1, 1),
Array(1402142,500, 1, 1),
Array(1482135,500, 1, 1),
Array(1482165,500, 1, 1),
Array(1342064,500, 1, 1),
Array(1472174,500, 1, 1),
Array(1252019,500, 1, 1),
Array(1312110,500, 1, 1),
Array(1412099,500, 1, 1),
Array(1332184,500, 1, 1),
Array(1003443,500, 1, 1),
Array(1003445,500, 1, 1),
Array(1003444,500, 1, 1),
Array(1003447,500, 1, 1),
Array(1003446,500, 1, 1),
Array(1072641,500, 1, 1),
Array(1072643,500, 1, 1),
Array(1072642,500, 1, 1),
Array(1072645,500, 1, 1),
Array(1072644,500, 1, 1),
Array(1052134,500, 1, 1),
Array(1052075,500, 1, 1),
Array(1052072,500, 1, 1),
Array(1082167,500, 1, 1),
Array(1002339,500, 1, 1),
Array(1052071,500, 1, 1),
Array(1102283,500, 1, 1),
Array(1102448,500, 1, 1),
Array(1082303,500, 1, 1),
Array(1082469,500, 1, 1),
Array(1052322,500, 1, 1),
Array(1052501,500, 1, 1),
Array(1362068,500, 1, 1),
Array(1472155,500, 1, 1),
Array(1472123,500, 1, 1),
Array(1332194,500, 1, 1),
Array(1332131,500, 1, 1),
Array(1003592,500, 1, 1),
Array(1003155,500, 1, 1),
Array(1072493,500, 1, 1),
Array(1072706,500, 1, 1),
Array(1102284,500, 1, 1),
Array(1102449,500, 1, 1),
Array(1082470,500, 1, 1),
Array(1082304,500, 1, 1),
Array(1052323,500, 1, 1),
Array(1052502,500, 1, 1),
Array(1532075,500, 1, 1),
Array(1532017,500, 1, 1),
Array(1242013,500, 1, 1),
Array(1242046,500, 1, 1),
Array(1492153,500, 1, 1),
Array(1492086,500, 1, 1),
Array(1222013,500, 1, 1),
Array(1222043,500, 1, 1),
Array(1482085,500, 1, 1),
Array(1482141,500, 1, 1),
Array(1003593,500, 1, 1),
Array(1003181,500, 1, 1),
Array(1072494,500, 1, 1),
Array(1072707,500, 1, 1),
Array(1102282,500, 1, 1),
Array(1102447,500, 1, 1),
Array(1082302,500, 1, 1),
Array(1082468,500, 1, 1),
Array(1052321,500, 1, 1),
Array(1052500,500, 1, 1),
Array(1452112,500, 1, 1),
Array(1452171,500, 1, 1),
Array(1522072,500, 1, 1),
Array(1462100,500, 1, 1),
Array(1462160,500, 1, 1),
Array(1003591,500, 1, 1),
Array(1003179,500, 1, 1),
Array(1072492,500, 1, 1),
Array(1072705,500, 1, 1),
Array(1102281,500, 1, 1),
Array(1102446,500, 1, 1),
Array(1082301,500, 1, 1),
Array(1082467,500, 1, 1),
Array(1052499,500, 1, 1),
Array(1052320,500, 1, 1),
Array(1372140,500, 1, 1),
Array(1212013,500, 1, 1),
Array(1212043,500, 1, 1),
Array(1372085,500, 1, 1),
Array(1382169,500, 1, 1),
Array(1382105,500, 1, 1),
Array(1252013,500, 1, 1),
Array(1252030,500, 1, 1),
Array(1003590,500, 1, 1),
Array(1003178,500, 1, 1),
Array(1072491,500, 1, 1),
Array(1072704,500, 1, 1),
Array(1102255,500, 1, 1),
Array(1102445,500, 1, 1),
Array(1082300,500, 1, 1),
Array(1082466,500, 1, 1),
Array(1052498,500, 1, 1),
Array(1052319,500, 1, 1),
Array(1302228,500, 1, 1),
Array(1442183,500, 1, 1),
Array(1302153,500, 1, 1),
Array(1442117,500, 1, 1),
Array(1432087,500, 1, 1),
Array(1432139,500, 1, 1),
Array(1322163,500, 1, 1),
Array(1322097,500, 1, 1),
Array(1232013,500, 1, 1),
Array(1232040,500, 1, 1),
Array(1422067,500, 1, 1),
Array(1422108,500, 1, 1),
Array(1402152,500, 1, 1),
Array(1312066,500, 1, 1),
Array(1312117,500, 1, 1),
Array(1412066,500, 1, 1),
Array(1402096,500, 1, 1),
Array(1412105,500, 1, 1),
Array(1003589,500, 1, 1),
Array(1003177,500, 1, 1),
Array(1072490,500, 1, 1),
Array(1072703,500, 1, 1),
Array(1082163,500, 1, 1),
Array(1002547,500, 1, 1),
Array(1072269,500, 1, 1),
Array(1082164,500, 1, 1),
Array(1072268,500, 1, 1),
Array(1082168,500, 1, 1),
Array(1052076,500, 1, 1),
Array(1092060,500, 1, 1),
Array(1072273,500, 1, 1),
Array(1412126,500, 1, 1),
Array(1532089,500, 1, 1),
Array(1472205,500, 1, 1),
Array(1452196,500, 1, 1),
Array(1362081,500, 1, 1),
Array(1242069,500, 1, 1),
Array(1242070,500, 1, 1),
Array(1432158,500, 1, 1),
Array(1492170,500, 1, 1),
Array(1322100,500, 1, 1),
Array(1522085,500, 1, 1),
Array(1372168,500, 1, 1),
Array(1212072,500, 1, 1),
Array(1222067,500, 1, 1),
Array(1462184,500, 1, 1),
Array(1442209,500, 1, 1),
Array(1382199,500, 1, 1),
Array(1232064,500, 1, 1),
Array(1422129,500, 1, 1),
Array(1332214,500, 1, 1),
Array(1402185,500, 1, 1),
Array(1482159,500, 1, 1),
Array(1342079,500, 1, 1),
Array(1252062,500, 1, 1),
Array(1312142,500, 1, 1),
Array(1302070,500, 1, 1),
Array(1003797,100,1,3), //高贵战士头盔 - (无描述)
Array(1003798,100,1,3), //高贵流丹维奇帽 - (无描述)
Array(1003799,100,1,3), //高贵游侠贝雷帽 - (无描述)
Array(1003800,100,1,3), //高贵刺客软帽 - (无描述)
Array(1003801,100,1,3), //高贵流浪者帽 - (无描述)
Array(1042254,100,1,3), //鹰眼战士盔甲 - (无描述)
Array(1042255,100,1,3), //鹰眼丹维奇长袍 - (无描述)
Array(1042256,100,1,3), //鹰眼游侠斗篷 - (无描述)
Array(1042257,100,1,3), //鹰眼刺客衬衣 - (无描述)
Array(1042258,100,1,3), //鹰眼流浪者外衣 - (无描述)
Array(1062165,100,1,3), //魔术师战士短裤 - (无描述)
Array(1062166,100,1,3), //魔术师丹维奇短裤 - (无描述)
Array(1062167,100,1,3), //魔术师游侠短裤 - (无描述)
Array(1062168,100,1,3), //魔术师刺客短裤 - (无描述)
Array(1062169,100,1,3),  //魔术师流浪者短裤 - (无描述)
Array(2432069, 5,1,3),
Array(1102481, 5, 1, 3), // 暴君西亚戴斯披风 // (无描述)
Array(1102482, 5, 1, 3), // 暴君赫尔梅斯披风 // (无描述)
Array(1102483, 5, 1, 3), // 暴君凯伦披风 // (无描述)
Array(1102484, 5, 1, 3), // 暴君利卡昂披风 // (无描述)
Array(1102485, 5, 1, 3), // 暴君阿尔泰披风 // (无描述)
Array(1072743, 5, 1, 3), // 暴君西亚戴斯靴 // (无描述)
Array(1072744, 5, 1, 3), // 暴君赫尔梅斯靴 // (无描述)
Array(1072745, 5, 1, 3), // 暴君凯伦靴 // (无描述)
Array(1072746, 5, 1, 3), // 暴君利卡昂靴 // (无描述)
Array(1072747, 5, 1, 3), // 暴君阿尔泰靴 // (无描述)
Array(1132174, 5, 1, 3), // 暴君西亚戴斯腰带 // (无描述)
Array(1132175, 5, 1, 3), // 暴君赫尔梅斯腰带 // (无描述)
Array(1132176, 5, 1, 3), // 暴君凯伦腰带 // (无描述)
Array(1132177, 5, 1, 3),// 暴君利卡昂腰带 // (无描述)
Array(1132178, 5, 1, 3),// 暴君阿尔泰腰带 // (无描述)
/*极真装备*/
Array(1102471, 55,1,3), // 赫里希安精锐战士披风 // (无描述)
Array(1102472, 55,1,3), // 赫里希安精锐法师披风 // (无描述)
Array(1102473, 55,1,3), // 赫里希安精锐弓箭手披风 // (无描述)
Array(1102474, 55,1,3), // 赫里希安精锐飞侠披风 // (无描述)
Array(1102475, 55,1,3), // 赫里希安精锐海盗披风 // (无描述)
Array(1072732, 55,1,3), // 赫里希安精锐战士靴 // (无描述)
Array(1072733, 55,1,3), // 赫里希安精锐法师靴 // (无描述)
Array(1072734, 55,1,3), // 赫里希安精锐弓箭手靴 // (无描述)
Array(1072735, 55,1,3), // 赫里希安精锐飞侠靴 // (无描述)
Array(1072736, 55,1,3), // 赫里希安精锐海盗靴 // (无描述)
Array(1132164, 55,1,3), // 赫里希安精锐战士腰带 // (无描述)
Array(1132165, 55,1,3), // 赫里希安精锐法师腰带 // (无描述)
Array(1132166, 55,1,3), // 赫里希安精锐弓箭手腰带 // (无描述)
Array(1132167, 55,1,3), // 赫里希安精锐飞侠腰带 // (无描述)
Array(1132168, 55,1,3), // 赫里希安精锐海盗腰带 // (无描述)
Array(1102476, 20,1,3), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 20,1,3), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 20,1,3), // 诺巴凯伦披风 // (无描述)
Array(1102479, 20,1,3), // 诺巴利卡昂披风 // (无描述)
Array(1102455, 20,1,3), // 诺巴阿尔泰披风 // (无描述)
Array(1072737, 20,1,3), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 20,1,3), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 20,1,3), // 诺巴凯伦靴 // (无描述)
Array(1072740, 20,1,3), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 20,1,3), // 诺巴阿尔泰靴 // (无描述)
Array(1132169, 20,1,3), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 20,1,3), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 20,1,3), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 20,1,3), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 20,1,3), // 诺巴阿尔泰腰带 // (无描述)
/*160装备*/
Array(1012438, 20, 1, 3),
Array(1022211, 20, 1, 3),
Array(1032224, 20, 1, 3),
Array(1122269, 20, 1, 3),
Array(1132247, 20, 1, 3),
Array(1152160, 20, 1, 3),
Array(1003976, 20, 1, 3),
Array(1102623, 20, 1, 3),
Array(1082556, 20, 1, 3),
Array(1052669, 20, 1, 3),
Array(1072870, 20, 1, 3),
Array(1212089, 20, 1, 3),
Array(1222084, 20, 1, 3),
Array(1232084, 20, 1, 3),
Array(1242090, 20, 1, 3),
Array(1302297, 20, 1, 3),
Array(1312173, 20, 1, 3),
Array(1322223, 20, 1, 3),
Array(1332247, 20, 1, 3),
Array(1342090, 20, 1, 3),
Array(1362109, 20, 1, 3),
Array(1382231, 20, 1, 3),
Array(1402220, 20, 1, 3),
Array(1412153, 20, 1, 3),
Array(1422158, 20, 1, 3),
Array(1432187, 20, 1, 3),
Array(1432187, 20, 1, 3),
Array(1452226, 20, 1, 3),
Array(1462213, 20, 1, 3),
Array(1472235, 20, 1, 3),
Array(1482189, 20, 1, 3),
Array(1492199, 20, 1, 3),
Array(1522113, 20, 1, 3),
Array(1532118, 20, 1, 3)
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;

    }
    if (status == 0) {
       var text = head+"收集666个#v4000313##b#t4000313##k就可以在我这里进行一次抽奖哦！有大量120-160装备等你来拿~还有魔方、无损强化卷、S潜能卷轴！#b而且必然获得1-3个高级魔方。#k\r\n";
	   text +="\t#d#e- 当前拥有："+cm.getItemQuantity(4000313)+"个#b#t4000313##n#k\r\n";
	   text += "#L1#"+icon+" 如何获得黄金枫叶？#l\r\n";
	   text += "#L0#"+icon+" 开始抽奖#l\r\n";
	   cm.sendSimple(text);
    } else if (status == 1) {
		if (selection == 1) {
			cm.sendSimple("目前黄金枫叶可以通过击杀野怪有几率获得，通关#b玩具城组队任务#k或者完成#b活跃任务#k，领取活跃礼包，参与#b小游戏#k或者使用点卷在游戏宝库中购买。");
			status = -1;
		} else {
			if (!cm.haveItem(4000313,666)) {
				cm.sendOk("你好像没有这么多黄金枫叶！");
				cm.dispose();
				return;
			}
			if (cm.getPlayer().getTodayOnlineTime() < 30) {
				cm.sendOk("在线30分钟才可以进行抽奖。");
				cm.dispose();
				return;
			}
			var chance =Math.floor(Math.random() * 300);
			var finalitem = Array();
			for (var i = 0; i < itemList.length; i++) {
				if (itemList[i][1] >= chance) {
					finalitem.push(itemList[i]);
				}
			}
			if (finalitem.length != 0) {
				
				var item;
				var random = new java.util.Random();
				var finalchance = random.nextInt(finalitem.length);
				var itemId = finalitem[finalchance][0];
				var quantity = finalitem[finalchance][2];
				var notice = finalitem[finalchance][3];
				/*
				if (cm.getPlayer().getName() == "熊熊酱") {
					cm.setBossLog("枫叶抽奖");
					if (cm.getBossLog("枫叶抽奖")==30) {
						itemId = 1072741;
						notice = 3;
					}
				}*/
				item = cm.gainGachaponItem(itemId, quantity, "转盘转转转！", notice);
				if (item != -1) {
					cm.gainItem(4000313, -666);
					var mfq = Math.floor(Math.random()*3+1);
					cm.gainItem(5062002, mfq);
					cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个以及#b#t5062002##k "+mfq+"个。");
					//cm.gainItem(4000313,666);
					//cm.gainItem(itemId, -1);
				} else {
					cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
				}
				cm.safeDispose();
			} else {
				cm.sendOk("今天的运气可真差，什么都没有拿到。");
				cm.safeDispose();
			}
		}
	}
}