var a = 0;
var text;
var selects; //记录玩家的选项
var buynum = 0;
var itemlist = Array(
Array(1672039, 68),
Array(1112793, 20),
Array(1022148, 28),//  这个是眼饰的 
Array(1012319, 18), // 这个是脸饰的
Array(1112918, 18, 7),
Array(2431944, 15),
Array(2431945, 10),
Array(2431938, 198),
//Array(2070019, 20),
Array(1132246, 128),
Array(1122267, 128),
Array(1032223, 128),
Array(1113075, 128),
Array(1122122, 268),
Array(1122123, 268),
Array(1122124, 268),// -
Array(1122125, 268),//  - 
Array(1122126, 268),//  -
Array(1102471, 80), // 赫里希安精锐战士披风 // (无描述)
Array(1102472, 80), // 赫里希安精锐法师披风 // (无描述)
Array(1102473, 80), // 赫里希安精锐弓箭手披风 // (无描述)
Array(1102474, 80), // 赫里希安精锐飞侠披风 // (无描述)
Array(1102475, 80), // 赫里希安精锐海盗披风 // (无描述)
Array(1072732, 80), // 赫里希安精锐战士靴 // (无描述)
Array(1072733, 80), // 赫里希安精锐法师靴 // (无描述)
Array(1072734, 80), // 赫里希安精锐弓箭手靴 // (无描述)
Array(1072735, 80), // 赫里希安精锐飞侠靴 // (无描述)
Array(1072736, 80), // 赫里希安精锐海盗靴 // (无描述)
Array(1132164, 80), // 赫里希安精锐战士腰带 // (无描述)
Array(1132165, 80), // 赫里希安精锐法师腰带 // (无描述)
Array(1132166, 80), // 赫里希安精锐弓箭手腰带 // (无描述)
Array(1132167, 80), // 赫里希安精锐飞侠腰带 // (无描述)
Array(1132168, 80), // 赫里希安精锐海盗腰带 // (无描述)

Array(1102476, 199), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 199), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 199), // 诺巴凯伦披风 // (无描述)
Array(1102479, 199), // 诺巴利卡昂披风 // (无描述)
Array(1102480, 199), // 诺巴阿尔泰披风 // (无描述)
Array(1072737, 199), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 199), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 199), // 诺巴凯伦靴 // (无描述)
Array(1072740, 199), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 199), // 诺巴阿尔泰靴 // (无描述)
Array(1132169, 199), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 199), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 199), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 199), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 199), // 诺巴阿尔泰腰带 // (无描述)
/*
Array(1102481, 298), // 暴君西亚戴斯披风 // (无描述)
Array(1102482, 298), // 暴君赫尔梅斯披风 // (无描述)
Array(1102483, 298), // 暴君凯伦披风 // (无描述)
Array(1102484, 298), // 暴君利卡昂披风 // (无描述)
Array(1102485, 298), // 暴君阿尔泰披风 // (无描述)
Array(1072743, 298), // 暴君西亚戴斯靴 // (无描述)
Array(1072744, 298), // 暴君赫尔梅斯靴 // (无描述)
Array(1072745, 298), // 暴君凯伦靴 // (无描述)
Array(1072746, 298), // 暴君利卡昂靴 // (无描述)
Array(1072747, 298), // 暴君阿尔泰靴 // (无描述)
Array(1132174, 298), // 暴君西亚戴斯腰带 // (无描述)
Array(1132175, 298), // 暴君赫尔梅斯腰带 // (无描述)
Array(1132176, 298), // 暴君凯伦腰带 // (无描述)
Array(1132177, 298),// 暴君利卡昂腰带 // (无描述)
Array(1132178, 298),// 暴君阿尔泰腰带 // (无描述)
Array(1212089,1),
//漩涡双头杖
Array(1222084,1),
//漩涡灵魂手铳
Array(1232084,1),
//漩涡恶魔剑
Array(1242090,1),
//漩涡锁链剑
Array(1302297,1),
//漩涡剑
Array(1312173,1),
//漩涡斧
Array(1322223,1),
//漩涡锤
Array(1332247,1),
//漩涡匕首
Array(1342090,1),
//漩涡刀
Array(1362109,1),
//漩涡手杖
Array(1372195,1),
//漩涡短杖
Array(1382231,1),
//漩涡长杖
Array(1402220,1),
//漩涡双手剑
Array(1412152,1),
//漩涡双手战斧
Array(1422158,1),
//漩涡巨锤
Array(1432187,1),
//漩涡矛
Array(1442242,1),
//漩涡戟
Array(1452226,1),
//漩涡弓
Array(1462213,1),
//漩涡弩
Array(1472235,1),
//漩涡拳甲
Array(1482189,1),
//漩涡冲拳
Array(1492199,1),
//漩涡手铳
Array(1522113,1),
//漩涡双翼短杖
Array(1532118,1),
//漩涡手炮
Array(1252033,1),
//漩涡虎梳魔法棒
Array(1003976,1),
Array(1102623,1),
Array(1082556,1),
Array(1052669,1),
Array(1072870,1),
Array(2610001,1),
//★===================找到的项目===================★
        
Array(1012438,1),
//装备名称：漩涡文身

//★===================找到的项目===================★
        
Array(1022211,1),
//装备名称：漩涡眼镜

//★===================找到的项目===================★
        
Array(1032224,1),
//装备名称：漩涡耳环

//★===================找到的项目===================★
        
Array(1122269,1),
//装备名称：漩涡吊坠

//★===================找到的项目===================★
        
Array(1132247,1),
//装备名称：漩涡腰带
//
///★===================找到的项目===================★
        
Array(1152160,1),
//装备名称：漩涡护肩
*/
Array(1142210, 60),//  - 
Array(1142178, 60),//  -
Array(3994417,128),// - 红色蜡笔 - 红色蜡笔。
Array(3994418,228),// - 橙色蜡笔 - 橙色蜡笔。
Array(3994419,288),// - 黄色蜡笔 - 黄色蜡笔。
Array(3994420,328),// - 绿色蜡笔 - 绿色蜡笔。
Array(3994421,388),// - 青色蜡笔 - 青色蜡笔。
Array(3994422,488)// - 蓝色蜡笔 - 蓝色蜡笔。Array(3994423,260)// - 紫色蜡笔 - 紫色蜡笔。 */
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
		cm.sendOk("好吧，等你考虑清楚了再来找我。");
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			text = "#h0#,您可以在这里兑换#e#b上乘装备#n#k,请选择你想要购买的物品\r\n#b";
			for (var i=0; i<itemlist.length; i++) {
				var validtime = "";
				if (itemlist[i][2]!=null) {
					validtime="/ #e"+itemlist[i][2]+"天权#n";
				}
				text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# "+validtime+" - #r"+itemlist[i][1]+"#b雪花币  \r\n";
				if (i != 0 && (i+1) % 5 == 0) {
					text += "\r\n";
				}
			}
            cm.sendSimple(text);
			/*
        } else if (a == 1) {
			selects = selection;
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r1个需要" + itemlist[selects][1] + "个#b雪花币#k", 0, 0, 999999);*/
        } else if (a == 1) {
            selects = selection;
			buynum = 1;
            cm.sendYesNo("你想购买" + buynum + "个#r#i" + itemlist[selects][0] + "##k？\r\n你将使用掉" + (buynum * itemlist[selects][1]) + "雪花币。\r\n#e#r雪花币不足支付时，将会用国庆币补足剩余部分。#n#k");
        } else if (a == 2) {
			var itemid = itemlist[selects][0];
			if (cm.getSpace(Math.floor(itemid/1000000))<=2) {
				cm.sendOk("您的背包空间不足，请整理后再购买。");
				cm.dispose();
				return; 
			}
            var quantity = buynum * itemlist[selects][1];
			var _q = getNeeds(quantity);
            if (canBuy(_q)) {
                pay(_q);
				if (itemlist[selects][2]!=null) {
					cm.gainItem(itemlist[selects][0], buynum, itemlist[selects][2]);	
				} else {
                	cm.gainItem(itemlist[selects][0], buynum);
				}
				cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的雪花币或者国庆纪念币。");
                cm.dispose();
            }
        }
    }//mode
}//f

function getNeeds(quantity) {
	var _xq = quantity;
	var _gq = 0;
	if (!cm.haveItem(4310014, quantity)) {
		_xq = cm.getItemQuantity(4310014);
		_gq = quantity-_xq;
	}
	return Array(_xq, _gq);
}
function pay(q) {
	if (q[0]>0)
		cm.gainItem(4310014, -q[0])
	if (q[1]>0)
		cm.gainItem(4000463, -q[1]);
}
function canBuy(q) {
	if (cm.haveItem(4000463, q[1]))
		return true;
	else
		return false;
}