var status = -1;

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(5220040)) { //快乐百宝券
            cm.sendYesNo("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5220040##k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。 假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么?  ");
        } else {
            cm.sendOk("你背包里有#b#t5220040##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var item;
        if (Math.floor(Math.random() * 300) == 0) {
            item = cm.gainGachaponItem(1102042, 1);
        } else {
            var itemList = new Array(
            2040000, //头盔防御卷轴100%
            2040001, //头盔防御卷轴60% 
            2040002, //头盔防御卷轴10% 
            2040003, //头盔体力卷轴 
            2040004, //头盔体力卷轴60% 
            2040005, //头盔体力卷轴10%
            2040008, //头盔防御诅咒卷轴%70 %50失败
            2040009, //头盔防御诅咒卷轴%30 %50失败
            2040010, //头盔体力诅咒卷轴
            2040011, //头盔体力诅咒卷轴
            2040012, //头盔智力卷轴
            2040013, //头盔智力卷轴
            2040014, //头盔命中率诅咒卷轴70%
            2040015, //头盔命中率诅咒卷轴30%
            2040016, //头盔命中率卷轴10%
            2040017, //头盔命中率卷轴60%
            2040018, //头盔命中率卷轴100%
            2040019, //头盔防御卷轴65%
            2040020, //头盔防御卷轴15%
            2040021, //头盔体力卷轴65%
            2040022, //头盔体力卷轴15%
            2040024, //头盔智力卷轴100%
            2040025, //头盔智力卷轴60%
            2040026, //头盔智力卷轴10%
            2040027, //头盔敏捷卷轴100%
            2040028, //头盔敏捷卷轴
            2040029, //头盔敏捷卷轴60%
            2040030, //头盔敏捷卷轴%30
            2040031, //头盔敏捷卷轴10% 
            2040043, //头盔敏捷卷轴65%
            2040044, //头盔敏捷卷轴15%
            2040100, //脸部装饰生命卷轴10%
            2040101, //脸部装饰生命卷轴60%
            2040103, //脸部装饰生命诅咒卷轴30%
            2040104, //脸部装饰生命诅咒卷轴70%
            2040105, //脸部装饰回避率卷轴10%
            2040106, //脸部装饰回避率卷轴60%
            2040108, //脸部装饰回避率诅咒卷轴30%
            2040109, //脸部装饰回避率诅咒卷轴70%
            2040200, //眼部装饰命中率卷轴10%
            2040201, //眼部装饰命中率卷轴60% 
            2040203, //眼部装饰命中率诅咒卷轴30%
            2040204, //眼部装饰命中率诅咒卷轴70%
            2040205, //眼部装饰智力卷轴10%
            2040206, //眼部装饰智力卷轴60%
            2040208, //眼部装饰智力诅咒卷轴30%
            2040209, //眼部装饰智力诅咒卷轴70%
            2040233, //眼饰力量卷轴,  //为眼饰增加力量属性。\n成功率：60%，力量+2
            2040234, //眼饰敏捷卷轴,  //为眼饰增加敏捷属性。\n成功率：60%，敏捷+2
            2040235, //眼饰智力卷轴,  //为眼饰增加智力属性。\n成功率：60%，智力+2
            2040236, //眼饰运气卷轴,  //为眼饰增加运气属性。\n成功率：60%，运气+2
            2040300, //耳环智力卷轴,  //成功率100%，魔法攻击力+1.
            2040301, //耳环智力卷轴60%,  //成功率60%，魔法攻击力+2，智力+1.
            2040302, //耳环智力卷轴10%
            2040304, //耳环智力诅咒卷轴,  //成功率70%，魔法攻击力+2，智力+1\n但失败时50%的比率道具消失
            2040305, //耳环智力诅咒卷轴%30
            2040306, //耳环敏捷卷轴,  //成功率70%，敏捷+2\n但失败时50%的比率道具消失
            2040307, //耳环敏捷卷轴,  //成功率30%，敏捷+3\n但失败时50%的比率道具消失
            2040308, //耳环防御力诅咒卷轴70%
            2040309, //耳环防御力诅咒卷轴30%
            2040310, //耳环防御力卷轴10%,  //成功率10%、物理防御力+3、魔法防御力+3、命中率+1。
            2040311, //耳环防御力卷轴60%,  //成功率60%、物理防御力+1、魔法防御力+1。
            2040312, //耳环防御力卷轴100%,  //成功率100%、物理防御力+1。
            2040313, //耳环智力卷轴65%,  
            2040314, //耳环智力卷轴15%
            2040316, //耳环敏捷卷轴,  //耳朵装饰中增加敏捷性上升选项。\n成功率:100%, 敏捷+1
            2040317, //耳环敏捷卷轴60%,  //耳朵装饰中增加敏捷性上升选项。\n成功率:60%, 敏捷+2
            2040318, //耳环敏捷卷轴10%,  //耳朵装饰中增加敏捷性上升选项。\n成功率:10%, 敏捷+3
            2040319, //耳环装饰运气卷轴,  //给耳环装饰增加运气.\n成功率:100%, 运气+1
            2040320, //耳环运气卷轴,  
            2040321, //耳环装饰运气卷轴60%,  //给耳环装饰增加运气.\n成功率:60%, 运气+2
            2040322, //耳环装饰运气卷轴,  
            2040323, //耳环运气卷轴10%,  //给耳朵装饰增加运气.\n成功率:10%, 运气+3
            2040324, //耳环装饰体力卷轴 ,  //为耳饰增加体力属性。\n成功率：100%，最大HP+20
            2040325, //耳环装饰体力卷轴 ,  
            2040326, //耳环装饰体力卷轴60%,  //为耳饰增加体力属性。\n成功率：60%，最大HP+60
            2040327, //耳环装饰体力卷轴 ,  
            2040328, //耳环装饰体力卷轴10%,  //为耳饰增加体力属性。\n成功率：10%，最大HP+120
            2040329, //耳环敏捷卷轴,  //为耳环增加敏捷属性。\n成功率：10%，敏捷+3
            2040330, //耳环智力卷轴,  
            2040331, //耳环运气卷轴,  //为耳环增加运气属性。n成功率：10%，运气+3
            2040335, //耳环装饰敏捷卷轴65%,  //提高耳朵装饰品敏捷.\n成功率:65%, 敏捷+2
            2040336, //耳环装饰敏捷卷轴15%,  //提高耳朵装饰品敏捷.\n成功率:15%, 敏捷+3
            2040337, //耳环装饰运气卷轴65%,  //提高耳朵装饰品运气.\n成功率:65%, 运气+2
            2040338, //耳环装饰运气卷轴15%,  //提高耳朵装饰品运气.\n成功率:15%, 运气+3
            2040339, //耳环装饰体力卷轴65%,  //为耳饰增加体力属性。\n成功率：65%，最大HP+60
            2040340, //耳环装饰体力卷轴15%,  //为耳饰增加体力属性。\n成功率：15%，最大HP+120
            2040400, //上衣防御卷轴,  //为上衣增加物理防御力属性。\n成功率：100%，物理防御力+10
            2040401, //上衣防御卷轴60%,  
            2040402, //上衣防御卷轴10%,  
            2040403, //上衣防御必成卷,  
            2040404, //上衣防御诅咒卷轴,  
            2040405, //上衣防御诅咒卷轴,  
            2040406, //上衣力量卷轴,  //成功率70%，力量+2\n但失败时50%的比率道具消失
            2040407, //上衣力量卷轴,  //成功率30%，力量+3\n但失败时50%的比率道具消失
            2040408, //上衣体力卷轴,  
            2040409, //上衣体力卷轴,  
            2040410, //上衣运气诅咒卷轴70%,  
            2040411, //上衣运气诅咒卷轴30%,  
            2040412, //上衣运气卷轴10%,  //成功率10%、运气+3、回避率+3。
            2040413, //上衣运气卷轴60%,  //成功率60%、运气+2、回避率+1。
            2040414, //上衣运气卷轴100%,  //成功率100%、运气+1。
            2040415, //上衣防御力卷轴65%,  
            2040416, //上衣防御力卷轴15%,  
            2040417, //上衣力量卷轴,  //上衣中增加力量上升选项。\n成功率 100%, 力量+1
            2040418, //上衣力量卷轴60%,  //上衣中增加力量上升选项。\n成功率 60%, 力量+2
            2040419, //上衣力量卷轴10%,  //上衣中增加力量上升选项。\n成功率 10%, 力量+3
            2040420, //上衣体力卷轴,  //为上衣增加体力属性。\n成功率：100%，最大HP+ 20
            2040421, //上衣体力卷轴60%,  //为上衣增加体力属性。\n成功率：60%，最大HP+ 60
            2040422, //上衣体力卷轴10%,  //为上衣增加体力属性。\n成功率：10%，最大HP+ 120
            2040423, //上衣运气卷轴,  //给上衣增加运气.\n成功率:100%, 运气+1
            2040424, //上衣运气卷轴,  
            2040425, //上衣运气卷轴60%,  //给上衣增加运气.\n成功率:60%, 运气+2
            2040426, //上衣运气卷轴,  
            2040427, //上衣运气卷轴10%,  //给上衣增加运气.\n成功率:10%, 运气+3
            2040431, //上衣力量卷轴65%,  //提高上衣的力量.\n成功率 65%, 力量+2
            2040432, //上衣力量卷轴15%,  //提高上衣的力量.\n成功率 15%, 力量+3
            2040433, //上衣体力卷轴65%,  //为上衣增加体力属性。\n成功率：65%，最大HP+ 60
            2040434, //上衣体力卷轴15%,  //为上衣增加体力属性。\n成功率：15%，最大HP+ 120
            2040435, //上衣运气卷轴65%,  //提高上衣的运气.\n成功率:65%, 运气+2
            2040436, //上衣运气卷轴15%,  //提高上衣的运气.\n成功率:15%, 运气+3
            2040500, //全身铠甲敏捷卷轴,  //成功率100%，敏捷+1.
            2040501, //全身铠甲敏捷卷轴60%,  
            2040502, //全身铠甲敏捷卷轴10%,  
            2040503, //全身铠甲防御卷轴,  
            2040504, //全身铠甲防御卷轴60%
            2040505, //全身铠甲防御卷轴10%
            2040508, //全身铠甲敏捷诅咒卷轴%70
            2040509, //全身铠甲敏捷诅咒卷轴%30
            2040510, //全身铠甲防御诅咒卷轴%70
            2040511, //全身铠甲防御诅咒卷轴%30
            2040512, //全身铠甲智力卷轴,  //成功率100%，智力+1
            2040513, //全身铠甲智力卷轴60%
            2040514, //全身铠甲智力卷轴10%
            2040515, //全身铠甲运气卷轴,  //成功率100%，运气+1
            2040516, //全身铠甲运气卷轴60%,  
            2040517, //全身铠甲运气卷轴10%
            2040518, //全身盔甲智力卷轴%70
            2040519, //全身盔甲智力卷轴%30
            2040520, //全身盔甲幸运卷轴%70
            2040521, //全身盔甲幸运卷轴%30
            2040522, //全身盔甲敏捷卷轴65%,  
            2040523, //全身盔甲敏捷卷轴15%
            2040524, //全身盔甲防御卷轴65%
            2040525, //全身盔甲防御卷轴15%
            2040526, //全身盔甲智力卷轴65%
            2040527, //全身盔甲智力卷轴15%
            2040528, //全身盔甲幸运卷轴65%,  
            2040529, //全身盔甲幸运卷轴15%
            2040530, //全身盔甲力量卷轴,  //给全身盔甲增加力量.\n成功率:100%, 力量+1
            2040531, //全身盔甲力量卷轴%70
            2040532, //全身盔甲力量卷轴60%
            2040533, //全身盔甲力量卷轴%30
            2040534, //全身盔甲力量卷轴10%
            2040540, //全身盔甲力量卷轴65%
            2040541, //全身盔甲力量卷轴15%
            2040600, //裤/裙防御卷轴,  //为裙裤增加物理防御力属性。\n成功率：100%，物理防御力+10
            2040601, //裤/裙防御卷轴60%
            2040602, //裤/裙防御卷轴10%%10
            2040604, //裤/裙防御诅咒卷轴%70
            2040605, //裤/裙防御诅咒卷轴%30
            2040606, //裤裙跳跃诅咒卷轴%70
            2040607, //裤裙跳跃诅咒卷轴%30
            2040608, //裤裙体力诅咒卷轴%70
            2040609, //裤裙体力诅咒卷轴%30
            2040610, //裤裙敏捷诅咒卷轴70%
            2040611, //裤裙敏捷诅咒卷轴30%
            2040612, //裤裙敏捷卷轴10%,  //成功率10%、敏捷+3、移动速度+3。
            2040613, //裤裙敏捷卷轴60%,  //成功率60%、敏捷+2、移动速度+1。
            2040614, //裤裙敏捷卷轴100%,  //成功率100%、敏捷+1。
            2040615, //裤裙防御卷轴65%
            2040616, //裤裙防御卷轴15%
            2040617, //裤裙跳跃卷轴,  //裤裙中增加弹跳上升选项。\n成功率:100%, 弹跳+1
            2040618, //裤裙跳跃卷轴60%,  //为裙裤增加跳跃力属性。\n成功率：60%，跳跃力+2，回避值+20
            2040619, //裤裙跳跃卷轴10%,  //为裙裤增加跳跃力属性。\n成功率：10%，跳跃力+4，回避值+40
            2040620, //裤裙体力卷轴,  //为裙裤增加体力属性。\n成功率：100%，最大HP+20
            2040621, //裤裙体力卷轴60%,  //为裙裤增加体力属性。\n成功率：60%，最大HP+60
            2040622, //裤裙体力卷轴10%,  //为裙裤增加体力属性。\n成功率：10%，最大HP+120
            2040623, //裤裙敏捷卷轴,  //给裤裙增加敏捷度.\n成功率:100%, 敏捷+1
            2040624, //裤裙敏捷卷轴%70 %50失败
            2040625, //裤裙敏捷卷轴60%,  //为裙裤增加敏捷属性。\n成功率：60%，敏捷+2，命中值+20
            2040626, //裤裙敏捷卷轴%30 %50失败
            2040627, //裤裙敏捷卷轴10%
            2040631, //裤裙跳跃卷轴65%,  //为裙裤增加跳跃力属性。\n成功率：65%，跳跃力+2，回避值+20
            2040632, //裤裙跳跃卷轴15%,  //为裙裤增加跳跃力属性。\n成功率：15%，跳跃力+4，回避值+40
            2040633, //裤裙体力卷轴65%,  //为裙裤增加体力属性。\n成功率：65%，最大HP+60
            2040634, //裤裙体力卷轴15%,  //为裙裤增加体力属性。\n成功率：15%，最大HP+120
            2040635, //裤裙敏捷卷轴65%,  //为裙裤增加敏捷属性。\n成功率：65%，敏捷+2，命中值+20
            2040636, //裤裙敏捷卷轴15%
            2040700, //鞋子敏捷度卷轴,  //为鞋子增加敏捷属性。\n成功率：100%，回避值+20
            2040701, //鞋子敏捷度卷轴60%,  //为鞋子增加敏捷属性。\n成功率：60%，回避值+40，命中值+20
            2040702, //鞋子敏捷度卷轴10%
            2040703, //鞋子跳跃卷轴,  //成功率100%，跳跃力+1.
            2040704, //鞋子跳跃卷轴60%,  //成功率60%，跳跃力+2，敏捷+1.
            2040705, //鞋子跳跃卷轴10%,  //成功率10%，跳跃力+5，敏捷+3，移动速度+1.
            2040706, //鞋子速度卷轴,  //成功率100%，移动速度+1.
            2040707, //鞋子速度卷轴60%,  //成功率60%，移动速度+2.
            2040708, //鞋子速度卷轴10%,  //成功率10%，移动速度+3.
            2040711, //鞋子速度必成卷,  //成功率:100%, 移动速度+3 
            2040712, //鞋子敏捷诅咒卷轴%70
            2040713, //鞋子敏捷诅咒卷轴%30
            2040714, //鞋子跳跃诅咒卷轴,  //成功率70%，跳跃力+2，敏捷+1\n但失败时50%的比率道具消失
            2040715, //鞋子跳跃诅咒卷轴, 
            2040716, //鞋子速度诅咒卷轴,  //成功率70%，移动速度+2\n但失败时50%的比率道具消失
            2040717, //鞋子速度诅咒卷轴,  //成功率30%，移动速度+3\n但失败时50%的比率道具消失
            2040718, //鞋子敏捷卷轴65%,  //为鞋子增加敏捷属性。\n成功率：65%，回避值+40，命中值+20
            2040719, //鞋子敏捷卷轴15%,  
            2040720, //鞋子跳跃卷轴65%,  //用来给鞋子中增加跳跃属性。\n成功率：65%，跳跃力+2，敏捷+1
            2040721, //鞋子跳跃卷轴15%,  
            2040722, //鞋子速度卷轴65%,  //用来给鞋子中增加速度属性。\n成功率：65%，移动速度+2
            2040723, //鞋子速度卷轴15%,  //用来给鞋子中增加速度属性。\n成功率：15%，移动速度+3
            2040727, //鞋子防滑卷轴,  //给鞋子增加防滑功能.\n成功率:10%, 对强化次数没有影响
            2040800, //手套敏捷卷轴,  //为手套增加敏捷属性。\n成功率：100%，命中值+20
            2040801, //手套敏捷卷轴60%,  //为手套增加敏捷属性。\n成功率：60%，命中值+40，敏捷+1
            2040802, //手套敏捷卷轴10%,  
            2040803, //手套攻击卷轴,  //成功率100%，物理攻击力+1.
            2040804, //手套攻击卷轴60%,  //成功率60%，物理攻击力+2.
            2040805, //手套攻击卷轴10%,  //成功率10%，物理攻击力+3.
            2040807, //手套攻击诅咒卷轴,  //成功率100%，物理攻击力+3
            2040808, //手套敏捷诅咒卷轴,  
            2040809, //手套敏捷诅咒卷轴,  
            2040810, //手套攻击诅咒卷轴,  //成功率70%，物理攻击力+2\n但失败时50%的比率道具消失
            2040811, //手套攻击诅咒卷轴,  //成功率30%，物理攻击力+3\n但失败时50%的比率道具消失
            2040812, //手套体力卷轴,  
            2040813, //手套体力卷轴,  
            2040814, //手套魔力诅咒卷轴70%,  
            2040815, //手套魔力诅咒卷轴30%,  
            2040816, //手套魔力卷轴10%,  //成功率10%、魔法攻击力+3、魔法防御力+1。
            2040817, //手套魔力卷轴60%,  //成功率60%、魔法攻击力+1、智力+1。
            2040818, //手套魔力卷轴100%,  //成功率100%、魔法攻击力+1。
            2040819, //手套敏捷卷轴65%,  //为手套增加敏捷属性。\n成功率：65%，命中值+40，敏捷+1
            2040820, //手套敏捷卷轴15%,  
            2040821, //手套攻击卷轴65%,  //用来给手套中增加攻击属性。\n成功率：65%，攻击力+2
            2040822, //手套攻击卷轴15%,  //用来给手套中增加攻击属性。\n成功率：15%，攻击力+3
            2040823, //手套体力卷轴,  //为手套增加体力属性。\n成功率：100%，最大HP+20
            2040824, //手套体力卷轴60%,  //为手套增加体力属性。\n成功率：60%，最大HP+60
            2040825, //手套体力卷轴10%,  //为手套增加体力属性。\n成功率：10%，最大HP+120
            2040826, //手套攻击卷轴,  //为手套增加攻击力属性。\n成功率：60%，物理攻击力+2
            2040831, //手套体力卷轴65%,  //为手套增加体力属性。\n成功率：65%，最大HP+60
            2040832, //手套体力卷轴15%,  //为手套增加体力属性。\n成功率：15%，最大HP+120
            2040845, //手套魔力卷轴,  //提高手套的魔力属性。\n成功率：60%，魔力+2
            2040900, //盾牌防御卷轴,  //为盾牌增加物理防御力属性。\n成功率：100%，物理防御力+10
            2040901, //盾牌防御卷轴60%,  
            2040902, //盾牌防御卷轴10%,  
            2040903, //盾牌防御必成卷,  
            2040904, //盾牌防御诅咒卷轴,  
            2040905, //盾牌防御诅咒卷轴,  
            2040906, //盾牌运气卷轴,  //成功率70%，运气+2\n但失败时50%的比率道具消失
            2040907, //盾牌运气卷轴,  
            2040908, //盾牌体力卷轴,  
            2040909, //盾牌体力卷轴,  
            2040910, //盾牌防御卷轴65%,  
            2040911, //盾牌防御卷轴15%,  
            2040914, //盾牌攻击卷轴60%,  
            2040915, //盾牌攻击卷轴10%,  
            2040916, //盾牌攻击诅咒卷轴70%,
            2040917, //盾牌攻击诅咒卷轴30%
            2040919, //盾牌魔力卷轴60%,  //在盾牌赋予魔力提升属性。\n成功率：60%，魔法攻击力+2、智力+1
            2040920, //盾牌魔力卷轴10%,  //在盾牌赋予魔力提升属性。\n成功率：10%，魔法攻击力+3、智力+2
            2040921, //盾牌魔力诅咒卷轴70%,
            2040922, //盾牌魔力诅咒卷轴30%,
            2040923, //盾牌运气卷轴,  //盾牌中增加运气上升选项。\n成功率:100%, 幸运+1
            2040924, //盾牌运气卷轴60%,  //盾牌中增加运气上升选项。\n成功率:60%, 幸运+2
            2040925, //盾牌运气卷轴10%,  //盾牌中增加运气上升选项。\n成功率:10%, 幸运+3
            2040926, //盾牌体力卷轴,  //为盾牌增加体力属性。\n成功率：100%，最大HP+20
            2040927, //盾牌体力卷轴60%,  //为盾牌增加体力属性。\n成功率：60%，最大HP+60
            2040928, //盾牌体力卷轴10%,  //为盾牌增加体力属性。\n成功率：10%，最大HP+120
            2040929, //盾牌力量卷轴,  //给盾牌增加力量.\n成功率:100%, 力量+1
            2040930, //盾牌力量卷轴,
            2040931, //盾牌力量卷轴60%,  //给盾牌增加力量.\n成功率:60%, 力量+2
            2040932, //盾牌力量卷轴,
            2040933, //盾牌力量卷轴10%,  //给盾牌增加力量.\n成功率:10%, 力量+3
            2040937, //盾牌运气卷轴65%,  //提高盾牌的运气.\n成功率:65%, 运气+2
            2040938, //盾牌运气卷轴15%,  //提高盾牌的运气.\n成功率:15%, 运气+3
            2040939, //盾牌体力卷轴65%,  //为盾牌增加体力属性。\n成功率：65%，最大HP+60
            2040940, //盾牌体力卷轴15%,  //为盾牌增加体力属性。\n成功率：15%，最大HP+120
            2040941, //盾牌力量卷轴65%,  //提高盾牌的力量.\n成功率:65%, 力量+2
            2040942, //盾牌力量卷轴15%,  //提高盾牌的力量.\n成功率:15%, 力量+3
            2041000, //披风魔防卷轴,  //为披风增加魔法防御力属性。\n成功率：100%，魔法防御力+10
            2041001, //披风魔防卷轴60%,
            2041002, //披风魔防卷轴10%,
            2041003, //披风防御卷轴,  //为披风增加物理防御力属性。\n成功率：100%，物理防御力+10
            2041004, //披风防御卷轴60%,
            2041005, //披风防御卷轴10%,
            2041006, //披风体力卷轴,  //为披风增加最大HP属性。\n成功率：100%，最大HP+20
            2041007, //披风体力卷轴60%,  //为披风增加最大HP属性。\n成功率：60%，最大HP+40
            2041008, //披风体力卷轴10%,  //为披风增加最大HP属性。\n成功率：10%，最大HP+80
            2041009, //披风魔力卷轴,  //为披风增加最大MP属性。\n成功率：100%，最大MP+20
            2041010, //披风魔力卷轴60%,  //为披风增加最大MP属性。\n成功率：60%，最大MP+40
            2041011, //披风魔力卷轴10%,  //为披风增加最大MP属性。\n成功率：10%，最大MP+80
            2041012, //披风力量卷轴,  //成功率100%，力量+1
            2041013, //披风力量卷轴60%,  //成功率60%，力量+2
            2041014, //披风力量卷轴10%,  //成功率10%，力量+3
            2041015, //披风智力卷轴,  //成功率100%，智力+1
            2041016, //披风智力卷轴60%,  //成功率60%，智力+2
            2041017, //披风智力卷轴10%,  //成功率10%，智力+3
            2041018, //披风敏捷卷轴,  //成功率100%，敏捷+1
            2041019, //披风敏捷卷轴60%,  //成功率60%，敏捷+2
            2041020, //披风敏捷卷轴10%,  //成功率10%，敏捷+3
            2041021, //披风运气卷轴,  //成功率100%，运气+1
            2041022, //披风运气卷轴60%,  //成功率60%，运气+2
            2041023, //披风运气卷轴10%,  //成功率10%，运气+3
            2041025, //披风物理防御必成卷, 
            2041026, //披风魔防诅咒卷轴,
            2041027, //披风魔防诅咒卷轴,
            2041028, //披风防御诅咒卷轴,
            2041029, //披风防御诅咒卷轴,
            2041030, //披风体力诅咒卷轴,
            2041031, //披风体力诅咒卷轴,
            2041032, //披风魔力诅咒卷轴,
            2041033, //披风魔力诅咒卷轴,
            2041034, //披风力量诅咒卷轴,  //成功率70%，力量+2\n但失败时50%的比率道具消失
            2041035, //披风力量诅咒卷轴,  //成功率30%，力量+3\n但失败时50%的比率道具消失
            2041036, //披风智力诅咒卷轴,  //成功率70%，智力+2\n但失败时50%的比率道具消失
            2041037, //披风智力诅咒卷轴,  //成功率30%，智力+3\n但失败时50%的比率道具消失
            2041038, //披风敏捷诅咒卷轴,  //成功率70%，敏捷+2\n但失败时50%的比率道具消失
            2041039, //披风敏捷诅咒卷轴,  //成功率30%，敏捷+3\n但失败时50%的比率道具消失
            2041040, //披风运气诅咒卷轴,  //成功率70%，运气+2\n但失败时50%的比率道具消失
            2041041, //披风运气诅咒卷轴,  //成功率30%，运气+3\n但失败时50%的比率道具消失
            2041042, //披风魔法防御卷轴65%,
            2041043, //披风魔法防御卷轴15%,
            2041044, //披风物理防御卷轴65%,
            2041045, //披风物理防御卷轴15%,
            2041046, //披风体力卷轴65%,  //为披风增加最大HP属性。\n成功率：65%，最大HP+40
            2041047, //披风体力卷轴15%,  //为披风增加最大HP属性。\n成功率：15%，最大HP+80
            2041048, //披风魔力卷轴65%,  //为披风增加最大MP属性。\n成功率：65%，最大MP+40
            2041049, //披风魔力卷轴15%,  //为披风增加最大MP属性。\n成功率：15%，最大MP+80
            2041050, //披风力卷轴65%,  //用来增加披风的力量属性。\n成功率：65%，力量+2
            2041051, //披风力卷轴15%,  //用来增加披风的力量属性。\n成功率：15%，力量+3
            2041052, //披风智力卷轴65%,  //用来增加披风的智力属性。\n成功率：65%，智力+2
            2041053, //披风智力卷轴15%,  //用来增加披风的智力属性。\n成功率：15%，智力+3
            2041054, //披风敏捷卷轴65%,  //用来增加披风的敏捷属性。\n成功率：65%，敏捷+2
            2041055, //披风敏捷卷轴15%,  //用来增加披风的敏捷属性。\n成功率：15%，敏捷+3
            2041056, //披风幸运卷轴65%,  //用来增加披风的幸运属性。\n成功率：65%，幸运+2
            2041057, //披风幸运卷轴15%,  //用来增加披风的幸运属性。\n成功率：15%，幸运+3
            2041058, //披风防寒卷轴,  //给披肩增加防寒功能.\n成功率:10%, 对强化次数没有影响
            2041201, //项链运气卷轴10%,  //成功率10%，运气+3
            2041202, //项链运气卷轴60%,  //成功率60%，运气+2
            2041203, //项链运气卷轴100%,  //成功率100%，运气+1
            2041204, //项链运气诅咒卷轴30%,  //成功率30%，运气+3，但失败时50%的机率道具消失。
            2041205, //项链运气诅咒卷轴70%,  //成功率70%，运气+2，但失败时50%的机率道具消失。
            2041206, //项链力量卷轴10%,  //成功率10%，力量+3，最大HP+10
            2041207, //项链力量卷轴60%,  //成功率60%，力量+2
            2041208, //项链力量卷轴100%,  //成功率100%，力量+1
            2041209, //项链力量诅咒卷轴30%
            2041210, //项链力量诅咒卷轴70%
            2041300, //腰带力量卷轴100%
            2041301, //腰带力量卷轴60%
            2041302, //腰带力量卷轴10%
            2041303, //腰带智力卷轴100%
            2041304, //腰带智力卷轴60%
            2041305, //腰带智力卷轴10%
            2041306, //腰带敏捷卷轴100%
            2041307, //腰带敏捷卷轴60%
            2041308, //腰带敏捷卷轴10%
            2041309, //腰带运气卷轴100%
            2041310, //腰带运气卷轴60%
            2041311, //腰带运气卷轴10%
            2041312, //腰带力量卷轴
            2041313, //腰带力量卷轴
            2041314, //腰带智力卷轴
            2041315, //腰带智力卷轴
            2041316, //腰带敏捷卷轴
            2041317, //腰带敏捷卷轴
            2041318, //腰带运气卷轴
            2041319, //腰带运气卷轴
            2041100, //戒指力量卷轴
            2041101, //戒指力量卷轴
            2041102, //戒指力量卷轴10%
            2041103, //戒指智力卷轴
            2041104, //戒指智力卷轴
            2041105, //戒指智力卷轴10%
            2041106, //戒指敏捷卷轴
            2041107, //戒指敏捷卷轴
            2041108, //戒指敏捷卷轴
            2041109, //戒指运气卷轴
            2041110, //戒指运气卷轴
            2041111, //戒指运气卷轴
            2041112, //戒指力量卷轴
            2041113, //戒指力量卷轴
            2041114, //戒指智力卷轴
            2041115, //戒指智力卷轴
            2041116, //戒指敏捷卷轴
            2041117, //戒指敏捷卷轴
            2041118, //戒指运气卷轴
            2041119, //戒指运气卷轴
            2043000, //单手剑攻击卷轴
            2043001, //单手剑攻击卷轴60%
            2043002, //单手剑攻击卷轴10%
            2043004, //单手剑攻击诅咒卷轴
            2043005, //单手剑攻击诅咒卷轴
            2043006, //单手剑魔力诅咒卷轴70%
            2043007, //单手剑魔力诅咒卷轴30%
            2043008, //单手剑魔力卷轴10%
            2043009, //单手剑魔力卷轴60%
            2043010, //单手剑魔力卷轴100%
            2043011, //单手剑攻击卷轴65%
            2043012, //单手剑攻击卷轴15%
            2043015, //单手剑命中率卷轴
            2043016, //单手剑命中率卷轴
            2043017, //单手剑命中率卷轴60%
            2043018, //单手剑命中率卷轴
            2043019, //单手剑命中率卷轴10%
            2043024, //单手剑命中卷轴65%
            2043025, //单手剑命中卷轴15%
            2043100, //单手斧攻击卷轴
            2043101, //单手斧攻击卷轴60%
            2043102, //单手斧攻击卷轴10%
            2043104, //单手斧攻击诅咒卷轴
            2043105, //单手斧攻击诅咒卷轴
            2043106, //单手斧攻击卷轴65%
            2043107, //单手斧攻击卷轴15%
            2043110, //单手斧命中率卷轴
            2043111, //单手斧命中率卷轴
            2043112, //单手斧命中率卷轴60%
            2043113, //单手斧命中率卷轴
            2043114, //单手斧命中率卷轴10%
            2043118, //单手斧命中卷轴65%
            2043119, //单手斧命中卷轴15%
            2043200, //单手钝器攻击卷轴
            2043201, //单手钝器攻击卷轴60%
            2043202, //单手钝器攻击卷轴10%
            2043204, //单手钝器攻击诅咒卷轴
            2043205, //单手钝器攻击诅咒卷轴
            2043206, //单手钝器攻击卷轴65%
            2043207, //单手钝器攻击卷轴15%
            2043210, //单手钝器命中率卷轴
            2043211, //单手钝器命中率卷轴
            2043212, //单手钝器命中率卷轴60%
            2043213, //单手钝器命中率卷轴
            2043214, //单手钝器命中率卷轴10%
            2043218, //单手钝器命中卷轴65%
            2043219, //单手钝器命中卷轴15%
            2043300, //短剑攻击卷轴
            2043301, //短剑攻击卷轴60%
            2043302, //短剑攻击卷轴10%
            2043304, //短剑攻击诅咒卷轴
            2043305, //短剑攻击诅咒卷轴
            2043306, //短剑攻击卷轴65%
            2043307, //短剑攻击卷轴15%
            2043400, // 刀攻击力卷轴 100%
            2043401, // 刀攻击力卷轴 60% 
            2043402, // 刀攻击力卷轴 10%
            2043403, //刀攻击力卷轴
            2043404, //刀攻击力卷轴
            2043700, //短杖魔力卷轴
            2043701, //短杖魔力卷轴60%
            2043702, //短杖魔力卷轴10%
            2043704, //短杖魔力诅咒卷轴
            2043705, //短杖魔力诅咒卷轴
            2043706, //短杖魔力卷轴65%
            2043707, //短杖魔力卷轴15%
            2043714, //短杖魔力卷轴
            2043800, //长杖魔力卷轴
            2043801, //长杖魔力卷轴60%
            2043802, //长杖魔力卷轴10%
            2043804, //长杖魔力诅咒卷轴
            2043805, //长杖魔力诅咒卷轴
            2043806, //长杖魔力卷轴65%
            2043807, //长杖魔力卷轴15%
            2043814, //长杖魔力卷轴
            2044000, //双手剑攻击卷轴
            2044001, //双手剑攻击卷轴60%
            2044002, //双手剑攻击卷轴10%
            2044004, //双手剑攻击诅咒卷轴
            2044005, //双手剑攻击诅咒卷轴
            2044006, //双手剑攻击卷轴65%
            2044007, //双手剑攻击卷轴15%
            2044010, //双手剑命中率卷轴
            2044011, //双手剑命中率卷轴
            2044012, //双手剑命中率卷轴60%
            2044013, //双手剑命中率卷轴
            2044014, //双手剑命中率卷轴10%
            2044015, //双手剑攻击卷轴
            2044026, //双手剑命中卷轴65%
            2044027, //双手剑命中卷轴15%
            2044100, //双手斧攻击卷轴
            2044101, //双手斧攻击卷轴60%
            2044102, //双手斧攻击卷轴10%
            2044104, //双手斧攻击诅咒卷轴
            2044105, //双手斧攻击诅咒卷轴
            2044106, //双手斧攻击卷轴65%
            2044107, //双手斧攻击卷轴15%
            2044110, //双手斧命中率卷轴
            2044111, //双手斧命中率卷轴
            2044112, //双手斧命中率卷轴60%
            2044113, //双手斧命中率卷轴
            2044114, //双手斧命中率卷轴10%
            2044118, //双手斧命中卷轴65%
            2044119, //双手斧命中卷轴15%
            2044200, //双手钝器攻击卷轴
            2044201, //双手钝器攻击卷轴60%
            2044202, //双手钝器攻击卷轴10%
            2044204, //双手钝器攻击诅咒卷轴
            2044205, //双手钝器攻击诅咒卷轴
            2044206, //双手钝器攻击卷轴65%
            2044207, //双手钝器攻击卷轴15%
            2044210, //双手钝器命中率卷轴
            2044211, //双手钝器命中率卷轴
            2044212, //双手钝器命中率卷轴60%
            2044213, //双手钝器命中率卷轴 
            2044214, //双手钝器命中率卷轴10%
            2044218, //单手钝器命中卷轴65%
            2044219, //单手钝器命中卷轴15%
            2044300, //枪攻击卷轴
            2044301, //枪攻击卷轴60%
            2044302, //枪攻击卷轴10%
            2044304, //枪攻击诅咒卷轴
            2044305, //枪攻击诅咒卷轴
            2044306, //枪攻击卷轴65%
            2044307, //枪攻击卷轴15%
            2044310, //枪命中率卷轴
            2044311, //枪命中率卷轴
            2044312, //枪命中率卷轴
            2044313, //枪命中率卷轴
            2044314, //枪命中率卷轴10%
            2044318, //枪命中卷轴65%
            2044319, //枪命中卷轴15%
            2044400, //矛攻击卷轴
            2044401, //矛攻击卷轴60%
            2044402, //矛攻击卷轴10%
            2044404, //矛攻击诅咒卷轴
            2044405, //矛攻击诅咒卷轴
            2044406, //矛攻击卷轴65%
            2044407, //矛攻击卷轴15%
            2044410, //矛命中率卷轴
            2044411, //矛命中率卷轴
            2044412, //矛命中率卷轴
            2044413, //矛命中率卷轴
            2044414, //矛命中率卷轴
            2044418, //矛命中卷轴65%
            2044419, //矛命中卷轴15%
            2044500, //弓攻击卷轴
            2044501, //弓攻击卷轴60%
            2044502, //弓攻击卷轴10%
            2044504, //弓攻击诅咒卷轴
            2044505, //弓攻击诅咒卷轴
            2044506, //弓攻击卷轴65%
            2044507, //弓攻击卷轴15%
            2044600, //弩攻击卷轴
            2044601, //弩攻击卷轴60%
            2044602, //弩攻击卷轴10%
            2044604, //弩攻击诅咒卷轴
            2044605, //弩攻击诅咒卷轴
            2044606, //弩攻击卷轴65%
            2044607, //弩攻击卷轴15%
            2044700, //拳套攻击卷轴
            2044701, //拳套攻击卷轴60%
            2044702, //拳套攻击卷轴10%
            2044704, //拳套攻击诅咒卷轴
            2044705, //拳套攻击诅咒卷轴
            2044706, //拳套攻击卷轴65%
            2044707, //拳套攻击卷轴15%
            2044800, // 拳甲攻击卷轴
            2044801, //拳甲攻击卷轴60%
            2044802, //拳甲攻击卷轴10%
            2044803, // 拳甲攻击卷轴
            2044804, // 拳甲攻击卷轴
            2044805, // 拳甲命中率卷轴
            2044806, // 拳甲命中率卷轴
            2044807, //拳甲命中率卷轴60%
            2044808, // 拳甲命中率卷轴
            2044809, //拳甲命中率卷轴10%
            2044811, //拳甲攻击卷轴65%
            2044812, //指节攻击卷轴15%
            2044813, //指节命中卷轴65%
            2044814, //指节命中卷轴15%
            2044900, //短枪攻击卷轴
            2044901, //短枪攻击卷轴60%
            2044902, //短枪攻击卷轴10%
            2044903, //短枪攻击卷轴
            2044904, //短枪攻击卷轴
            2044906, //短枪攻击卷轴65%
            2044907, //短枪攻击卷轴15%
            2045200, //双弩枪攻击力卷轴
            2045201, //双弩枪攻击力卷轴
            2045202, //双弩枪攻击力卷轴
            2045203, //双弩枪攻击力卷轴
            2045204, //双弩枪攻击力卷轴
            2045205, //双弩枪攻击力卷轴
            2045206, //双弩枪攻击力卷轴
            2045208, //双弩枪攻击力卷轴
            2045300, //手炮攻击力卷轴
            2045301, //手炮攻击力卷轴
	    2340000, // 祝福卷轴
            2045302, //手炮攻击力卷轴
            2045303, //手炮攻击力卷轴
            2045304, //手炮攻击力卷轴
            2045305, //手炮攻击力卷轴
            2045306, //手炮攻击力卷轴
            2045308, //手炮攻击力卷轴
            2046000, // 单手武器攻击力卷轴 100%
            2046001, // 单手武器魔力卷轴
            2046002, //单手武器攻击卷轴
            2046003 //单手武器魔力卷轴
            );
            item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "卷轴转蛋机");
        }
        if (item != -1) {
            cm.gainItem(5220040, -1);
            cm.sendOk("你获得了 #b#t" + item + "##k.");
        } else {
            cm.sendOk("你确实有#b#t5220040##k吗?如果是,请你确认在背包的装备,消耗,其他窗口中是否有一格以上的空间?");
        }
        cm.safeDispose();
    }
}