var list = Array(
1432086, // 狮心长枪, // (无描述)
1302152, // 狮心弯刀, // (无描述)
1522018, // 龙翼巨弩枪, // (无描述)
1232014, // 狮心痛苦命运, // (无描述)
1322096, // 狮心震雷钉, // (无描述)
1342036, // 精灵角暗影刀, // (无描述)
1402095, // 狮心战斗弯刀, // (无描述)
1372084, // 龙尾精灵短杖, // (无描述)
1382104, // 龙尾战斗长杖, // (无描述)
1212014, // 龙尾黑甲凶灵, // (无描述)
1452111, // 鹰翼组合弓, // (无描述)
1462099, // 鹰翼重弩, // (无描述)
1242042, // 渡鸦之魂女王意志之剑, // (无描述)
1332130, // 渡鸦之魂短刀, // (无描述)
1362019, // 渡鸦之魂真红手杖, // (无描述)
1482084, // 鲨齿巨鹰爪, // (无描述)
1492085, // 鲨齿锐利手铳, // (无描述)
1532018, // 鲨齿火焰炮, // (无描述)
1222014, // 鲨齿灵魂汲取者, // (无描述)
1242014, // 鲨齿女王意志之剑, // (无描述)
1052314, // 狮心战斗锁子甲, // (无描述)
1052315, // 龙尾法师长袍, // (无描述)
1052316, // 鹰翼哨兵服, // (无描述)
1052317, // 渡鸦之魂追踪者盔甲, // (无描述)
1052318, // 鲨齿船长外套, // (无描述)
1082296, // 龙尾法师手套, // (无描述)
1082297, // 鹰翼哨兵手套, // (无描述)
1082298, // 渡鸦之魂追踪者手套, // (无描述)
1082299, // 鲨齿船长手套, // (无描述)
1082295, // 狮心战斗护腕, // (无描述)
1152110, // 龙尾法师护肩, // (无描述)
1152111, // 鹰翼哨兵护肩, // (无描述)
1152112, // 渡鸦之魂猎人护肩, // (无描述)
1152113, // 鲨齿船长护肩, // (无描述)
1152108, // 狮心战斗护肩, // (无描述)
1102275, // 狮心战斗披风, // (无描述)
1102276, // 龙尾法师披风, // (无描述)
1102277, // 鹰翼哨兵披风, // (无描述)
1102278, // 渡鸦之魂猎人披风, // (无描述)
1102279, // 鲨齿船长披风, // (无描述)
1003172, // 狮心战斗头盔, // (无描述)
1003173, // 龙尾法师帽子, // (无描述)
1003174, // 鹰翼哨兵便帽, // (无描述)
1003175, // 渡鸦之魂追踪者帽, // (无描述)
1003176, // 鲨齿船长帽, // (无描述)
1072485, // 狮心战斗鞋, // (无描述)
1072486, // 龙尾法师鞋, // (无描述)
1072487, // 鹰翼哨兵鞋, // (无描述)
1072488, // 渡鸦之魂追踪者鞋, // (无描述)
1072489// 鲨齿船长鞋, // (无描述)
);
var conn = cm.getConnection();
for(var key in list) {
	var sql = "insert into drop_data(dropperid, itemid, chance) values(9303079,?,30000);";
	var pstmt = conn.prepareStatement(sql);
	pstmt.setInt(1, list[key]);
	pstmt.executeUpdate();
	pstmt.close();
}
cm.sendOk("OK");
cm.dispose();