var status = -1;

function action(mode, type, selection) {
	if (mode == 1) {
		status++;
	} else {
		if (status == 0) {
			cm.dispose();
		}
		status--;
	}
	if (status == 0) {
		if (cm.getPlayer().getMapId() == 350060200) {
			cm.sendYesNo("ÎÒ±ÏÉúµÄÐÄÑª£¬»¹ÊÇ±»ÄãÃÇ´ò°ÜÁËÂð£¡");
		} else {
			cm.sendOk("ºÇºÇ¡£");
			cm.safeDispose();
		}
	} else if (status == 1) {
		if ((cm.getSpace(1) > 1 || cm.getSpace(2) > 1 || cm.getSpace(3) > 1 || cm.getSpace(4) > 1)) {
			cm.gainNX(2, 10000);
			cm.gainNX(1, 3000);
			var item;
			var chance1 = Math.floor(Math.random() * 1000);
			if (chance1 < 200) {
				var itemList = new Array(5062002, 5062500, 5062009, 5062010, 2049116, 2049124);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 5, "¸ñÀïÃ·¶ûÊÖ", 3);
			} else if (chance1 >= 200 && chance1 <= 300) {
				var itemList = new Array(4000463, 4001714);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 3, "¸ñÀïÃ·¶ûÊÖ", 3);
			} else if (chance1 > 300 && chance1 <= 650) {
				var itemList = new Array(1003172, // Ê¨ÐÄÕ½¶·Í·¿ø
				1542015, 1102275, // Ê¨ÐÄÕ½¶·Åû·ç
				1082295, // Ê¨ÐÄÕ½¶·»¤Íó
				1052314, // Ê¨ÐÄÕ½¶·Ëø×Ó¼×
				1072485, // Ê¨ÐÄÕ½¶·Ð¬
				1003173, // ÁúÎ²·¨Ê¦Ã±×Ó
				1102276, // ÁúÎ²·¨Ê¦Åû·ç
				1082296, // ÁúÎ²·¨Ê¦ÊÖÌ×
				1052315, // ÁúÎ²·¨Ê¦³¤ÅÛ
				1072486, // ÁúÎ²·¨Ê¦Ð¬
				1003174, // Ó¥ÒíÉÚ±ø±ãÃ±
				1102277, // Ó¥ÒíÉÚ±øÅû·ç
				1082297, // Ó¥ÒíÉÚ±øÊÖÌ×
				1052316, // Ó¥ÒíÉÚ±ø·þ
				1072487, // Ó¥ÒíÉÚ±øÐ¬
				1003175, // ¶ÉÑ»Ö®»ê×·×ÙÕßÃ±
				1102278, // ¶ÉÑ»Ö®»êÁÔÈËÅû·ç
				1082298, // ¶ÉÑ»Ö®»ê×·×ÙÕßÊÖÌ×
				1052317, // ¶ÉÑ»Ö®»ê×·×ÙÕß¿ø¼×
				1072488, // ¶ÉÑ»Ö®»ê×·×ÙÕßÐ¬
				1003176, // öè³Ý´¬³¤Ã±
				1102279, // öè³Ý´¬³¤Åû·ç
				1082299, // öè³Ý´¬³¤ÊÖÌ×
				1052318, // öè³Ý´¬³¤ÍâÌ×
				1072489, // öè³Ý´¬³¤Ð¬
				1432086, // Ê¨ÐÄ³¤Ç¹
				1442116, // Ê¨ÐÄ³¤Ã¬
				1322096, // Ê¨ÐÄÕðÀ×
				1422066, // Ê¨ÐÄ¾Þ´¸
				1402095, // Ê¨ÐÄÕ½µ¶
				1412065, // Ê¨ÐÄÕ½¸«
				1302152, // Ê¨ÐÄÍäµ¶
				1312065, // Ê¨ÐÄÓÂ¸«
				1372084, // ÁúÎ²¶ÌÕÈ
				1382104, // ÁúÎ²³¤ÕÈ
				1452111, // Ó¥ÒíÖØ¹­
				1462099, // Ó¥ÒíÖØåó
				1332130, // ¶ÉÑ»Ö®»ê£¨¶Ìµ¶£©
				1472122, // ¶ÉÑ»Ö®»ê
				1342036, // ¾«Áé½Çµ¶
				1492085, // öè³ÝÊÖï¥
				1532018, // öè³ÝÓ¥×¦
				1302016, // öè³Ý»ðÅÚ
				1522018 // ÁúÒíåóÇ¹
				);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "¸ñÀïÃ·¶ûÊÖ", 3);
			} else if (chance1 > 650 && chance1 <= 995) {
				var itemList = new Array(1212077, // ¾Þ½³ºÚ¼×Ð×Áé, // (ÎÞÃèÊö)
				1222072, // ¾Þ½³ÌìÊ¹ÊÖï¥, // (ÎÞÃèÊö)
				1232071, // ¾Þ½³ËÀÍöÊ¹Õß, // (ÎÞÃèÊö)
				1402204, // ¾Þ½³¾Þ½£, // (ÎÞÃèÊö)
				1242076, // ¾Þ½³¾«ÉñÖ®ÈÐ, // (ÎÞÃèÊö)
				1302285, // ¾Þ½³Õ½½£, // (ÎÞÃèÊö)
				1312162, // ¾Þ½³Õ½¶·ÇÐÈâ¸«, // (ÎÞÃèÊö)
				1322213, // ¾Þ½³´óÕ½¶·´¸, // (ÎÞÃèÊö)
				1332235, // ¾Þ½³Ð¡Ñý¾«µ¶, // (ÎÞÃèÊö)
				1342084, // ¾Þ½³Ð¡µ¶, // (ÎÞÃèÊö)
				1362099, // ¾Þ½³ÊÖÕÈ, // (ÎÞÃèÊö)
				1372186, // ¾Þ½³Ð°¶ñÕÈ, // (ÎÞÃèÊö)
				1382220, // ¾Þ½³Õ½¶·³¤ÕÈ, // (ÎÞÃèÊö)
				1412144, // ¾Þ½³Õ½¸«, // (ÎÞÃèÊö)
				1422149, // ¾Þ½³Õ½´¸, // (ÎÞÃèÊö)
				1432176, // ¾Þ½³Õ½¶·Ö®Ã¬, // (ÎÞÃèÊö)
				1442232, // ¾Þ½³µØÓüÖ®Äñ, // (ÎÞÃèÊö)
				1452214, // ¾Þ½³Õ½¶·¹­, // (ÎÞÃèÊö)
				1462202, // ¾Þ½³åó, // (ÎÞÃèÊö)
				1472223, // ¾Þ½³ºÚÊÖ¼×, // (ÎÞÃèÊö)
				1482177, // ¾Þ½³Ê¨ðÕÈ­×¦, // (ÎÞÃèÊö)
				1492188, // ¾Þ½³ÎÞ¾¡Ö®Ç¹, // (ÎÞÃèÊö)
				1522103, // ¾Þ½³Ó¥åóÇ¹, // (ÎÞÃèÊö)
				1532106, // ¾Þ½³»ðÅÚ, // (ÎÞÃèÊö)
				1542075, // ¾Þ½³ÎäÊ¿µ¶, // (ÎÞÃèÊö)
				1252058, // ¾Þ½³¹âÄÜÄ§·¨°ô, // (ÎÞÃèÊö)
				1552075, // ¾Þ½³ÉÈ, // (ÎÞÃèÊö)
				1113055, // ¾Þ½³Ö®½ä, // (ÎÞÃèÊö)
				1032200, // ¾Þ½³¶ú»·, // (ÎÞÃèÊö)
				1152154 // ¾Þ½³»¤¼ç, // (ÎÞÃèÊö)
				);
				item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "¸ñÀïÃ·¶ûÊÖ", 3);
			} else {
				var itemList = new Array(5062002, 5062500, 5062009, 5062010, 2049116, 2049124);
				var itemid = itemList[Math.floor(Math.random() * itemList.length)];
				item = cm.gainGachaponItem(itemid, 1, "¸ñÀïÃ·¶ûÊÖ", 3);
			}
			if (item != -1) {
				cm.warp(910000000);
				cm.dispose();
			} else {
				cm.sendOk("ÇëÄãÈ·ÈÏÔÚ±³°üµÄ×°±¸,ÏûºÄ,ÆäËû´°¿ÚÖÐÊÇ·ñÓÐÒ»¸ñÒÔÉÏµÄ¿Õ¼ä?");
			}
		} else {
			cm.sendOk("xx´íÎó");
		}
		cm.safeDispose();
	}
}