/* 点卷商城 - 椅子 */

var status = -1;
var itemList = Array(
// -----价格为 2000 点卷 --------
Array(3010002, 10000), //绿色时尚转椅
Array(3010003, 10000), //红色时尚转椅
Array(3010006, 10000), //黄色时尚转椅
Array(3010004, 10000), //黄蓝休闲椅
Array(3010005, 10000), //红蓝休闲椅
Array(3010018, 10000), //椰子树沙滩椅
Array(3010029, 10000), //蓝环凳
Array(3010030, 10000), //黑环凳
Array(3010031, 10000), //红环凳
Array(3010032, 10000), //黄环凳
Array(3010033, 10000), //绿环凳
Array(3010043, 10000), //魔女的飞扫把
Array(3013002, 10000), //烟花祭
Array(3010166, 10000), //双刀同门
// -----价格为 4000 点卷 --------
Array(3010007, 20000), //粉色海豹靠垫
Array(3010008, 20000), //蓝色海豹靠垫
Array(3010010, 20000), //白色海豹靠垫
Array(3010016, 20000), //黑色海豹靠垫
Array(3010017, 20000), //金色海豹靠垫
Array(3010024, 20000), //玩具粉熊椅
Array(3010025, 20000), //枫叶纪念凳
// -----价格为 8000 点卷 --------
Array(3010014, 40000), //月亮弯
Array(3010019, 40000), //寿司椅
Array(3010021, 40000), //暖暖桌
Array(3010034, 40000), //悠长假期(红)
Array(3010035, 40000), //悠长假期(蓝)
Array(3010037, 40000), //猪猪凳
Array(3010038, 40000), //空气沙发
Array(3010040, 40000), //蝙蝠椅
Array(3010041, 40000), //骷髅王座
Array(3010044, 40000), //同一红伞下
Array(3010045, 40000), //寒冰椅子
Array(3010049, 40000), //雪房子
Array(3010068, 40000), //露水椅子
Array(3010050, 40000), //公主凳
Array(3010069, 40000), //大黄风
Array(3010093, 40000), //鲜美的火鸡
Array(3010094, 40000), //漂漂猪椅子
Array(3010095, 40000), //石头人座椅
// -----价格为 10000 点卷 --------
Array(3010009, 80000), //塌塌凳
Array(3010028, 80000), //海盗的俘虏
Array(3010036, 80000), //浪漫秋千
Array(3010046, 80000), //红龙椅
Array(3010047, 80000), //蓝龙椅
Array(3010048, 80000), //圣诞树椅子
Array(3010051, 80000), //沙漠兔子靠垫1
Array(3010052, 80000), //沙漠兔子靠垫2
Array(3010054, 80000), //呼噜呼噜床
Array(3010057, 80000), //血色玫瑰
Array(3010058, 80000), //世界末日
Array(3010071, 80000), //神兽椅
Array(3010073, 80000), //baby品克缤
Array(3010075, 80000), //我为音乐狂
Array(3010077, 80000), //猫头鹰椅子
Array(3010096, 80000), //恐龙化石宝座
Array(3010098, 80000), //电视宅人
Array(3010099, 80000), //北极熊椅子
Array(3010100, 80000), //财神椅子
Array(3010110, 80000), //舒适大白熊椅子
Array(3010111, 80000), //虎虎生威
Array(3010112, 80000), //情书柜子
Array(3010116, 80000), //摇滚之魂椅子
Array(3010117, 80000), //魔法书椅子
Array(3010118, 80000), //糖果音符椅子
Array(3010119, 80000), //羊羊椅子
Array(3010120, 80000), //彩蛋篮子
Array(3010123, 80000), //夏日花朵
Array(3010124, 80000), //都纳斯喷气椅子
Array(3010125, 80000), //尼贝隆战舰椅
Array(3010126, 80000), //蝙蝠魔王座
Array(3012001, 80000), //篝火
Array(3012002, 80000), //浴桶
Array(3010066, 80000), //深蓝色绒毛沙发
Array(3010067, 80000), //红色设计师椅
Array(3010080, 80000), //柿子树鞦韆 
Array(3010081, 80000), //红帽月妙抱枕椅
Array(3010082, 80000), //蓝帽月妙抱枕椅
Array(3010083, 80000), //扇子月妙抱枕椅
Array(3010084, 80000), //太平萧月妙抱枕椅
Array(3010107, 80000), //龙龙的蛋壳椅
Array(3010108, 80000), //幼龙秋千
Array(3010109, 80000), //暖炉椅
Array(3010113, 80000), //幽魂发条熊椅子
Array(3010055, 80000), //冰雪糕丸子椅
Array(3010145, 80000), //周年庆水晶枫叶椅
Array(3010136, 80000), //6周年怪物王座
Array(3010137, 80000), //神龙椅子
Array(3010149, 80000), //猫咪风扇椅
Array(3010144, 80000), //七夕椅子
Array(3010155, 80000), //暗影双刀的猫头鹰
Array(3010078, 80000), //大熊猫椅子
Array(3010132, 80000), //撒娇猫咪椅
Array(3010133, 80000), //帐篷椅
// -----价格为 20000 点卷 --------
Array(3012003, 100000), //爱心椅子
Array(3012006, 100000), //风吹稻香
Array(3012010, 100000), //巧克力蛋糕恋人
Array(3012011, 100000), //我爱巧克力火锅
Array(3010156, 100000), //浮游飞行器
Array(3010152, 100000), //黄三角帐篷椅
Array(3010162, 100000), //果月椅子
Array(3010163, 100000), //满月椅
Array(3010135, 100000), //节日独角兽椅子
Array(3010139, 100000), //私密空间
Array(3010168, 100000), //友谊万岁椅子
Array(3010172, 100000), //星空椅子
Array(3010173, 100000), //万圣节塔罗椅子
Array(3010175, 100000), //名画家椅子
Array(3010179, 100000), //燕尾服猫咪椅
Array(3010169, 100000), //纸箱里(求领养)
Array(3010171, 100000), //过来抱抱椅
Array(3010174, 100000), //女巫炼药椅
Array(3010182, 100000), //兔子家族椅
Array(3010183, 100000), //胡萝卜椅子
Array(3010053, 100000), //兔子纪念版椅子
Array(3010142, 100000), //水族馆椅子
Array(3010209, 100000), //草莓冰淇淋月饼椅
Array(3010210, 100000), //香草冰淇淋月饼椅
Array(3010197, 100000), //英雄的椅子-战神
Array(3010200, 100000), //英雄的椅子-龙神
Array(3010201, 100000), //英雄的椅子-暗影
Array(3010161, 100000), //鼠鼠椅
Array(3010226, 100000), //月光仙子椅子
Array(3010085, 100000), //鬼娃娃椅子
Array(3013000, 100000), //樱花树下
Array(3010177, 100000), //手柄座椅
Array(3010454, 100000), //云朵
Array(3010591, 250000), //漫画书椅子
Array(3010127, 100000), //扎昆宝座
Array(3010128, 100000), //黑龙王椅
Array(3010311, 100000), //黑龙椅子
Array(3010799, 100000), //坟墓幽灵椅子
Array(3010896, 100000), //我的女皇椅子
Array(3010689, 100000), //10周年椅子
Array(3010751, 100000), //鲸鱼椅子
Array(3010752, 100000), //玫瑰鸟笼
Array(3010754, 100000), //百鬼夜行
Array(3012020, 100000), //紫藤花吊篮椅
Array(3010779, 100000), //金马祥云轿
Array(3010788, 100000), //巨无霸年夜饭
Array(3010783, 100000), //蓝色邦尼屋
Array(3010876, 100000), //冒险岛行星椅子
Array(3010696, 100000), //大黄鸭
Array(3010715, 200000), //幸福9周年蛋糕气球椅
Array(3010070, 250000), //巨无霸品克缤
Array(3010828, 250000), //木星椅子
Array(3010829, 250000), //木星椅子
Array(3010820, 250000), //迷你玩具别墅椅子
Array(3010511, 250000), //猫咪公园椅子
Array(3010516, 250000), //噜噜啦啦印第安小孩
Array(3012016, 250000), //情侣糖果椅子
Array(3010459, 250000), //天使舞台椅
Array(3010196, 250000), //泡泡浴缸椅
Array(3010423, 250000), //蘑菇朋友椅子
Array(3010461, 250000), //赏月专用月桂树秋千椅
Array(3010528, 250000), //跑步机椅子
Array(3010448, 250000), //泡泡浴椅子
Array(3010660, 250000), //梦幻公主城堡椅子
Array(3010714, 250000), //堆王冠
Array(3010835, 250000), //爱情水晶球记忆椅
Array(3010779, 250000), //金马祥云轿
Array(3010702, 250000), //爱琴海椅子
Array(3012019, 250000), //爱琴海椅子
Array(3010842, 250000), //猫猫郊游房车
Array(3010718, 250000), //初恋云朵朵沙发
Array(3010658, 250000), //夏日西瓜冰椅子
Array(3010744, 250000), //冒险岛的砖头朋友们
Array(3010594, 250000), //蓝莓蛋糕椅
Array(3012020, 250000), //紫藤花吊篮椅
Array(3010843, 250000), //兔兔郊游房车
Array(3010115, 250000), //熊宝宝床
Array(3010704, 250000), //惩戒之月妙椅子
Array(3010140, 250000), //早日康复床
Array(3010605, 250000), //雏祭娃娃3
Array(3014004, 250000), //案件聚焦椅子
Array(3010657, 250000), //军团长椅子
Array(3010519, 250000), //巨大白雪人椅子
Array(3010705, 250000), //月妙和水灵椅子
Array(3010401, 250000), //幻影卡牌椅
Array(3010697, 250000), //绝对之椅
Array(3010193, 250000), //伊芙丽思的炼金瓶
Array(3010757, 250000), //你和我
Array(3010603, 250000), //雏祭娃娃1
Array(3010604, 250000), //雏祭娃娃2
Array(3010662, 250000), //章鱼鱼缸椅
Array(3013000, 250000), //樱花树下
Array(3014003, 250000), //封面模特椅子
Array(3010362, 250000), //彩虹椅子
Array(3010936, 250000), //青蛙跳楼机
Array(3010760, 250000), //古代浴池椅子
Array(3014000, 250000), //惊人漫画椅子
Array(3010851, 250000), //夏日沁饮椅子
Array(3010723, 250000), //法式贵族扶手椅
Array(3014005, 250000), //荣誉的象征
Array(3010879, 250000), //奇幻冒险岛椅子
Array(3010877, 250000), //人鱼珊瑚礁
Array(3012024, 250000), //沙滩排球椅子
Array(3010832, 250000) //太阳椅子
);
var selectedItem = -1;
var selectedCost = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#亲爱的#r#h ##k您好，请选择您希望购买的道具：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k   #r" + itemList[i][1] / 5 + " #k点卷#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1] / 5;
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + " #k 点卷？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getPlayer().getCSPoints(1) >= selectedCost) {
            var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "点卷商店", 3, true);
            if (gachaponItem != -1) {
                cm.gainNX( - selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多点卷。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 点卷。");
        }
        cm.dispose();
    }
}