var status = 0; 

var mds;

var md1;
var md2;
var md3;

var mdd = "#b";

var mss;

var dsd = 0;

var names;
var maple;


var cishu = 0;

var items = Array (
//神奇魔方
5062000, 40, 1, 100, "洗装备潜能必备哦！",
//高级神奇魔方
5062002, 998, 1, 100, "洗SS潜能必备哦！",
//混沌魔方
5062001, 99, 1, 100, "洗出3条潜能必备哦！",
//惊人神奇魔方
5062005, 1111, 1, 100, "洗高级SS潜能必备哦！",
//星岩魔方
5750000, 100,  1, 100, "星岩重置必备哦！",
//白天使的祝福
1112663, 1111, 1, 1, "唯美白天使值得拥有！",
//天使的祝福
1112585, 55, 1, 1, "召唤带宝石的天使助阵！", 
//黑天使的祝福
1112586, 155, 1, 1, "10G强力且附带黑宝石的天使戒指值得拥有！",
//水晶八音盒
5060006, 555, 1, 100, "里面装有140套装、稀有点装和极品冒险心类，快换来试试运气吧！\r\n换后记得去换一把#i4170025:#，不然打不开的哦！",
//水晶天平
5060007, 222, 1, 100, "里面装有百种椅子、140套装、稀有点装和极品冒险心类，快换来试试运气吧！\r\n换后记得去换一个#i4170028:#，不然打不开的哦！",
//花生机
5060003, 111, 1, 100, "传闻它出高级货色哦！换来试试运气吧！\r\n换后记得去换一个#i4170023:#，不然打不开的哦！",
//英雄的钥匙
4170025, 1, 1, 100, "据说是开启#i5060006:#这货色的东东哦！",
//正义之锤
4170028, 1, 1, 100, "据说是开启#i5060007:#这货色的东东哦！",
//花生
4170023, 1, 1, 100, "据说是开启#i5060003:#这货色的东东哦！",
//秘密能手册
2430144, 5, 1, 100, "里面包含百种技能书，现在便宜大放送啦！据说出#i2290096:#和#i2290125:#哦！",
//秘密配方
2430370, 2, 1, 100, "专业技术的几百种配方在这里都可以发现其中的影子，不知道会变成那种，想知道就换来试试吧！",
//宠物自动加BUFF技能
5190010, 55, 1, 1, "宠物达人必备物品哦！有它宠物自动加BUFF无需担心重要BUFF消失！",
//炽热情景喇叭
5390000, 11, 1, 100, "刷屏必备道具！十分给力！",
//绚烂情景喇叭
5390001, 11, 1, 100, "刷屏必备道具！十分给力！",
//爱心情景喇叭
5390002, 11, 1, 100, "刷屏必备道具！十分给力！",
//小老虎情景喇叭
5390005, 11, 1, 100, "刷屏必备道具！十分给力！",
//咆哮老虎情景喇叭
5390006, 11, 1, 100, "刷屏必备道具！十分给力！",
//球进了!情景喇叭
5390007, 11, 1, 100, "刷屏必备道具！十分给力！",
//恐怖鬼娃的伤口90
1012170, 888, 1, 1, "加18G面具，传闻是伟大的黑魔法师留下的遗物，至今无法破解其中秘密！",
//恐怖鬼娃的伤口100
1012171, 998, 1, 1, "加26G面具，传闻是伟大的黑魔法师留下的遗物，至今无法破解其中秘密！",
//恐怖鬼娃的伤口130
1012172, 1288, 1, 1, "加33G面具，传闻是伟大的黑魔法师留下的遗物，至今无法破解其中秘密！",
//恐怖鬼娃的伤口150
1012173, 1555, 1, 1, "加30G给力项链！高端的你前期必备！",
//苏醒的初代冒险之心 战士
1122029, 1888, 1, 1, "加30G给力项链！高端的你前期必备！",
//苏醒的初代冒险之心 魔法师
1122030, 1888, 1, 1, "加30G给力项链！高端的你前期必备！",
//苏醒的初代冒险之心 弓箭手
1122031, 1888, 1, 1, "加30G给力项链！高端的你前期必备！",
//苏醒的初代冒险之心 飞侠
1122032, 1888, 1, 1, "加25G给力项链！高端的你前期必备！",
//苏醒的初代冒险之心 海盗
1122033, 1888, 1, 1, "加50G强力项链！高端的你后期必备！",
//苏醒的初代冒险之心 战士
1122034, 8888, 1, 1, "加50G强力项链！高端的你后期必备！",
//苏醒的初代冒险之心 魔法师
1122035, 8888, 1, 1, "加50G强力项链！高端的你后期必备！",
//苏醒的初代冒险之心 弓箭手
1122036, 8888, 1, 1, "加50G强力项链！高端的你后期必备！",
//苏醒的初代冒险之心 飞侠
1122037, 8888, 1, 1, "加50G强力项链！高端的你后期必备！",
//苏醒的初代冒险之心 海盗
1122038, 8888, 1, 1, "加45G强力项链！高端的你后期必备！",
//真·觉醒冒险之心 战士
1122122, 9999, 1, 1, "71级可潜能高级属性、加50G强力项链！高端的你永久必备！",
//真·觉醒冒险之心 魔法师
1122123, 9999, 1, 1, "71级可潜能高级属性、加50G强力项链！高端的你永久必备！",
//真·觉醒冒险之心 弓箭手
1122124, 9999, 1, 1, "71级可潜能高级属性、加50G强力项链！高端的你永久必备！",
//真·觉醒冒险之心 飞侠
1122125, 9999, 1, 1, "71级可潜能高级属性、加50G强力项链！高端的你永久必备！",
//真·觉醒冒险之心 海盗
1122126, 9999, 1, 1, "71级可潜能高级属性、加45G强力项链！高端的你永久必备！",
//真·觉醒冒险之心专用潜能力卷轴
2049405, 1111, 1, 100, "可为下列物品附加潜能哦！\r\n#i1122122:#、#i1122123:#、#i1122124:#、#i1122125:#、#i1122126:#");


var mxx;

var 2mds;

var bxx;

var xuanze;
var itemxx;
var gitem;
var ngxs;

var nowgxs;
var shul;
var shuru;

var mins = 1;
var maxs = 1;




function start() { 
    status = -1; 
    action(1, 0, 0); 
} 

function action(mode, type, selection) { 
    if (mode == -1) { 
        cm.dispose(); 
    } else if (mode == 0) { 
        cm.dispose(); 
    } else { 
        if (mode == 1) 
            status++; 
        else 
            status--; 
        if (status == 0) { 


             mds = "#r ┈┈┈━═☆#i4251202##r    贡献专区    #i4251202# #r☆═━┈┈┈ \r\n";

             names = cm.getVipname();
             maple = cm.getMaplewing("maple");

             mss = mds + names + "欢迎您进入 贡献专区 ！\r\n#b目前您拥有的贡献点为：#e#r" + maple + "#n#d\r\n在这儿您可以体验到贡献点的神奇！！\r\n#k现在请选择您需要的服务：#b\r\n\r\n#L100801#兑换稀有物品#l  #L100802#进行超级抽奖#l  \r\n\r\n其他功能敬请期待！\r\n#L100899#查看贡献点获得说明#l";


               cm.sendSimple(mss); 


        } else if (status == 1) { 

           jobs = selection;

        switch (selection) {

        case 100801:

              dsd = 100;

            md2 = mds + "#d目前您选择的是 兑换稀有物品！以下是本期稀有物品：\r\n";


                    for (var i = 0; i <= items.length; i++)
                    if ((i % 5 == 0) && (items[i + 1] >= 0)) {
                        mdd += "#d#L" + items[i] + "##i" + items[i] + ":##d #e=#n #r" + items[i + 1] + "#n#b点#l";
                         cishu++;
                    if (cishu%3 == 0) {
                        mdd += "\r\n";
                    }


                    }

                cm.sendSimple(md2 + mdd);


            break;

        case 2300:

            cm.dispose();

            cm.sendOk(mds + "敬请期待！");

            break;
        case 2:
            cm.dispose();
            cm.openNpc(9000086, 5);
            break;



            } //switch 


        } else if (status == 2) { 


             xuanze = selection;


             nowgxs = cm.getMaplewing("maple");

             bxx = "\r\n目前您的贡献点余额为：#e#r" + cm.getMaplewing("maple") + "#n\r\n";


             if (dsd == 100) {



                    for (var ii = 0; ii <= items.length; ii++)
                    if ((ii % 5 == 0) && (items[ii + 1] >= 0) && (items[ii] == xuanze)) {

                     itemxx = items[i + 4];
                     gitem = items[i];
                     ngxs = items[i + 1];

                     mins = items[i + 2];
                     maxs = items[i + 3];

                    }

                  shul = (nowgxs - nowgxs%ngxs)/ngxs;

                2mds = mds + "\r\n#d您目前选择兑换的物品为：\r\n#i" + gitem + ":##b#t" + gitem +":#  单价：#e#r" + ngxs + " #n#d贡献点\r\n#b" + itemxx + bxx + "以您的贡献点余额还能兑换\r\n#i" + gitem + ":##b#t" + gitem +":# #e#r" + shul + " #n 件\r\n#k请输入您要兑换的数量：\r\n(注意：装备物品类只能兑换数量为1件！)";

             }

                cm.sendGetNumber(2mds, 1, mins, maxs);


        } //status == 2




    } 
}  
