



var status = 0;
var item = 
Array(
//-------耳环-------
			

			
			Array(1002391,300,1), //海盗头巾(绿)
			Array(1002392,300,1), //海盗头巾(红)
			Array(1002393,300,1), //海盗头巾(粉)
			Array(1002394,300,1), //海盗头巾(灰)
			Array(1002395,300,1), //海盗头巾(紫)
			
			Array(1002418,100,1), //废报纸头盔
			Array(1002419,300,1), //枫叶帽

			Array(1002723,100,1), //月饼帽
			Array(1002760,10,1), //地球帽
			Array(1002761,10,1), //枫叶面具
			Array(1002773,10,1), //金龙头盔
			Array(1002776,10,1), //永恒冠军盔
			Array(1002777,10,1), //永恒玄妙帽
			Array(1002778,10,1), //永恒霓翎帽
			Array(1002779,10,1), //永恒迷踪帽
			Array(1002780,10,1), //永恒海王星
			Array(1002790,10,1), //重生冠军盔
			Array(1002791,10,1), //重生玄妙帽
			Array(1002792,10,1), //重生霓翎帽
			Array(1002793,10,1), //重生迷踪帽
			Array(1002794,10,1), //重生海王星
			//------披风------
		
			
			Array(1082234,10,1), //永恒定边手套
			Array(1082235,10,1), //永恒逍遥手套
			Array(1082236,10,1), //永恒白云手套
			Array(1082237,10,1), //永恒探云手套
			Array(1082238,10,1), //永恒抚浪手套
			Array(1082239,10,1), //重生定边手套
			Array(1082240,10,1), //重生逍遥手套
			Array(1082241,10,1), //重生白云手套
			Array(1082242,10,1), //重生探云手套
			Array(1082243,10,1), //重生抚浪手套
			

			Array(1302024,300,1), //废报纸卷
		
			Array(1302032,300,1), //烈焰之剑
			Array(1302035,300,1), //枫叶旗
			Array(1302036,300,1), //枫叶旗
		


			Array(1302063,300,1), //燃烧的火焰刀
			Array(1302064,300,1), //枫叶突击剑
			Array(1302066,300,1), //枫叶3年旗
			Array(1302067,300,1), //枫叶庆典旗


			Array(1302080,300,1), //七彩霓虹灯泡
			Array(1302081,10,1), //永恒破甲剑
		
			Array(1302085,300,1), //叉子
			Array(1302086,10,1), //重生破甲剑
			Array(1302087,300,1), //火炬
			Array(1302104,300,1), //鱿鱼剑
			Array(1302105,10,1), //圣诞六翼天使武器(单手剑)
		
		
			Array(1312037,10,1), //永恒断蚺斧
			Array(1312038,10,1), //重生断蚺斧
			Array(1312039,10,1), //圣诞六翼天使武器(单手斧)
			
			Array(1322027,10,1), //米伽勒的平底锅
			
			Array(1322051,300,1), //七夕
			
			
			Array(1322055,300,1), //枫叶3年旗
			Array(1322056,300,1), //粉色花边游泳圈
			Array(1322060,10,1), //永恒惊破天
			Array(1322061,10,1), //重生惊破天

			
			
			Array(1332073,10,1), //永恒狂鲨锯
			Array(1332074,10,1), //永恒断首刃
			Array(1332075,10,1), //重生狂鲨锯
			Array(1332076,10,1), //重生断首刃
		
		
			Array(1372017,300,1), //领路灯
		
			
			Array(1372035,300,1), //火灵珠短杖
			Array(1372036,300,1), //毒灵珠短杖
			Array(1372037,300,1), //冰灵珠短杖
			Array(1372038,300,1), //雷灵珠短杖
			Array(1372039,300,1), //爆炎之杖
			Array(1372040,300,1), //剧毒之杖
			Array(1372041,300,1), //寒冰之杖
			Array(1372042,300,1), //狂雷之杖
	
			Array(1372044,10,1), //永恒蝶翼杖
			Array(1372045,10,1), //重生蝶翼杖
			Array(1372046,10,1), //圣诞六翼天使武器(短杖)
			
		
			Array(1382015,50,1), //毒蘑菇
			Array(1382016,50,1), //香菇
			

			Array(1382045,300,1), //火灵珠长杖
			Array(1382046,300,1), //毒灵珠长杖
			Array(1382047,300,1), //冰灵珠长杖
			Array(1382048,300,1), //雷灵珠长杖
			
			Array(1382057,20,1), //永恒冰轮杖
			Array(1382059,20,1), //重生冰轮杖
			Array(1382062,50,1), //圣诞六翼天使武器(长杖)
			
			Array(1402013,30,1), //白日剑


			
	
			Array(1402037,5,1), //龙背刃

			Array(1402040,300,1), //枫叶3年旗

			Array(1402044,300,1), //南瓜灯笼
			Array(1402046,10,1), //永恒玄冥剑
			Array(1402047,10,1), //重生玄冥剑
			Array(1402053,80,1), //圣诞六翼天使武器(双手剑)
			
	
			Array(1412026,300,1), //炼狱魔龙斧
			Array(1412027,300,1), //枫叶乾坤轮
			Array(1412028,300,1), //枫叶3年旗
			Array(1412029,300,1), //粉色花边游泳圈
			Array(1412033,100,1), //永恒碎鼋斧
			Array(1412034,100,1), //重生碎鼋斧
			Array(1412035,100,1), //圣诞六翼天使武器(双手斧)
			
		
			Array(1422028,300,1), //金龙轰天锤
			Array(1422029,300,1), //枫叶轰天镗
			Array(1422030,100,1), //粉红海豹抱枕
			Array(1422031,100,1), //蓝色海豹抱枕
			Array(1422032,300,1), //枫叶3年旗
			Array(1422033,300,1), //粉色花边游泳圈
			Array(1422036,300,1), //玩具匠人的锤子
			Array(1422037,10,1), //永恒威震天
			Array(1422038,10,1), //重生威震天
			Array(1422039,10,1), //圣诞六翼天使武器(双手钝器)
			

			Array(1432046,100,1), //圣诞树手杖
			Array(1432047,100,1), //永恒显圣枪
			Array(1432049,100,1), //重生显圣枪
			Array(1432050,100,1), //圣诞六翼天使武器(枪)
		
			Array(1442018,10,1), //冻冻鱼
		
			Array(1442021,300,1), //黄拖把
			Array(1442022,300,1), //白拖把
			Array(1442023,300,1), //黑拖把
		
		
			Array(1442063,10,1), //永恒神光戟
			Array(1442065,300,1), //蓝色冲浪板
			Array(1442066,300,1), //红色冲浪板
			Array(1442067,10,1), //重生神光戟
			Array(1442069,300,1), //红色冲浪板
			Array(1442070,300,1), //绿色冲浪板
			Array(1442071,100,1), //圣诞六翼天使武器(矛)

			
			Array(1452057,10,1), //永恒惊电弓
			Array(1452059,10,1), //重生惊电弓
			Array(1452062,100,1), //圣诞六翼天使武器(弓)
			

			
			Array(1462039,300,1), //黄金飞龙弩
			Array(1462040,300,1), //枫叶击星弩
			Array(1462041,300,1), //枫叶3年旗
			Array(1462043,300,1), //粉色花边游泳圈
			Array(1462050,10,1), //永恒冥雷弩
			Array(1462051,10,1), //重生冥雷弩
			Array(1462056,100,1), //圣诞六翼天使武器(弩)

	
		
			Array(1472056,300,1), //枫叶3年旗
		
			Array(1472068,100,1), //永恒大悲赋
			Array(1472071,100,1), //重生大悲赋
			Array(1472077,100,1), //圣诞六翼天使武器(拳套)
			
			
			
			Array(1482023,10,1), //永恒孔雀翎
			Array(1482024,10,1), //重生孔雀翎
			Array(1482025,300,1), //粉色花边游泳圈
			Array(1482029,10,1), //圣诞六翼天使武器(指节)
			Array(1482030,300,1), //枫叶3年旗
			
			Array(1492023,10,1), //永恒凤凰铳
			Array(1492025,10,1), //重生凤凰铳
			Array(1492026,300,1), //粉色花边游泳圈
			Array(1492030,10,1), //圣诞六翼天使武器(手枪)
			Array(1492034,300,1), //枫叶3年旗

			//------药水------
	
			Array(3010007,28,1), //粉色海狗靠垫
			Array(3010008,28,1), //蓝色海狗靠垫
			Array(3010009,15,1), //榻榻凳
			Array(3010010,28,1), //白玉海豹靠垫
			Array(3010016,28,1), //黑色海狗靠垫
			Array(3010017,28,1), //金色海狗靠垫
			Array(3010024,30,1), //玩具粉熊椅
			Array(3010034,30,1), //悠长假期(红色)
			Array(3010035,30,1), // 悠长假期(蓝色)
			Array(3010036,3,1), //浪漫秋千
			Array(3010041,25,1), //蝙蝠椅
			Array(3010043,15,1), //魔女的飞扫把
			Array(3010007,25,1), //寒冰椅子
			Array(3010046,25,1), //红龙椅
			Array(3010047,25,1), //蓝龙椅 
			Array(3010048,25,1), //圣诞树椅子
			Array(3010049,25,1), //雪房子
			Array(3010050,25,1), //公主椅子
			Array(3010051,50,1), //沙漠兔子1靠垫
			Array(3010052,50,1), //沙漠兔子2靠垫
			Array(3010057,20,1), //血色玫瑰
			Array(3010058,10,1), //世界末日
			Array(3010068,25,1), //露水椅子
			Array(3010070,1,1), //巨无霸品克缤
			Array(3010071,25,1), //神兽椅
			Array(3010075,50,1), //我为音乐狂
			Array(3010077,50,1), //猫头鹰椅子
			Array(3010093,20,1), //鲜美的火鸡
			Array(3010098,50,1), //电视宅人
			Array(3010099,20,1), //北极熊椅子
			Array(3010106,20,1), // 雪狼战椅
			Array(3012006,20,1), //风吹稻香
			Array(3012010,100,1), //巧克力蛋糕恋人
			Array(3010013,200,1), //悠长假期
			Array(3010014,50,1), //月亮弯
			Array(3010018,50,1), //椰子树沙滩椅
			Array(3010019,50,1), //寿司椅
			Array(3010021,5,1), //暖暖桌
			Array(3010025,5,1), //枫叶纪念凳
			Array(3010028,5,1), //海盗的俘虏
			Array(3010029,5,1), //蓝环凳
			Array(3010030,15,1), //黑环凳
			Array(3010031,15,1), //红环凳
			Array(3010032,15,1), //黄环凳
			Array(3010033,15,1), //绿环凳
			Array(3010037,15,1), //亲亲嘴凳
			Array(3010044,15,1), //同一红伞下
			Array(3012001,15,1), //篝火
			Array(3012002,15,1), //浴桶
			Array(3010073,15,1), //PB克缤
			Array(3012003,15,1), //爱心椅子

			Array(1402085,15,1), //亲亲嘴凳
			Array(1402085,15,1), //亲亲嘴凳
			Array(1432075,15,1), //同一红伞下
			Array(1442104,15,1), //篝火
			Array(1452100,15,1), //浴桶
			Array(1472111,15,1), //PB克缤
			Array(1482073,1,1) //爱心椅子
);



var mhair = Array(30900, 30910);
function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			if (cm.haveItem(4032226) <= 150 && cm.haveItem(4032226) >= 1) {
var str1 = "";	
           for (var i = 0; i < item.length; i++){
                   str1 += "#v"+item[i][0]+"#";
            }
				cm.sendYesNo("#b#r"+cm.mxdmz()+"冒险岛#b,转生两次每天可领取二个#v4032226#,然后可以来我这里抽取奖品,猪猪太多我可不让抽哦\r\n所有奖品如下#r[真实,无欺骗,100中奖]:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < item.length; i++){
                   str1 += "#v"+item[i][0]+"#";
            }
				cm.sendOk("#b#r"+cm.mxdmz()+"冒险岛#b,转生两次每天可领取二个#v4032226#,然后可以来我这里抽取奖品,最有实力的装备全在下面了哦\r\n所有奖品如下#r[真实,无欺骗,100中奖]:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
			var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
			for(var i = 1;i<=5;i++){
			if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
			cm.sendOk("您至少应该让所有包裹都空出一格");
			cm.dispose();
			return;
			}
			}
			var chance = Math.floor(Math.random()*500);
			var finalitem = Array();
			for(var i = 0 ;i<item.length;i++){
			if(item[i][1] >= chance){
			finalitem.push(item[i]);
			}
			}
			if(finalitem.length != 0){
			var random = new java.util.Random();
			var finalchance = random.nextInt(finalitem.length);
			var itemId = finalitem[finalchance][0];
			var Laba = finalitem[finalchance][2];
			if(ii.getInventoryType(itemId).getType() == 1){
			var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
			} else {
			var toDrop = new net.sf.odinms.client.Equip(itemId,0).copy();
			}
			net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop,-1);
			if(Laba == 1){
			cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMega(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "从飞天猪获得！大家一起恭喜他/她吧！！！",toDrop, true).getBytes());
				
			cm.gainItem(4032226,-1);
			cm.getPlayer().saveToDB(true);
			cm.sendOk("非常感谢参加本次系统活动。多多努力。获取更多的礼物吧！");
			cm.dispose();}
			} else {							
			cm.gainItem(4032226,-1);
			cm.getPlayer().saveToDB(true);
			cm.sendOk("欢迎参加本次系统活动。抱歉你这次没有中奖呢!");
			cm.dispose();
			}
		}
	}
}
