/* 
	
*/
var status = -1;
var hair_Colo_new;
var type = 0;
var beauty = 0;
var dsa = "";

var facetype;

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {

        dsa += "#r ┈┈┈━═☆#i4251202##r   美容  美发   #i4251202# #r☆═━┈┈┈ \r\n\r\n#r" + cm.getVipname() + "  #k#n";

        cm.sendSimple("#r ┈┈┈━═☆#i4251202##r   美容  美发   #i4251202# #r☆═━┈┈┈ \r\n\r\n#r" + cm.getVipname() + "  #k#n您好! \r\n如果您有以下物品我可以为您美容美发：\r\n#i5150040:# 、 #i5150064:#、#i5152053:#、#i5152064:#、#i5151036:##k\r\n#r#L0#随机更换发型(需要#e#r 1 #r#n张#i5150040:#)#l\r\n#r#L1#固定更换发型 (需要#e#r 1 #n张#i5150064:#) #l\r\n#r#L4#更换发型颜色 (需要#e#r 1 #n张#i5151036:#) #l\r\n#r#L2#随机更换脸型 (需要#e#r 1 #n张#i5152053:#) #l\r\n#r#L3#固定更换脸型 (需要#e#r 1 #n张#i5152064:#) #l");

    } else if (status == 1) {


        if (selection == 0) {
            var hair = cm.getPlayerStat("HAIR");
            hair_Colo_new = [];
            beauty = 1;
            if (cm.getPlayerStat("GENDER") == 0) {
                hair_Colo_new = [33000, 33030, 33040, 33050, 33060, 33070, 33080, 33090, 33100, 33110, 33120, 33130, 33140, 33150, 33160, 33170, 33180, 33190, 33200, 33210, 33220, 33230, 33240, 33250, 33260, 33270, 33280, 33290, 33300, 33310, 33320, 33330, 33340, 33350, 33360, 33370, 33380, 33390, 33400, 33410, 33430, 33440, 33450, 33460, 33470, 33480, 33500, 33510, 33520, 33530, 33540, 33550, 33580, 33590, 33600, 33610, 33620, 33630, 33640, 33650, 33710, 33720, 33750, 33660, 33670, 33680, 33690, 33970, 33980, 33990, 33810, 33960, 33730, 33740,33760, 33770, 33800];
            } else {
                hair_Colo_new = [34000, 34010, 34040, 34050, 34060, 34070, 34080, 34090, 34100, 34110, 34120, 34130, 34140, 34150, 34160, 34170, 34180, 34190, 34200, 34210, 34220, 34230, 34240, 34250, 34260, 34270, 34280, 34290, 34300, 34310, 34320, 34330, 34340, 34350, 34360, 34370, 34380, 34400, 34410, 34420, 34430, 34440, 34450, 34470, 34480, 34490, 34510, 34560, 34590, 34600, 34610, 34620, 34630, 34640, 34650, 34670, 34710, 34720, 34750, 34760, 31990, 34880, 34890, 34900, 34910, 34680, 34690, 34660, 34790, 34800, 34860, 34540, 34700, 34730, 34740, 34770, 34830, 34870, 34990];
            }
            for (var i = 0; i < hair_Colo_new.length; i++) {
                hair_Colo_new[i] = hair_Colo_new[i] + (hair % 10);
            }
            cm.sendYesNo(dsa + "使用皇家理发券，可以随机更换发型。你真的要使用#b#t05150040##k，更换发型吗？");

        } else if (selection == 1) {

            var hair = cm.getPlayerStat("HAIR");
            hair_Colo_new = [];
            beauty = 2;
            if (cm.getPlayerStat("GENDER") == 0) {
                hair_Colo_new = [33000, 33030, 33040, 33050, 33060, 33070, 33080, 33090, 33100, 33110, 33120, 33130, 33140, 33150, 33160, 33170, 33180, 33190, 33200, 33210, 33220, 33230, 33240, 33250, 33260, 33270, 33280, 33290, 33300, 33310, 33320, 33330, 33340, 33350, 33360, 33370, 33380, 33390, 33400, 33410, 33430, 33440, 33450, 33460, 33470, 33480, 33500, 33510, 33520, 33530, 33540, 33550, 33580, 33590, 33600, 33610, 33620, 33630, 33640, 33650, 33710, 33720, 33750, 33660, 33670, 33680, 33690, 33970, 33980, 33990, 33810, 33960, 33730, 33740,33760, 33770, 33800];
            } else {
                hair_Colo_new = [34000, 34010, 34040, 34050, 34060, 34070, 34080, 34090, 34100, 34110, 34120, 34130, 34140, 34150, 34160, 34170, 34180, 34190, 34200, 34210, 34220, 34230, 34240, 34250, 34260, 34270, 34280, 34290, 34300, 34310, 34320, 34330, 34340, 34350, 34360, 34370, 34380, 34400, 34410, 34420, 34430, 34440, 34450, 34470, 34480, 34490, 34510, 34560, 34590, 34600, 34610, 34620, 34630, 34640, 34650, 34670, 34710, 34720, 34750, 34760, 31990, 34880, 34890, 34900, 34910, 34680, 34690, 34660, 34790, 34800, 34860, 34540, 34700, 34730, 34740, 34770, 34830, 34870, 34990];
            }
            for (var i = 0; i < hair_Colo_new.length; i++) {
                hair_Colo_new[i] = hair_Colo_new[i] + (hair % 10);
            }
            cm.askAvatar("你厌倦了现在的发型了吗？只要你有 1张 #b顶级皇家理发卷#k，我就可以帮你更换发型!请慢慢挑选自己喜欢的发型～", hair_Colo_new, 5150064);





        } else if (selection == 2) {

            beauty = 3;

        var face = cm.getPlayerStat("FACE");
         facetype = [];
        if (cm.getPlayerStat("GENDER") == 0) {
            facetype = [20020, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030, 20031, 20032, 20033, 20035, 20036, 20037, 20038, 20040, 20043, 20044, 20045, 20046, 20047, 20048, 20049, 20050, 20051, 20052, 20055, 20056, 20057];
        } else {
            facetype = [21020, 21021, 21022, 21023, 21024, 21025, 21026, 21027, 21028, 21029, 21030, 21031, 21033, 21034, 21035, 21036, 21038, 21041, 21042, 21043, 21044, 21045, 21046, 21047, 21048, 21049, 21050, 21053, 21054, 21055];
        }
        for (var i = 0; i < facetype.length; i++) {
            facetype[i] = facetype[i] + face % 1000 - (face % 100);
        }
            cm.sendYesNo(dsa + "使用皇家整容券，可以随机更换发型。你真的要使用#i5152053:# #t5152053#，更换发型吗？");




        } else if (selection == 3) {

            beauty = 4;

        var face = cm.getPlayerStat("FACE");
         facetype = [];
        if (cm.getPlayerStat("GENDER") == 0) {
            facetype = [20020, 20021, 20022, 20023, 20024, 20025, 20026, 20027, 20028, 20029, 20030, 20031, 20032, 20033, 20035, 20036, 20037, 20038, 20040, 20043, 20044, 20045, 20046, 20047, 20048, 20049, 20050, 20051, 20052, 20055, 20056, 20057];
        } else {
            facetype = [21020, 21021, 21022, 21023, 21024, 21025, 21026, 21027, 21028, 21029, 21030, 21031, 21033, 21034, 21035, 21036, 21038, 21041, 21042, 21043, 21044, 21045, 21046, 21047, 21048, 21049, 21050, 21053, 21054, 21055];
        }
        for (var i = 0; i < facetype.length; i++) {
            facetype[i] = facetype[i] + face % 1000 - (face % 100);
        }
            cm.askAvatar("你厌倦了现在的发型了吗？只要你有 1张 #b#t5152064##k，我就可以帮你更换发型!请慢慢挑选自己喜欢的发型～", facetype, 5152064);




        } else if (selection == 4) {

            beauty = 5;

            var currenthaircolo = Math.floor((cm.getPlayerStat("HAIR") / 10)) * 10;
            hair_Colo_new = [];
            for (var i = 0; i < 8; i++) {
                hair_Colo_new[i] = currenthaircolo + i;
            }
            cm.askAvatar("我们可以为你改变头发的颜色。是不是已经厌倦了头发的颜色啊？如果你有#b万能会员卡#k，我就可以给你染发，慢慢挑选你喜欢的颜色吧！", hair_Colo_new, 5151036);









        }


    } else if (status == 2) {

        if (beauty == 2) {

            if (cm.setAvatar(5150064, hair_Colo_new[selection]) == 1) {
                cm.sendOk(dsa + "#d理发好了，怎么样？让朋友们赞叹你的新发型吧!");
            } else {
                cm.sendOk(dsa + "#b您必须要有#e#r 1 #n张#i5150064:# #t5150064#，我才能为你理发!");
            }

        } else if (beauty == 1)  {


        if (cm.setRandomAvatar(5150040, hair_Colo_new) == 1) {
            cm.sendOk(dsa + "好了,让朋友们赞叹你的新发型吧!");
        } else {
            cm.sendOk(dsa + "#b您必须要有#e#r 1 #b#n张#i5150040:# #b#t5150040#，我才能为你理发!");
        }


        } else if (beauty == 3)  {


        if (cm.setRandomAvatar(5152053, facetype) == 1) {
            cm.sendOk(dsa + "好了,让朋友们赞叹你的新脸型吧!");
        } else {
            cm.sendOk(dsa + "#b您必须要有#e#r 1 #b#n张#i5152053:# #b#t5152053#，我才能为你整形!");
        }


        } else if (beauty == 4)  {

            if (cm.setAvatar(5152064, facetype[selection]) == 1) {
                cm.sendOk(dsa + "#d整形成功，怎么样？让朋友们赞叹你的新脸型吧!");
            } else {
                cm.sendOk(dsa + "#b您必须要有#e#r 1 #n张#i5152064:# #t5152064#，我才能为你整形!");
            }



        } else if (beauty == 5)  {


            if (cm.setAvatar(5151036, hair_Colo_new[selection]) == 1) {
                cm.sendOk(dsa + "好了，让朋友们赞叹你的新发色吧！");
            } else {
                cm.sendOk(dsa + "#b您必须要有#e#r 1 #n张#i5151036:# #t5151036#，我才能为你更换发型颜色!");
            }





      }//beauty == 5




        cm.safeDispose();

    }//status == 2


}