/*
	Tia
*/

var status = -1;

var scroll_15 = new Array(
2040020, // 头盔防御卷轴15%
2040022, // 头盔体力卷轴15%
2040044, // 头盔敏捷卷轴15%
2040314, // 耳环智力卷轴15%
2040340, // 耳环装饰体力卷轴15%
2040336, // 耳环装饰敏捷卷轴15%
2040338, // 耳环装饰运气卷轴15%
2040416, // 上衣防御力卷轴15%
2040432, // 上衣力量卷轴15%
2040434, // 上衣体力卷轴15%
2040436, // 上衣运气卷轴15%
2040523, // 全身盔甲敏捷卷轴15%
2040525, // 全身盔甲防御卷轴15%
2040527, // 全身盔甲智力卷轴15%
2040529, // 全身盔甲幸运卷轴15%
2040541, // 全身盔甲力量卷轴15%
2040632, // 裤裙跳跃卷轴15%
2040634, // 裤裙体力卷轴15%
2040616, // 裤裙防御卷轴15%
2040719, // 鞋子敏捷卷轴15%
2040721, // 鞋子跳跃卷轴15%
2040723, // 鞋子速度卷轴15%
2040820, // 手套敏捷卷轴15%
2040822, // 手套攻击卷轴15%
2040832, // 手套体力卷轴15%
2040911, // 盾牌防御卷轴15%
2040938, // 盾牌运气卷轴15%
2040940, // 盾牌体力卷轴15%
2040942, // 盾牌力量卷轴15%
2041043, // 披风魔法防御卷轴15%
2041045, // 披风物理防御卷轴15%
2041047, // 披风体力卷轴15%
2041049, // 披风魔力卷轴15%
2041051, // 披风力卷轴15%
2041053, // 披风智力卷轴15%
2041055, // 披风敏捷卷轴15%
2041057, // 披风幸运卷轴15%
2043012, // 单手剑攻击卷轴15%
2043107, // 单手斧攻击卷轴15%
2043207, // 单手钝器攻击卷轴15%
2043307, // 短剑攻击卷轴15%
2043404, // 刀攻击力卷轴
2045306, // 手炮攻击力卷轴
2045206, // 双弩枪攻击力卷轴
2043707, // 短杖魔力卷轴15%
2043807, // 长杖魔力卷轴15%
2044007, // 双手剑攻击卷轴15%
2044107, // 双手斧攻击卷轴15%
2044207, // 双手钝器攻击卷轴15%
2044307, // 枪攻击卷轴15%
2044407, // 矛攻击卷轴15%
2044507, // 弓攻击卷轴15%
2044607, // 弩攻击卷轴15%
2044707, // 拳套攻击卷轴15%
2044812, // 指节攻击卷轴15%
2044907, // 短枪攻击卷轴15%
2048007, // 宠物移动卷轴15%
2048009 // 宠物跳跃卷轴15%
);

var scroll_60 = new Array(
2040001, // 头盔防御卷轴60%
2040004, // 头盔体力卷轴60%
2040029, // 头盔敏捷卷轴60%
2040301, // 耳环智力卷轴60%
2040326, // 耳环装饰体力卷轴60%
2040317, // 耳环敏捷卷轴60%
2040321, // 耳环装饰运气卷轴60%
2040401, // 上衣防御卷轴60%
2040418, // 上衣力量卷轴60%
2040421, // 上衣体力卷轴60%
2040425, // 上衣运气卷轴60%
2040501, // 全身铠甲敏捷卷轴60%
2040504, // 全身铠甲防御卷轴60%
2040513, // 全身铠甲智力卷轴60%
2040516, // 全身铠甲运气卷轴60%
2040532, // 全身盔甲力量卷轴60%
2040618, // 裤裙跳跃卷轴60%
2040621, // 裤裙体力卷轴60%
2040601, // 裤/裙防御卷轴60%
2040701, // 鞋子敏捷度卷轴60%
2040704, // 鞋子跳跃卷轴60%
2040707, // 鞋子速度卷轴60%
2040801, // 手套敏捷卷轴60%
2040804, // 手套攻击卷轴60%
2040824, // 手套体力卷轴60%
2040901, // 盾牌防御卷轴60%
2040924, // 盾牌运气卷轴60%
2040927, // 盾牌体力卷轴60%
2040931, // 盾牌力量卷轴60%
2041001, // 披风魔防卷轴60%
2041004, // 披风防御卷轴60%
2041007, // 披风体力卷轴60%
2041010, // 披风魔力卷轴60%
2041013, // 披风力量卷轴60%
2041016, // 披风智力卷轴60%
2041019, // 披风敏捷卷轴60%
2041022, // 披风运气卷轴60%
2043001, // 单手剑攻击卷轴60%
2043101, // 单手斧攻击卷轴60%
2043201, // 单手钝器攻击卷轴60%
2043301, // 短剑攻击卷轴60%
2043401, // 刀攻击力卷轴 60%
2045301, // 手炮攻击力卷轴
2045201, // 双弩枪攻击力卷轴
2043701, // 短杖魔力卷轴60%
2043801, // 长杖魔力卷轴60%
2044001, // 双手剑攻击卷轴60%
2044101, // 双手斧攻击卷轴60%
2044201, // 双手钝器攻击卷轴60%
2044301, // 枪攻击卷轴60%
2044401, // 矛攻击卷轴60%
2044501, // 弓攻击卷轴60%
2044601, // 弩攻击卷轴60%
2044701, // 拳套攻击卷轴60%
2044801, // 拳甲攻击卷轴60%
2044901, // 短枪攻击卷轴60%
2048001, // 宠物速度卷轴60%
2048004 // 宠物跳跃力卷轴60%
);

var scroll_10 = new Array(
2040002, // 头盔防御卷轴10%
2040005, // 头盔体力卷轴10%
2040031, // 头盔敏捷卷轴10%
2040302, // 耳环智力卷轴10%
2040328, // 耳环装饰体力卷轴10%
2040318, // 耳环敏捷卷轴10%
2040323, // 耳环装饰运气卷轴10%
2040402, // 上衣防御卷轴10%
2040419, // 上衣力量卷轴10%
2040422, // 上衣体力卷轴10%
2040427, // 上衣运气卷轴10%
2040502, // 全身铠甲敏捷卷轴10%
2040505, // 全身铠甲防御卷轴10%
2040514, // 全身铠甲智力卷轴10%
2040517, // 全身铠甲运气卷轴10%
2040534, // 全身盔甲力量卷轴10%
2040619, // 裤裙跳跃卷轴10%
2040622, // 裤裙体力卷轴10%
2040602, // 裤/裙防御卷轴10%
2040702, // 鞋子敏捷度卷轴10%
2040705, // 鞋子跳跃卷轴10%
2040708, // 鞋子速度卷轴10%
2040802, // 手套敏捷卷轴10%
2040805, // 手套攻击卷轴10%
2040825, // 手套体力卷轴10%
2040902, // 盾牌防御卷轴10%
2040925, // 盾牌运气卷轴10%
2040928, // 盾牌体力卷轴10%
2040933, // 盾牌力量卷轴10%
2041002, // 披风魔防卷轴10%
2041005, // 披风防御卷轴10%
2041008, // 披风体力卷轴10%
2041011, // 披风魔力卷轴10%
2041014, // 披风力量卷轴10%
2041017, // 披风智力卷轴10%
2041020, // 披风敏捷卷轴10%
2041023, // 披风运气卷轴10%
2043002, // 单手剑攻击卷轴10%
2043102, // 单手斧攻击卷轴10%
2043202, // 单手钝器攻击卷轴10%
2043302, // 短剑攻击卷轴10%
2043402, // 刀攻击力卷轴 10%
2045302, // 手炮攻击力卷轴
2045202, // 双弩枪攻击力卷轴
2043702, // 短杖魔力卷轴10%
2043802, // 长杖魔力卷轴10%
2044002, // 双手剑攻击卷轴10%
2044102, // 双手斧攻击卷轴10%
2044202, // 双手钝器攻击卷轴10%
2044302, // 枪攻击卷轴10%
2044402, // 矛攻击卷轴10%
2044502, // 弓攻击卷轴10%
2044602, // 弩攻击卷轴10%
2044702, // 拳套攻击卷轴10%
2044802, // 拳甲攻击卷轴10%
2044902, // 短枪攻击卷轴10%
2048002, // 宠物速度卷轴10%
2048005 // 宠物跳跃力卷轴10%
);

var firstSel = 0;

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 2) {
            cm.sendOk("This is a serious matter! Don't bother me if you are unwilling to do it.");
            cm.safeDispose();
            return;
        } else if (status == 4 || status == 0 || status == 1) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        cm.sendNext("本店出事各种卷轴，你是否有兴趣购买一些卷轴呢？#b\r\n#L0#购买 65% 卷轴#l\r\n#L1#购买 15% 卷轴#l#k");
    } else if (status == 1) {
        firstSel = selection;
        cm.sendYesNo("呵呵，看来对这个非常有兴趣，我这还有 #b10%#k 成功几率的卷，你是否要看一下呢？")
    } else if (status == 2) {
        cm.sendNext("Now here's the ingredients for resurrection of the ancient black magic scroll. \n\r #i4011006# #t4011006# x1 \n\r #i4021007# #t4021007# x1 \n\r #i4021008# #t4021008# x1 \n\r Mesos 500,000 \n\r\n\r Lastly, it will also require the 10% scroll.");
    } else if (status == 3) {
        var message = "以下就是我出售的卷轴列表 : \n\r";
        if (firstSel == 0) {
            for (var i = 0; i < scroll_15.length; i++) {
                    message += " #L" + i + "##i" + (scroll_15[i] - 1) + "# #t" + (scroll_15[i] - 1) + "##l \n\r";
            }
        } else if (firstSel == 1) {
            for (var i = 0; i < scroll_15.length; i++) {
                    message += " #L" + i + "##i" + scroll_15[i] + "# #t" + scroll_15[i] + "##l \n\r";
            }
        }
        cm.sendSimple(message);
    } else if (status == 4) {
        var prompt = -1;
        if (selection >= 0 && selection <= scroll_15.length) {
            if (!cm.haveItem(firstSel == 0 ? scroll_60[selection] : scroll_10[selection])) {
                prompt = firstSel == 0 ? scroll_60[selection] : scroll_10[selection];
            } else if (cm.getMeso() < 500000) {
                prompt = -2;
            } else if (!cm.haveItem(4011006)) { // 黄金
                prompt = 4011006;
            } else if (!cm.haveItem(4021008)) { // 黑水晶
                prompt = 4021008;
            } else if (!cm.haveItem(4021007)) { // 钻石
                prompt = 4021007;
            } else if (!cm.canHold(firstSel == 0 ? (scroll_15[selection] - 1) : scroll_15[selection], 1)) {
                prompt = -3;
            }
        } else { // Hack
            cm.dispose();
            return;
        }
        if (prompt == -1) {
            cm.gainMeso( - 500000);
            cm.gainItem(4011006, -1);
            cm.gainItem(4021008, -1);
            cm.gainItem(4021007, -1);
            cm.gainItem(firstSel == 0 ? scroll_60[selection] : scroll_10[selection], -1);
            if (Math.floor(Math.random() * 100) < 90) {
                if (firstSel == 0) {
                    cm.gainItem(scroll_15[selection] - 1, 1);
                    cm.sendOk("#i" + (scroll_15[selection] - 1) + "# #t" + (scroll_15[selection] - 1) + "# \n\r Handle this with care! It's an ancient scroll with mystical magic powers.");
                } else if (firstSel == 1) {
                    cm.gainItem(scroll_15[selection], 1);
                    cm.sendOk("#i" + scroll_15[selection] + "# #t" + scroll_15[selection] + "# \n\r Handle this with care! It's an ancient scroll with mystical magic powers.");
                }
            } else {
                cm.sendOk("Woops! The scroll is destroyed!")
            }
            cm.safeDispose();
        } else {
            if (prompt == -2) {
                cm.sendOk("It appears that you are short of 500,000 mesos.");
            } else if (prompt == -3) {
                cm.sendOk("It seems that you do not have the appropriate USE space.");
            } else {
                cm.sendOk("It appears that you are short of #i" + prompt + "# #t" + prompt + "#.");
            }
            cm.safeDispose();
        }
    }
}