var hair_Colo_new = [];
var status = -1;
var beauty = -1;
var hairCard = [5150040, 5150064, 5150100, 5150119, 5150126, 5150123, 5150124, 5150135, 5150139];
var types = -1;
var ct = -1;
var isSecond = false;
var isAngel;
function start() {
    isAngel = cm.getBeginner() == 6001;
    if (isAngel) {
        cm.sendChoiceAngle();
        return;
    } else {
        action(1, 0, 0);
    }
}

function action(mode, type, selection) {

    if (mode == 0) {
        cm.dispose();
        return;
    } else if (mode == 1) {
        status++;
    } else {
        status--;
    }

    switch (status) {
        case 0:
            if (isAngel) {
                isSecond = selection != 0;
            }
            cm.sendSimple("你好。我是大头国的#b#p1012117##k。如果你有980点卷或者抵用，我可以为你设计一个发型。怎么样？\r\n#b#L0#更换发型 (使用皇家理发券)#l \r\n#b#L1#更换发型 (使用顶级皇家理发券)#l\r\n#b#L2#更换发型 (使用经典皇家发型)#l\r\n#b#L3#更换发型（使用RED皇家理发券）#l\r\n#b#L4#更换发型（使用周年庆皇家理发券）#l \r\n#b#L5#更换发型（毛莫理发券）#l \r\n#b#L6#更换发型（九尾狐理发券）#l\r\n#b#L7#更换发型（闪耀之星皇家理发券）#l#l\r\n#b#L8#更换发型（奇迹皇家理发券）#l");
            break;
        case 1:
            beauty = selection;
            getHairID(selection);
            var hair = isSecond ? cm.getPlayer().getSecondHair() : cm.getPlayerStat("HAIR");
            var iNow = 0;
            var hairTypeNow = [];
            for (var i = 0; i < hair_Colo_new.length; i++) {
                if (hair_Colo_new[i] != hair - hair % 10) {
                    hairTypeNow[iNow++] = hair_Colo_new[i] + (hair % 10);
                }
            }
            hair_Colo_new = cm.getCanHair(hairTypeNow);
            cm.sendSimple("那么你想...\r\n#b#L0#看看这都有什么发型#l\r\n#b#L1#更换发型#l");
            break;
        case 2:
            if (hair_Colo_new.length == 0) {
                cm.sendOk("该理发券正在整理中....");
                cm.dispose();
            } else if (selection == 0) {
                types = 0;
                cm.askAvatar("那么请随便随便看..", hair_Colo_new, hairCard, isSecond);

            } else if (selection == 1) {
                types = 1;
                if (beauty != -1) {
                    cm.sendYesNo("使用#b#t" + hairCard[beauty] + "##k，可以随机更换发型。你真的要使用#b#t0" + hairCard[beauty] + "##k，更换发型吗？");
                } else {
                    cm.sendOk("出现未知错误");
                    cm.dispose();
                }
            }
            break;
        case 3:
            if (types == 0) {
                status = 0;
                action(mode, type, beauty);
            } else {
                if (cm.setRandomAvatar(hairCard[beauty], hair_Colo_new, isSecond) == 1) {
                    cm.sendOk("好了,让朋友们赞叹你的新发型吧!");
                    cm.safeDispose();
                } else {
                    cm.sendYesNo("您没有可使用的会员卡。是否想消耗980抵用券/点卷直接购买使用？");
                }
            }
            break;
        case 4:
            status = 2;
            if (cm.getChar().getCSPoints(1) >= 980) {
                ct = 1;
            }
            if (cm.getChar().getCSPoints(2) >= 980) {
                ct = 2;
            }
            if (ct != -1) {
                if (cm.gainNX(ct, -980)) {
                    cm.gainItem(hairCard[beauty], 1);
                } else {
                    cm.sendOk("你好像没有足够的点卷/抵用卷!");
                    cm.dispose();
                }
            } else {
                beauty = -1;
            }
            action(mode, type, selection);
            break;
        default:
            cm.dispose();
            break;
    }
}

function getHairID(selection) {
    switch (selection) {
        case 0://皇家理发券
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [30010, //黑色贝吉塔发型
				    33255, //黑色妖精维英发型
                    33380, //白色TOP发型
				    33277, //高富帅发型
                    33500, //白色潮人发型
                    33310, //白色唤灵男发型
                    33510, //白色机械师发型
                    30660, //白色运动发型
                    33080, //白色战神头
                    30820, //超级明星美发型
                    35530, //冲击发型
                    36570, //初心者发型
                    36790, //废弃都市发型
                    36100, //黑豆刨冰发型
                    35800, //黑色 셀러브리티 헤어
                    30830, //黑色ALEX发型
                    30860, //黑色BOSS发型
                    35130, //黑色Cool Boy发型
                    35360, //黑色Cool Boy发型
                    35000, //黑色IT男发型
                    33390, //黑色KENJI发型
                    33240, //黑色OM型男发型
                    35470, //黑色Rock Boy发型
                    33230, //黑色爱国发型
                    33200, //黑色暗影男发型
                    30770, //黑色昂德莱卷发
                    35490, //黑色奥德赛发型
                    33590, //黑色巴黎发型
                    40280, //黑色白魔法师发型 
                    36830, //黑色白银雨发型
                    30930, //黑色败金发型
                    30160, //黑色板寸
                    30130, //黑色半遮脸发型
                    36000, //黑色半遮眼男发型
                    36180, //黑色棒棒糖发型
                    36540, //黑色包菜发型
                    36430 //黑色包子发型
                ];
            } else {
                hair_Colo_new = [
                    37970, //奥利维亚发型
                    38310, //白色巴尼女孩发型
                    34290, //白色唤灵女发型
                    34480, //白色机械师女性发型
                    37060, //白色人鱼公主发型
                    34090, //白色战神头
                    31800, //超级明星美发型
                    37570, //初心者发型
                    31260, //黑色2046之王靖雯头
                    31700, //黑色CUTY BABY
                    34060, //黑色gaga头
                    38600, //黑色My Girl发型
                    38580, //黑色Sunshine Girl发型
                    37200, //黑色S波浪长发
                    34770, //黑色阿莉亚发型
                    34200, //黑色暗影女发型
                    38590, //黑色奥德赛发型
                    37000, //黑色奥尔卡发型
                    37850, //黑色奥利维亚发型
                    37820, //黑色奥罗拉发型
                    37030, //黑色白富美发型
                    37670, //黑色斑驳发型
                    38470, //黑色宝贝甜心发型
                    34190, //黑色豹弩I女发型
                    34300, //黑色豹弩女发型
                    37140, //黑色爆莉萌天使发型
                    31040, //黑色边分翘发
                    31300, //黑色辫辫发型
                    31030, //黑色辫子
                    38480, //黑色冰雪气质发型
                    34040, //黑色波波头
                    37410, //黑色波兰发型
                    34730, //黑色波浪蓬蓬头
                    34120, //黑色波希米亚发型
                    41410, //黑色不对称发型 
                    41360, //黑色布莱尔女士发型  
                    34750, //黑色侧扎长波浪发型
                    38050, //黑色层次感碎发
                    37710, //黑色超级巨星发型-女神1号
                    38100 //黑色超级巨星发型-女神2号
                ];
            }
            break;
        case 1://顶级皇家理发券:5150064
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [33370, //黑色不均衡发型
                    33320, //黑色豹弩男发型
                    33970, //黑色爆气勇士发型
                    30320, //黑色爆炸头
                    30260, //黑色边分1
                    33070, //黑色辫子头
                    33730, //黑色波浪马尾辫
                    33370, //黑色不均衡发型
                    36820, //黑色布雷斯发型
                    36230, //黑色层次发型
                    36910, //黑色超胆侠发型
                    36720, //黑色超级巨星发型-男神1号
                    36810, //黑色超级巨星发型-男神2号
                    30110, //黑色朝天发型
                    30880, //黑色潮流发型
                    36290, //黑色潮男短发
                    35220, //黑色潮男发型
                    33660, //黑色潮男气质短发
                    40260, //黑色潮男碎发
                    33060, //黑色城市男孩发型
                    33300, //黑色虫虫发型
                    30400, //黑色虫虫头
                    30550, //黑色传统发式
                    35720, //黑色纯真年代发型
                    33930, //黑色粗犷男人发型
                    30870, //黑色粗旷发型
                    30740, //黑色大光头
                    35550, //黑色呆萌宝宝发型
                    35460, //黑色呆萌少年发型
                    36580, //黑色蛋糕卷发型
                    33820, //黑色刀刃发型
                    35510, //黑色迪伦发型
                    36630, //黑色电蓬发型
                    30890, //黑色东方神秘发
                    40040, //黑色冬雪发型
                    36920 //黑色动漫少年发型
                ];
            } else {
                hair_Colo_new = [
                    34000, //黑色冲天辫
                    34280, //黑色虫虫发型
                    31550, //黑色传统发式
                    34710, //黑色创意棒子发型
                    37380, //黑色春丽发型
                    34790, //黑色春之华尔兹发型
                    38730, //黑色纯真年代发型
                    31620, //黑色大姐大发型
                    34890, //黑色大小姐发型
                    38680, //黑色呆萌兔兔发型
                    34810, //黑色刀刃发型
                    34720, //黑色灯笼辫子发型
                    34960, //黑色迪纳卡发型
                    34680, //黑色迪斯科发型
                    34170, //黑色叮铃发型
                    37900, //黑色动漫少女发型
                    34390, //黑色独角辫
                    37120, //黑色端正的假小子发型
                    31100, //黑色短发
                    31510, //黑色短发
                    31290, //黑色短翘发
                    34410, //黑色恶魔发型
                    31630, //黑色法式古典发型
                    31220, //黑色分边2
                    37860, //黑色粉小妹发型
                    31780, //黑色风度发型
                    38010, //黑色风一样的女纸发型
                    31310, //黑色风韵发型
                    34560, //黑色风中凌乱女生发型
                    38490, //黑色峰峰发型
                    37370, //黑色佛罗拉发型
                    37450, //黑色复仇者女发型
                    34910, //黑色干练OL发型
                    34310, //黑色哥特萝莉发型
                    37350, //黑色哥特萝莉发型
                    31820, //黑色格瑞丝发型
                    31380 //黑色个性主播发型
                ];
            }
            break;
        case 2://经典皇家发型:5150100 
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    35270, //黑色都教授发型
                    33420, //黑色独角辫
                    33720, //黑色独角兽发型
                    33750, //黑色端正柔顺发型
                    36400, //黑色短卷发
                    33530, //黑色恶魔发型
                    35280, //黑色发胶发型
                    33580, //黑色发胶尖尖发型
                    33220, //黑色发如雪发型
                    36340, //黑色废都风格发型
                    30800, //黑色风度发型
                    30730, //黑色风影头
                    33550, //黑色风中凌乱男生发型
                    35300, //黑色峰峰发型
                    36460, //黑色复仇者男发型
                    36370, //黑色高鬓角毛毛头
                    33270, //黑色高富帅发型
                    30310, //黑色瓜皮发型
                    35190, //黑色乖宝贝发型
                    36490, //黑色关谷发型
                    33400, //黑色管家发型
                    33410, //黑色光亮分层发型
                    36520, //黑色贵公子发型
                    30240, //黑色海藻头
                    36740, //黑色海藻头发型
                    36590, //黑色害羞宝宝头
                    30080, //黑色罕见发型
                    30520, //黑色恨特思
                    33460, //黑色后倒发型
                    33340, //黑色后翘翘发型
                    30250, //黑色花菜头
                    33940, //黑色花花少爷发型
                    30350, //黑色花刘海发型
                    33520, //黑色花样美男发型
                    30910//黑色花样男子发型
                ];
            } else {
                hair_Colo_new = [
                    34380, //黑色公主发型
                    37610, //黑色公主姬发型
                    31180, //黑色公主头
                    38930, //黑色宫廷双马尾发型
                    31060, //黑色乖乖女
                    38770, //黑色哈允德发型
                    34840, //黑色海螺姑娘发型
                    37810, //黑色海藻头发型
                    37950, //黑色海藻头发型
                    37050, //黑色害羞乖女发型
                    37400, //黑色狐尾发型
                    34100, //黑色蝴蝶结发型
                    41440, //黑色花丛发型 
                    34430, //黑色花朵发型
                    37230, //黑色花骨朵发型
                    34900, //黑色花环仙女发型
                    37700, //黑色花妖精发型
                    34630, //黑色华丽女王发型
                    31900, //黑色活泼辫子发型
                    37490, //黑色尖兵女发型
                    37600, //黑色剑豪女发型
                    37980, //黑色渐变陶瓷卷发型
                    38390, //黑色街拍潮女发型
                    31530, //黑色洁西卡发
                    31320, //黑色菊花头
                    31020, //黑色卷发
                    31480, //黑色卷发
                    41120, //黑色卡门发型
                    34150, //黑色可爱啾啾头
                    37190, //黑色可爱囡囡发型
                    34760, //黑色可爱桃子发型
                    37210, //黑色可爱淘发型
                    38640, //黑色可爱甜心发型
                    31680, //黑色可爱小姐发型
                    37020 //黑色克里斯丁发型
                ];
            }
            break;
        case 3://RED皇家理发券 5150119
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    35620, //黑色花样欧巴发型
                    35780, //黑色花样少年发型
                    33100, //黑色怀旧少爷发
                    33190, //黑色唤灵I男发型
                    36020, //黑色火魔发型
                    33990, //黑色火焰男发型
                    30360, //黑色火隐鹿丸头
                    33830, //黑色疾风发型
                    33170, //黑色佳佳发型
                    36470, //黑色尖兵男发型
                    36210, //黑色尖刺发型
                    36750, //黑色简约发型
                    30720, //黑色街头艺人发型
                    33440, //黑色街舞明星发型
                    30560, //黑色精悍短发
                    36980, //黑色精灵王子发型
                    40090, //黑色精英特工发型
                    35240, //黑色镜头感发型
                    35520, //黑色就是任性发型
                    35050, //黑色飓风发型
                    36150, //黑色撅撅发型
                    30950, //黑色俊美中发
                    36600, //黑色坎纳男孩发型
                    33950, //黑色看不见发型
                    33140, //黑色可爱啾啾头
                    36140, //黑色可爱洋葱发型
                    33610, //黑色克洛乌发型
                    35690, //黑色空气感碎发
                    30540, //黑色酷发
                    36550, //黑色狂欢朋克发型
                    33050, //黑色狂狮发型
                    30440, //黑色狂野发
                    33780, //黑色狂野精神发型
                    30270, //黑色瘌痢头
                    35600, //黑色蓝莓之恋发型
                    35110 //黑色浪客发型
                ];
            } else {
                hair_Colo_new = [
                    34010, //黑色空气卷发型
                    37324, //紫丁香发型					
                    41090, //黑色空气刘海发型
                    31870, //黑色孔雀发型
                    37580, //黑色狂欢个性发型
                    38520, //黑色狂热玛利亚发型
                    34270, //黑色拉直发型
                    31190, //黑色辣妹头
                    34340, //黑色浪漫编织发型
                    31370, //黑色浪漫麻花辫发型
                    38690, //黑色浪漫满屋发型
                    38420, //黑色浪漫甜心发型
                    37990, //黑色浪漫小啾发型
                    31770, //黑色乐乐头
                    34490, //黑色丽亚娜发型
                    31170, //黑色栗米发
                    34330, //黑色邻家妹发型
                    31210, //黑色刘海
                    31990, //黑色龙神女发型
                    34070, //黑色乱发
                    34440, //黑色罗曼蒂克发型
                    38810, //黑色萝莉发型
                    34250, //黑色洛小蒙发型
                    38460, //黑色麻花辫发型
                    31860, //黑色马来西亚发型1
                    31090, //黑色马尾
                    37520, //黑色麦穗双马尾
                    34400, //黑色麦穗头
                    37530, //黑色满天星发型
                    34450, //黑色猫咪发型
                    34510, //黑色美人鱼发型
                    37730, //黑色魅力短发
                    34780, //黑色魅力卷发
                    34870, //黑色萌动发型
                    37690, //黑色萌萌狐仙发型
                    37920, //黑色萌萌兔耳发型
                    38360, //黑色梦幻短发发型
                    37760 //黑色梦幻女生发型
                ];
            }
            break;
        case 4://周年庆皇家理发券 5150126
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    33360, //黑色老克勒发型
                    33470, //黑色冷峻发型
                    36040, //黑色冷酷城市发型
                    36360, //黑色栗子发型
                    33710, //黑色亮泽小尾巴发型
                    30120, //黑色靓仔发型
                    36220, //黑色邻家小弟发型
                    35090, //黑色凌乱碎发发型
                    30750, //黑色六点
                    30940, //黑色龙斗士发型
                    30380, //黑色龙孩发型
                    35790, //黑色龙卷风发型
                    33150, //黑色龙神男发型
                    30210, //黑色露耳短发
                    30780, //黑色乱马发式
                    30180, //黑色乱碎
                    36850, //黑色伦多发型
                    30510, //黑色洛基发
                    33770, //黑色率真短发
                    35350, //黑色麦香飞舞发型
                    33430, //黑色猫耳发型
                    30220, //黑色猫王头
                    33630, //黑色毛毛干练发型
                    35200, //黑色魅力潮男发型
                    36450, //黑色魅力公子发型
                    36690, //黑色萌萌狐仙发型
                    36900, //黑色萌萌兔耳发型
                    30530, //黑色猛男头
                    36030, //黑色米哈尔发型
                    35710, //黑色苗苗发型
                    36080, //黑色摩诃发型
                    35330, //黑色摩卡少年发型
                    30670, //黑色摩斯发型
                    30190, //黑色蘑菇头
                    30990, //黑色莫西干发型
                    30280, //黑色莫西干头
                    35070 //黑色纳豆发型
                ];
            } else {
                hair_Colo_new = [
                    37940, //黑色梦幻飘逸长发
                    37960, //黑色梦幻飘逸长发
                    37660, //黑色梦魔发型
                    34660, //黑色迷你兔兔发型
                    37310, //黑色棉花糖发型
                    37440, //黑色茉莉发型
                    37300, //黑色木灵发型
                    31270, //黑色妞妞头
                    37280, //黑色牛角发型
                    37910, //黑色牛角面包发型
                    31070, //黑色浓密卷发
                    37240, //黑色诺巴短发发型
                    37250, //黑色诺巴长卷发型
                    38070, //黑色女版草莓初恋发型
                    31590, //黑色女神发型
                    31840, //黑色女性爆炸发型
                    37720, //黑色帕帕亚发型
                    37630, //黑色泡泡卷发型
                    31410, //黑色配角头
                    34360, //黑色蓬松麻花辫
                    31360, //黑色蓬松马尾发型
                    31750, //黑色蓬松松卷发
                    37800, //黑色皮皮长发
                    38940, //黑色飘逸梦幻发型
                    37180, //黑色苹果啾啾发型
                    34740, //黑色骑士发型
                    31930, //黑色气质OL发型
                    38410, //黑色气质淑女发型
                    31230, //黑色俏丽麻花辫
                    38160, //黑色俏皮妞妞发型
                    38800, //黑色俏皮小呆毛发型
                    38080, //黑色俏皮小乖发型
                    38740, //黑色俏皮小妞
                    38220, //黑色翘麻花发型
                    38400, //黑色轻舞飞扬发型
                    41080 //黑色轻盈少女马尾
                ];
            }
            break;
        case 5://毛莫理发券 5150123
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    35560, //黑色奶油小生发型
                    36770, //黑色男版草莓初恋发型
                    33260, //黑色南哈特发型
                    36130, //黑色难掩帅气发型
                    35020, //黑色鸟巢发型
                    33810, //黑色柠檬发型
                    30370, //黑色派勒发
                    36700, //黑色泡泡发型
                    35420, //黑色蓬蓬头发型
                    36390, //黑色蓬蓬头发型
                    40030, //黑色蓬松短发
                    30490, //黑色蓬松发
                    30330, //黑色蓬松发型
                    33600, //黑色霹雳发型
                    30450, //黑色飘柔发型
                    36300, //黑色飘逸公子发型
                    30760, //黑色瓢瓢头
                    36940, //黑色苹果头发型
                    33740, //黑色骑士发型
                    36670, //黑色前焦点发型
                    33350, //黑色前翘翘发型
                    36620, //黑色巧克力发型
                    30920, //黑色俏皮短发
                    36650, //黑色亲和发型
                    35760, //黑色青涩少年发型
                    33680, //黑色情人结发型
                    40100, //黑色秋天的童话发型
                    30620, //黑色日式发型
                    30700, //黑色洒脱发式
                    30410, //黑色三谷头
                    40250, //黑色闪烁之星发型  
                    36090, //黑色少年南哈特发型
                    36240, //黑色少年勇士发型
                    33700, //黑色奢华发型
                    30290, //黑色绅士头
                    30790, //黑色狮子头
                    33090, //黑色狮子头
                    30900 //黑色时髦短发
                ];
            } else {
                hair_Colo_new = [
                    37130, //黑色清纯的圆鼓鼓发型
                    31130, //黑色清纯女发
                    41190, //黑色清纯束发
                    31330, //黑色清纯学生发型
                    31660, //黑色清凉发髻
                    34590, //黑色清爽活泼小辫
                    31920, //黑色清爽盘发
                    34700, //黑色清新短发
                    38620, //黑色清新短发发型
                    34880, //黑色清新短卷发型
                    31670, //黑色秋秋发型
                    37750, //黑色人鱼公主发型
                    37430, //黑色柔亮短发
                    31950, //黑色柔美中发
                    38610, //黑色柔顺淑女发型
                    31690, //黑色洒脱发型
                    38500, //黑色森林波浪卷发型
                    31830, //黑色沙宣发型
                    31880, //黑色杉菜发型
                    41340, //黑色闪烁之星发型 
                    31910, //黑色上海小姐发型
                    38130, //黑色上弦月发型  
                    38350, //黑色时尚潮女发型
                    31720, //黑色时尚挑染发型
                    31350, //黑色手鞠头
                    31140, //黑色书童女
                    31110, //黑色淑女头
                    37220, //黑色双层质感长发
                    34140, //黑色双刀I女发型
                    31560, //黑色双色发
                    31850, //黑色水貂发型
                    38760, //黑色水晶女孩
                    38630, //黑色水漾女生发型
                    37290, //黑色睡意慵懒发型
                    37340, //黑色丝柔发型
                    34240, //黑色厮守发型
                    31080 //黑色四六分
                ];
            }
            break;
        case 6://九尾狐理发券  5150124
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    30480, //黑色时髦发
                    36510, //黑色双彩发型
                    33130, //黑色双刀I男发型
                    35650, //黑色水晶男孩
                    36480, //黑色斯乌发型
                    36760, //黑色随风发型
                    30680, //黑色随意发型
                    30200, //黑色碎发
                    30650, //黑色碎刘海短发
                    30710, //黑色台湾男性发型1
                    30600, //黑色泰国男性发型
                    36840, //黑色提斯发型
                    30810, //黑色天然碎发型
                    33330, //黑色天使发型
                    35340, //黑色透气蓬松卷卷
                    33490, //黑色秃头
                    33670, //黑色王子尾羽发型
                    30470, //黑色微风发
                    36050, //黑色微卷中发
                    36380, //黑色维多利亚发型
                    36930, //黑色未来战士发型
                    35010, //黑色我的王子发型
                    33640, //黑色我最帅发型
                    36640, //黑色乌鸦发型
                    36330, //黑色午夜发型
                    36120, //黑色武道魂发型
                    30140, //黑色武士头
                    33290, //黑色希希发型
                    33210, //黑色犀利哥发型
                    30640, //黑色虾皮发型
                    30150, //黑色侠客头
                    35450, //黑色俠客的新髮型
                    35100, //黑色下弦月发型 
                    33000, //黑色贤重发型
                    36160, //黑色香吉发型
                    36680 //黑色潇洒短发
                ];
            } else {
                hair_Colo_new = [
                    34970, //黑色苏子叶发型
                    38650, //黑色随意马尾发型
                    31940, //黑色随意长卷发
                    37590, //黑色隼人马尾辫
                    34620, //黑色糖果蓬蓬发型
                    37100, //黑色桃乐丝发型
                    34470, //黑色淘气女孩苹果头
                    38790, //黑色淘气女生发型
                    37680, //黑色天然直发发型
                    38110, //黑色恬静女生发型
                    38700, //黑色甜美淑女发型
                    38710, //黑色甜美淑女发型
                    34800, //黑色甜蜜冰沙发型
                    31610, //黑色甜蜜蜜发型
                    31740, //黑色甜甜卷
                    31450, //黑色甜心发型
                    31340, //黑色调皮乖乖头
                    31890, //黑色调皮少女发型
                    37090, //黑色婷可贝鲁发型
                    38330, //黑色童稚发型
                    34460, //黑色秃头
                    31760, //黑色娃娃辫子
                    31250, //黑色娃娃头
                    37010, //黑色瓦莱莉发型
                    37500, //黑色维丽尔发型
                    37930, //黑色未来女战士发型
                    38060, //黑色温婉发型
                    34260, //黑色雯子花苞头
                    38040, //黑色我的公主发型
                    34080, //黑色我正烫发发型
                    34990, //黑色武道魂发型
                    34940, //黑色希纳斯发型
                    34830, //黑色希神发型
                    38090, //黑色侠女发型
                    38450, //黑色俠客的新髮型
                    31400, //黑色夏日短发
                    37740, //黑色仙草2号发型
                    37510 //黑色仙草发型
                ];
            }
            break;
        case 7://闪耀之星皇家理发券 5150135
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    36950, //黑色潇洒哥发型
                    33280, //黑色潇洒男发型
                    33540, //黑色小宝发型
                    33980, //黑色小刺猬发型
                    33690, //黑色小鬼头发型
                    36860, //黑色小卷毛发型
                    30630, //黑色小刘海发型
                    30840, //黑色小绵羊发型
                    40000, //黑色小绅士发型
                    36880, //黑色小狮子发型
                    35260, //黑色小帅发型
                    36010, //黑色小硕发型
                    30590, //黑色小碎卷发型
                    35770, //黑色小淘气发型
                    36730, //黑色小王子发型
                    35680, //黑色小细节发型
                    35120, //黑色小英俊发型
                    36800, //黑色小正太发型
                    33790, //黑色新古典短发
                    40020, //黑色型男发型
                    36890, //黑色熊孩纸发型
                    30050, //黑色休闲发型
                    33960, //黑色羞涩男孩发型
                    36440, //黑色叙事诗发型
                    30460, //黑色旋风发
                    36260, //黑色炫酷短发
                    36350, //黑色炫目发型
                    33030, //黑色学童发型
                    33800, //黑色炎男发型
                    30570, //黑色阳光男发型
                    33250, //黑色妖精维英发型
                    30610, //黑色摇滚发型
                    35040, //黑色摇滚发型
                    35660, //黑色摇滚少年发型
                    35630, //黑色一米阳光发型
                    36070, //黑色伊卡尔特发型
                    33620 //黑色艺术家发型
                ];
            } else {
                hair_Colo_new = [
                    34670, //黑色香水月季发型
                    37460, //黑色小奥尔卡发型
                    31640, //黑色小波浪发型
                    37640, //黑色小呆毛发型
                    37880, //黑色小呆毛发型
                    34210, //黑色小公主发型
                    34690, //黑色小葫芦卷发型
                    31160, //黑色小髻
                    38120, //黑色小静公主头发型
                    38150, //黑色小可爱发型
                    31200, //黑色小可爱头发
                    31710, //黑色小萝莉发型
                    37560, //黑色小清新发型
                    38320, //黑色小颂伊发型
                    37260, //黑色小天使发型
                    34850, //黑色小丫环发型
                    34600, //黑色谢丽尔发型
                    31490, //黑色新生代发型
                    31730, //黑色新叶发型
                    37650, //黑色星星糖发型
                    37890, //黑色熊孩纸发型
                    37840, //黑色修嘉发型
                    38430, //黑色学生妹发型
                    34820, //黑色雪姬发型
                    31810, //黑色丫丫发型
                    34350, //黑色宴会发型
                    31000, //黑色羊角辫
                    37420, //黑色羊角角发型
                    31460, //黑色洋葱头
                    34640, //黑色洋气短发
                    34230, //黑色妖精波波头
                    31240, //黑色野人头
                    31650, //黑色一撮毛
                    31440, //黑色一条额前发
                    31420, //黑色伊角头
                    34950, //黑色伊莉娜发型
                    34610 //黑色银河发型
                ];
            }
            break;
        case 8://奇迹皇家理发券 5150139
            if (cm.getPlayerStat("GENDER") == 0) {//男
                hair_Colo_new = [
                    36990, //黑色艺术青年发型
                    33480, //黑色艺术长发
                    33650, //黑色意大利男士发型
                    36110, //黑色银河牛仔发型(男)
                    33760, //黑色婴儿卷发
                    36410, //黑色鹰嘴发型
                    35440, //黑色影碟发型
                    35290, //黑色优质男生发型
                    36310, //黑色圆嘟嘟发型
                    30850, //黑色运动发型
                    36530, //黑色张扬发型
                    30230, //黑色长刺发
                    30060, //黑色长甩发型
                    36710, //黑色遮眼发型
                    33180, //黑色真相发型
                    36420, //黑色指挥家发型
                    35430, //黑色质感碎发发型
                    30170, //黑色中板寸
                    30300, //黑色中垂发
                    30340, //黑色中分披肩发
                    36250, //黑色忠厚的勇士发型
                    33120, //黑色自闭发型
                    30420, //黑色宗次郎头
                    36560, //黑色하이브리드헤어
                    30070, //黄色黄鸟发型
                    30090, //黄色喔喔鸡发型
                    30100, //蓝色菜菜发型
                    30430, //男生大光头
                    36200, //蓬松头发（黑）
                    36280, //披肩发（黑）
                    36190, //闪耀发型
                    35540, //温柔短发
                    35830, //阴阳师后扎发型(黒)
                    35820, //阴阳师长发(黒)
                    33450, //银灰精灵发型
                    33160, //银色利琳发型(男)
                    33110, //银色一辉发型
                    33040, //银色战神男发型
                    36780, //勇士部落发型
                    36170, //优雅发型
                    34980, //黑色银河牛仔发型(女)
                    34370, //黑色樱桃短发
                    38560 //黑色影蝶发型
                ];
            } else {
                hair_Colo_new = [
                    41200, //黑色优雅波浪长发
                    37620, //黑色优雅马尾
                    38240, //黑色优雅女生发型
                    38540, //黑色优雅女生发型
                    38910, //黑色优雅长发
                    37830, //黑色悠悠发型
                    34540, //黑色原子发型
                    37110, //黑色圆圆贝壳发型
                    38020, //黑色月光天使发型
                    34860, //黑色月光妖精发型
                    34320, //黑色月下佳人发型
                    34110, //黑色宅女发型
                    31150, //黑色长发
                    31520, //黑色长烫发
                    31540, //黑色真发
                    31050, //黑色直发
                    31010, //黑色中分翘发
                    31470, //黑色中国女孩发型
                    34650, //黑色中华发型
                    31280, //黑色中碎发
                    31120, //黑色中学女生
                    37550, //黑色볼륨 뽕머리
                    34220, //黑色猪小七发型
                    37320, //黑色紫丁香发型
                    34130, //黑色自闭发型
                    31790, //黑色自然卷发型
                    37540, //黑色삐죽 양갈래머리
                    38670, //活力短发
                    37770, //魔法密林发型
                    37790, //诺特勒斯发型
                    38900, //女剑客短发(黒)
                    38890, //女剑客长发(黒)
                    31430, //女生大光头
                    37080, //披肩发（黑）
                    38660, //清爽发型
                    37070, //闪耀发型
                    37780, //射手村发型
                    37270, //娃娃头（黑）
                    34420, //银灰精灵发型
                    34180, //银色波浪马尾发型
                    34160, //银色利琳发型(女)
                    34050, //银色战神女发型
                    37040 //优雅发型
                ];
            }
            break;
    }
}