status = -1;
var itemList = Array(
//玩具
Array(1402014, 100, 1, 3),//温度计
//绝版点装
Array(1002846, 300, 1, 1),//华尔兹丝带贝雷帽
Array(1050152, 300, 1, 1),//水兵服(男)
Array(1051180, 300, 1, 1),//水兵服(女)
Array(1042104, 300, 1, 1), //小绿叶T恤
Array(1042105, 300, 1, 1),//小红叶T恤
Array(1002845, 300, 1, 1),//粉红兔耳帽
Array(1052224, 300, 1, 1),//草莓baby装
Array(1702228, 300, 1, 1), //可可香蕉
Array(1002721, 300, 1, 1),//狸毛护耳
Array(1002568, 300, 1, 1),//手工编织发夹
Array(1702155, 300, 1, 1),//绚丽彩虹
Array(1042142, 300, 1, 1),//彩虹条背心
Array(1062093, 300, 1, 1),//嫩绿休闲短裤
Array(1112904, 300, 1, 1),//彩虹星环绕戒指
Array(1041142, 300, 1, 1),//巨星蛋糕吊带
Array(1061148, 300, 1, 1),//巨星粉色短裙
Array(1702182, 300, 1, 1),//洛丽波板糖
Array(1002888, 300, 1, 1),//丝带发箍(红色)
Array(1002890, 300, 1, 1),//丝带发箍(蓝色)
Array(1052200, 300, 1, 1),//罗丽粉色娃娃套服
Array(1702208, 300, 1, 1),//搞怪鳄鱼
Array(1002863, 300, 1, 1),//小熊熊可爱帽
Array(1052061, 300, 1, 1),//巴西足球服No.9
Array(1052059, 300, 1, 1),//法国足球服No.14
Array(1003207, 300, 1, 1),//胡萝卜兔爆炸头
Array(1702285, 300, 1, 1),//蓝色蝴蝶结手提包
Array(1012131, 300, 1, 1),//好白的牙
Array(1702302, 300, 1, 1),//杯具
Array(1072337, 300, 1, 1),//喜洋洋拖鞋
Array(1112238, 300, 1, 1),//水墨花聊天戒指
Array(1112135, 300, 1, 1),//水墨花名片戒指
Array(1702261, 300, 1, 1),//樱花棒
Array(1702091, 300, 1, 1),//网球拍
Array(1702168, 300, 1, 1),//闪亮圣诞树
Array(1003051, 300, 1, 1),//小狐狸
Array(1003048, 300, 1, 1),//圣诞装饰帽
Array(1002995, 300, 1, 1),//皇家海军帽
Array(1003012, 300, 1, 1),//嫦娥发式
Array(1002876, 300, 1, 1),//圣诞红发夹
Array(1002839, 300, 1, 1),//南瓜棒球帽
Array(1001048, 300, 1, 1),//鬼娃娃帽
Array(1102225, 300, 1, 1),//嫦娥披风
Array(1102217, 300, 1, 1),//九尾披风
Array(1102157, 300, 1, 1),//傀儡枷锁
Array(1051131, 300, 1, 1),//圣诞女孩子服
Array(1112916, 300, 1, 1),//寂寞单身戒指
Array(1012179, 300, 1, 1),//鹿鼻子
Array(1051152, 300, 1, 1),//玫瑰红晚宴裙
Array(1112118, 300, 1, 1),//可乐名片戒指
Array(1112119, 300, 1, 1),//可乐(Red) 名片戒指
Array(1112120, 300, 1, 1),//可乐(White) 名片戒指
Array(1112228, 300, 1, 1),//可乐聊天戒指
Array(1112229, 300, 1, 1),//可乐(Red)聊天戒指
Array(1112230, 300, 1, 1), //可乐(White)聊天戒指
Array(1112103, 450, 1, 1), //嫩黄名片戒指 在角色的下面出来黄底黑字角色名。
Array(1004211, 450, 1, 1), //哈尼绒绒耳 由中国玩家“小术”设计的哈尼绒绒耳。
Array(1042330, 450, 1, 1), //露肩baby装 由中国玩家“小术”设计的露肩baby装。
Array(1012134, 450, 1, 1), //泪滴 (无描述)
Array(1072337, 450, 1, 1), //喜洋洋拖鞋 (无描述)
Array(1112290, 400, 1, 1), //梦幻雪景聊天戒指 由中国玩家“小术”设计的梦幻雪景聊天戒指。角色对话时，会出现梦幻般的雪花场景。
Array(1112159, 400, 1, 1), //非洲之星名片戒指 由中国玩家"小术"设计的非洲之星名片戒指。角色造型下面以非洲之星的形式，以白色字体显示角色名。
Array(1112271, 400, 1, 1), //非洲之星聊天戒指 由中国玩家"小术"设计的非洲之星聊天戒指。角色聊天窗变成非洲之星的样子。
Array(1112135, 400, 1, 1), //水墨花名片戒指 在角色脚底下，用以水墨画背景用白色的字体显示角色名字。
Array(1112238, 400, 1, 1), //水墨花聊天戒指 角色在聊天时，会出现水墨画对话框。
Array(1004126, 400, 1, 1), //彩糖熊耳帽 由中国冒险岛玩家"小术"设计。
Array(1042320, 400, 1, 1), //海鸥印花T恤 由中国玩家"小术"设计的海鸥印花T恤。
Array(1042315, 400, 1, 1), //蓝色萌萌象T恤 由中国玩家“小术”设计的T恤。和蓝色小象喷洒出的水泡沫，一起驱逐夏天的炎热吧。
Array(1042316, 400, 1, 1), //粉色萌萌象T恤 由中国玩家“小术”设计的T恤。和粉色小象喷洒出的水泡沫，一起驱逐夏天的炎热吧。
Array(1012105, 450, 1, 1), //奶嘴 (无描述)
Array(1112142, 450, 1, 1), //木乃伊名片戒指 在角色下面的绷带上显示角色名。
Array(1112253, 450, 1, 1), //木乃伊对话框戒指 角色对话时, 显示绷带对话框。
Array(1003268, 450, 1, 1), //粉嫩爱心帽 (无描述)
Array(1002839, 450, 1, 1), //南瓜棒球帽 (无描述)
Array(1004137, 450, 1, 1), //兔兔熊帽 由中国冒险岛玩家"小术"设计。
Array(1004029, 450, 1, 1), //北极熊无边帽 (无描述)
Array(1002720, 450, 1, 1), //鹿角圣诞帽 (无描述)
Array(1004193, 450, 1, 1), //搞怪翅膀帽 (无描述)
Array(1112150, 450, 1, 1), //天使降临名片戒指 由中国玩家“小术”设计。极具欧美风的戒指，带上它，如同天使降临。
Array(1112262, 450, 1, 1), //天使聊天戒指 由中国玩家“小术”设计。极具欧美风的戒指，带上它，如同天使降临。
Array(1702155, 450, 1, 1), //绚丽彩虹 可装备在#c所有的主武器#上。
Array(1702302, 450, 1, 1), //杯具 可装备在#c除了/手炮/双弩枪/以外的主武器#上。
Array(1702508, 450, 1, 1), //草莓牛奶武器 由中国玩家"小术"设计的甜蜜草莓牛奶武器。可装备在#c所有的主武器#上。

//椅子
// -----价格为 60000 点卷 --------
Array(3010183, 250, 1, 2), //胡萝卜椅子 兔子喜欢的胡萝卜,胡萝卜富有丰富的维生素A噢.每10秒钟恢复HP,MP各50.
Array(3010788, 50, 1, 3), //巨无霸年夜饭 由中国玩家“小术”设计。农历除夕，在鞭炮声中围座在一起，共同辞旧迎新一起享受美味的巨无霸团圆饭。坐上时，每秒恢复HP、MP各500。
Array(3010594, 150, 1, 2), //蓝莓蛋糕椅 冒险岛用户'小术'设计的椅子。充满美味蛋糕的蛋糕店。要先吃什么呢？每10秒恢复HP200，MP200。
Array(3010516, 150, 1, 2), //噜噜啦啦印第安小孩 成为了淘气的印第安小孩们的俘虏。每10秒HP恢复50点，MP恢复50点。
Array(3010643, 50, 1, 3), //10周年庆祝蛋糕 坐在10周年庆祝蛋糕上，可以每10秒恢复各50的HP和MP。
Array(3010754, 50, 1, 3), //百鬼夜行 传说中出现在夏日夜晚的妖怪大游行椅子。坐下时，每10秒中，可恢复HP,MP各50.
Array(3010751, 50, 1, 3), //鲸鱼椅子 可爱的蓝色鲸鱼椅子。坐下时，每10秒中，可恢复HP,MP各50.
Array(3010877, 150, 1, 3), //人鱼珊瑚礁 由中国玩家“小术”设计的人鱼珊瑚礁椅子。可以暂时感受变成人鱼。#c每10秒中恢复HP，MP各500。#
Array(3012024, 150, 1, 3), //沙滩排球椅子 由中国玩家“小术”设计的沙滩排球椅子。两个人靠近时会出现特效。#c每10秒中恢复HP，MP各500。#
Array(3010851, 150, 1, 3), //夏日沁饮椅子 炎炎夏日，只有它才能让你清凉舒爽。坐下时，每10秒中，可恢复HP，MP各50。
Array(3015009, 150, 1, 3), //小苹果椅子 小苹果椅子。坐下后，每10秒HP、MP各恢复500。
Array(3010621, 50, 1, 3), //蛤蛤仙人椅 降伏了巨大的妖怪仙人，坐在上面每10秒恢复HP和MP各50.
Array(3010459, 50, 1, 3), //天使舞台椅 我是你的铁杆粉丝! 可以感受诺巴人对爆莉萌天使的热爱。坐下每10秒恢复50点HP和MP。 
Array(3010876, 250, 1, 2), //冒险岛行星椅子 为纪念冒险岛10周年，特别制作的冒险岛行星椅子。每10秒中恢复HP，MP各500。
Array(3010824, 250, 1, 2), //水星椅子 又小又很热！但可以缓解肌肉酸痛。每10秒钟恢复HP,MP各60。
Array(3010825, 250, 1, 2), //金星椅子 很厚又冒烟并且非常非常热！如果你可以忍受，它就像毛毯一样为你保暖。\n每10秒钟恢复HP,MP各60。
Array(3010826, 250, 1, 2), //地球椅子 这蓝色星球是充满生气的，非常熟悉的地方。\n每10秒钟恢复HP,MP各60。
Array(3010827, 250, 1, 2), //火星椅子 这里有水吗？这里有外星人吗？请坐在这椅子上找出他们！\n每10秒钟恢复HP,MP各60。
Array(3010828, 250, 1, 2), //木星椅子 这是为宇宙掌控者的又大、又猛烈的椅子。\n每10秒钟恢复HP,MP各60。
Array(3010829, 250, 1, 2), //土星椅子 当厌倦超过对手时，就坐在这椅子上，看对手们跑。\n每10秒钟恢复HP,MP各60。
Array(3010830, 250, 1, 2), //天王星椅子 又冷又很遥远的椅子，但万万没想到想到这椅子会如此的舒服。\n每10秒钟恢复HP,MP各60。
Array(3010831, 250, 1, 2), //海王星椅子 坐在太阳系最边缘的椅子上，享受其壮观视野。\n每10秒钟恢复HP,MP各60。
Array(3010832, 50, 1, 3), //太阳椅子 热，热，热！你有勇气做在这燃烧的王中王椅子上吗？\n每10秒钟恢复HP,MP各60。
Array(3010606, 50, 1, 3), //未上色的名画椅子 这幅空的画布，呼唤你为它涂上绚丽的色彩。坐在上面时，每10秒HP恢复10点，MP恢复10点。


Array(3010002, 500, 1, 1),//绿色时尚转椅
Array(3010003, 500, 1, 1),//红色时尚转椅
Array(3010006, 500, 1, 1),//黄色时尚转椅
Array(3010004, 500, 1, 1),//黄蓝休闲椅
Array(3010005, 500, 1, 1),//红蓝休闲椅
Array(3010018, 500, 1, 1),//椰子树沙滩椅
Array(3010029, 500, 1, 1),//蓝环凳
Array(3010030, 500, 1, 1),//黑环凳
Array(3010031, 500, 1, 1),//红环凳
Array(3010032, 500, 1, 1),//黄环凳
Array(3010033, 500, 1, 1),//绿环凳
Array(3010043, 500, 1, 1),//魔女的飞扫把
Array(3013002, 500, 1, 1),//烟花祭
Array(3010166, 500, 1, 1),//双刀同门
// -----价格为 90000 点卷 --------
Array(3010007, 400, 1, 2),//粉色海豹靠垫
Array(3010008, 400, 1, 2),//蓝色海豹靠垫
Array(3010010, 400, 1, 2),//白色海豹靠垫
Array(3010016, 400, 1, 2),//黑色海豹靠垫
Array(3010017, 400, 1, 2),//金色海豹靠垫
Array(3010024, 400, 1, 2),//玩具粉熊椅
Array(3010025, 400, 1, 2),//枫叶纪念凳
// -----价格为 120000 点卷 --------
Array(3010014, 300, 1, 2),//月亮弯
Array(3010019, 300, 1, 2),//寿司椅
Array(3010021, 300, 1, 2),//暖暖桌
Array(3010034, 300, 1, 2),//悠长假期(红)
Array(3010035, 300, 1, 2),//悠长假期(蓝)
Array(3010037, 300, 1, 2),//猪猪凳
Array(3010038, 300, 1, 2),//空气沙发
Array(3010040, 300, 1, 2),//蝙蝠椅
Array(3010041, 300, 1, 2),//骷髅王座
Array(3010044, 300, 1, 2),//同一红伞下
Array(3010045, 300, 1, 2),//寒冰椅子
Array(3010049, 300, 1, 2),//雪房子
Array(3010068, 300, 1, 2),//露水椅子
Array(3010050, 300, 1, 2),//公主凳
Array(3010069, 300, 1, 2),//大黄风
Array(3010093, 300, 1, 2),//鲜美的火鸡
Array(3010094, 300, 1, 2),//漂漂猪椅子
Array(3010095, 300, 1, 2),//石头人座椅
// -----价格为 130000 点卷 --------
Array(3010009, 200, 1, 2),//塌塌凳
Array(3010028, 200, 1, 2),//海盗的俘虏
Array(3010036, 200, 1, 2),//浪漫秋千
Array(3010046, 200, 1, 2),//红龙椅
Array(3010047, 200, 1, 2),//蓝龙椅
Array(3010048, 200, 1, 2),//圣诞树椅子
Array(3010051, 200, 1, 2),//沙漠兔子靠垫1
Array(3010052, 200, 1, 2),//沙漠兔子靠垫2
Array(3010054, 200, 1, 2),//呼噜呼噜床
Array(3010057, 200, 1, 2),//血色玫瑰
Array(3010058, 200, 1, 2),//世界末日
Array(3010071, 200, 1, 2),//神兽椅
Array(3010073, 200, 1, 2),//baby品克缤
Array(3010075, 200, 1, 2),//我为音乐狂
Array(3010077, 200, 1, 2),//猫头鹰椅子
Array(3010096, 200, 1, 2),//恐龙化石宝座
Array(3010098, 200, 1, 2),//电视宅人
Array(3010099, 200, 1, 2),//北极熊椅子
Array(3010100, 200, 1, 2),//财神椅子
Array(3010110, 200, 1, 2),//舒适大白熊椅子
Array(3010111, 200, 1, 2),//虎虎生威
Array(3010112, 200, 1, 2),//情书柜子
Array(3010116, 200, 1, 2),//摇滚之魂椅子
Array(3010117, 200, 1, 2),//魔法书椅子
Array(3010118, 200, 1, 2),//糖果音符椅子
Array(3010119, 200, 1, 2),//羊羊椅子
Array(3010120, 200, 1, 2),//彩蛋篮子
Array(3010123, 200, 1, 2),//夏日花朵
Array(3010124, 200, 1, 2),//都纳斯喷气椅子
Array(3010125, 200, 1, 2),//尼贝隆战舰椅
Array(3010126, 200, 1, 2),//蝙蝠魔王座
Array(3012001, 200, 1, 2),//篝火
Array(3012002, 200, 1, 2),//浴桶
Array(3010066, 200, 1, 2),//深蓝色绒毛沙发
Array(3010067, 200, 1, 2),//红色设计师椅
Array(3010080, 200, 1, 2),//柿子树鞦韆 
Array(3010081, 200, 1, 2),//红帽月妙抱枕椅
Array(3010082, 200, 1, 2),//蓝帽月妙抱枕椅
Array(3010083, 200, 1, 2),//扇子月妙抱枕椅
Array(3010084, 200, 1, 2),//太平萧月妙抱枕椅
Array(3010107, 200, 1, 2),//龙龙的蛋壳椅
Array(3010108, 200, 1, 2),//幼龙秋千
Array(3010109, 200, 1, 2),//暖炉椅
Array(3010113, 200, 1, 2),//幽魂发条熊椅子
Array(3010055, 200, 1, 2),//冰雪糕丸子椅
Array(3010145, 200, 1, 2),//周年庆水晶枫叶椅
Array(3010136, 200, 1, 2),//6周年怪物王座
Array(3010137, 200, 1, 2),//神龙椅子
Array(3010149, 200, 1, 2),//猫咪风扇椅
Array(3010144, 200, 1, 2),//七夕椅子
Array(3010155, 200, 1, 2),//暗影双刀的猫头鹰
Array(3010078, 200, 1, 2),//大熊猫椅子
Array(3010132, 200, 1, 2),//撒娇猫咪椅
Array(3010133, 200, 1, 2),//帐篷椅
// -----价格为 180000 点卷 --------
Array(3012003, 100, 1, 2),//爱心椅子
Array(3012006, 100, 1, 2),//风吹稻香
Array(3012010, 100, 1, 2),//巧克力蛋糕恋人
Array(3012011, 100, 1, 2),//我爱巧克力火锅
Array(3010156, 100, 1, 2),//浮游飞行器
Array(3010152, 100, 1, 2),//黄三角帐篷椅
Array(3010162, 100, 1, 2),//果月椅子
Array(3010163, 100, 1, 2),//满月椅
Array(3010135, 100, 1, 2),//节日独角兽椅子
Array(3010139, 100, 1, 2),//私密空间
Array(3010168, 100, 1, 2),//友谊万岁椅子
Array(3010172, 100, 1, 2),//星空椅子
Array(3010173, 100, 1, 2),//万圣节塔罗椅子
Array(3010175, 100, 1, 2),//名画家椅子
Array(3010179, 100, 1, 2),//燕尾服猫咪椅
Array(3010169, 100, 1, 2),//纸箱里(求领养)
Array(3010171, 100, 1, 2),//过来抱抱椅
Array(3010174, 100, 1, 2),//女巫炼药椅
Array(3010182, 100, 1, 2),//兔子家族椅
Array(3010183, 100, 1, 2),//胡萝卜椅子
Array(3010053, 100, 1, 2),//兔子纪念版椅子
Array(3010142, 100, 1, 2),//水族馆椅子
Array(3010209, 100, 1, 2),//草莓冰淇淋月饼椅
Array(3010210, 100, 1, 2),//香草冰淇淋月饼椅
Array(3010197, 100, 1, 2),//英雄的椅子-战神
Array(3010200, 100, 1, 2),//英雄的椅子-龙神
Array(3010201, 100, 1, 2),//英雄的椅子-暗影
Array(3010161, 100, 1, 2),//鼠鼠椅
Array(3010226, 100, 1, 2),//月光仙子椅子
Array(3010085, 50, 1, 3),//鬼娃娃椅子
Array(3013000, 50, 1, 3),//樱花树下
Array(3010177, 50, 1, 3),//手柄座椅
Array(3010070, 30, 1, 3), //巨无霸品克缤
//伤害皮肤

Array(2431965, 300, 1, 1), //默认伤害皮肤
Array(2431966, 300, 1, 2), //数码式伤害皮肤
Array(2432084, 300, 1, 2), //数码式伤害皮肤
Array(2433104, 300, 1, 2), //数码式伤害皮肤
Array(2431967, 300, 1, 2), //克里蒂亚斯伤害皮肤
Array(2432131, 300, 1, 2), //组队任务伤害皮肤
Array(2432153, 300, 1, 2), //冲击式伤害皮肤
Array(2432603, 300, 1, 2), //冲击式伤害皮肤
Array(2432638, 300, 1, 2), //冲击式伤害皮肤
Array(2432659, 300, 1, 2), //冲击式伤害皮肤
Array(2432154, 300, 1, 3), //甜美传统韩果伤害皮肤
Array(2432637, 300, 1, 3), //甜美传统韩果伤害皮肤
Array(2432658, 300, 1, 3), //甜美传统韩果伤害皮肤
Array(2433106, 300, 1, 3), //甜美传统韩果伤害皮肤
Array(2432207, 300, 1, 3), //射手村俱乐部伤害皮肤
Array(2432354, 300, 1, 3), //圣诞快乐伤害皮肤
Array(2432355, 300, 1, 3), //雪花伤害皮肤
Array(2432972, 300, 1, 3), //雪花伤害皮肤
Array(2432465, 300, 1, 3), //阿丽莎的伤害皮肤
Array(2433199, 300, 1, 3), //阿丽莎的伤害皮肤
Array(2432479, 300, 1, 3), //桃乐丝的伤害皮肤
Array(2432526, 300, 1, 3), //键盘战士伤害皮肤
Array(2432639, 300, 1, 3), //键盘战士伤害皮肤
Array(2432660, 300, 1, 3), //键盘战士伤害皮肤
Array(2433105, 300, 1, 3), //键盘战士伤害皮肤
Array(2432532, 300, 1, 3), //轻柔春风伤害皮肤
Array(2433107, 300, 1, 3), //轻柔春风伤害皮肤
Array(2432592, 300, 1, 3), //单身部队伤害皮肤
Array(2433132, 300, 1, 3), //单身部队伤害皮肤
Array(2432640, 300, 1, 3), //回忆伤害皮肤
Array(2432661, 300, 1, 3), //回忆伤害皮肤
Array(2432710, 300, 1, 3), //花蘑菇伤害皮肤
Array(2432836, 300, 1, 3), //王冠伤害皮肤
Array(2432973, 300, 1, 3), //灰白伤害皮肤
Array(2433063, 300, 1, 3), //Star Planet伤害皮肤
Array(2432591, 300, 1, 3), //樱吹雪伤害皮肤
Array(2432695, 300, 1, 3), //金灿灿伤害皮肤
Array(2432748, 300, 1, 3), //血色伤害皮肤
Array(2432749, 300, 1, 3), //僵尸伤害皮肤
Array(2432804, 300, 1, 3), //紫色妖姬伤害皮肤
Array(2433112, 300, 1, 3), //卧虎藏龙伤害皮肤
Array(2433113, 300, 1, 3), //冰淇淋伤害皮肤
Array(2433038, 300, 1, 3), //粉笔效果伤害皮肤
Array(2433197, 300, 1, 3), //蘑菇公主伤害皮肤
Array(2433182, 300, 1, 3), //万圣节南瓜伤害皮肤
Array(2433183, 300, 1, 3), //万圣节幽灵伤害皮肤

//高级装备
//法师
Array(1012220, 300, 1, 1), //闪亮红色魔法师徽章       等级: 130
Array(1003178, 300, 1, 1), //艾里格斯血色头箍         等级: 130
Array(1003444, 300, 1, 1), //君主记忆头箍             等级: 130
Array(1003590, 300, 1, 1), //豪华艾里格斯头箍         等级: 130
Array(1102281, 300, 1, 1), //艾里格斯血色披风         等级: 130
Array(1102363, 300, 1, 1), //君主记忆披风             等级: 130
Array(1102446, 300, 1, 1), //豪华艾里格斯披风         等级: 130
Array(1082301, 300, 1, 1), //艾里格斯血色手套         等级: 130
Array(1082417, 300, 1, 1), //君主记忆手套             等级: 130
Array(1082467, 300, 1, 1), //豪华艾里格斯手套         等级: 130
Array(1052320, 300, 1, 1), //艾里格斯血色锁子甲       等级: 130
Array(1052430, 300, 1, 1), //君主记忆锁子甲           等级: 130
Array(1052499, 300, 1, 1), //豪华艾里格斯锁子甲       等级: 130
Array(1092089, 300, 1, 1), //战神贤者盾               等级: 130
Array(1072491, 300, 1, 1), //艾里格斯血色鞋           等级: 130
Array(1072642, 300, 1, 1), //君主记忆靴               等级: 130
Array(1072704, 300, 1, 1), //豪华艾里格斯靴           等级: 130
Array(1212013, 300, 1, 1), //艾里格斯血色双头杖       等级: 130
Array(1212034, 300, 1, 1), //君主双头杖               等级: 130
Array(1212043, 300, 1, 1), //豪华艾里格斯双头杖       等级: 130
Array(1372039, 300, 1, 1), //爆炎之杖                 等级: 130
Array(1372040, 300, 1, 1), //剧毒之杖                 等级: 130
Array(1372041, 300, 1, 1), //寒冰之杖                 等级: 130
Array(1372042, 300, 1, 1), //狂雷之杖                 等级: 130
Array(1372085, 300, 1, 1), //艾里格斯血色短杖         等级: 130
Array(1372130, 300, 1, 1), //君主权杖                 等级: 130
Array(1372140, 300, 1, 1), //豪华艾里格斯短杖         等级: 130
Array(1382105, 300, 1, 1), //艾里格斯血色笞鞭         等级: 130
Array(1382158, 300, 1, 1), //君主长杖                 等级: 130
Array(1382169, 300, 1, 1), //豪华艾里格斯笞鞭         等级: 130
Array(1092110, 300, 1, 1), //外星人之盾(法师)         等级: 135
Array(1212044, 300, 1, 1), //无爱双头杖               等级: 135
Array(1372137, 300, 1, 1), //外星人之短杖             等级: 135
Array(1372161, 300, 1, 1), //无爱蝶翼杖               等级: 135
Array(1372168, 300, 1, 1), //布莱克缤短杖             等级: 135
Array(1382167, 300, 1, 1), //外星人之长杖             等级: 135
Array(1382192, 300, 1, 1), //无爱冰轮杖               等级: 135
Array(1382199, 300, 1, 1), //布莱克缤长杖             等级: 135
Array(1003173, 300, 1, 2), //龙尾法师帽子             等级: 140
Array(1102276, 300, 1, 2), //龙尾法师披风             等级: 140
Array(1082296, 300, 1, 2), //龙尾法师手套             等级: 140
Array(1052315, 300, 1, 2), //龙尾法师长袍             等级: 140
Array(1072486, 300, 1, 2), //龙尾法师鞋               等级: 140
Array(1212014, 300, 1, 2), //龙尾黑甲凶灵             等级: 140
Array(1372084, 300, 1, 2), //龙尾精灵短杖             等级: 140
Array(1382104, 300, 1, 2), //龙尾战斗长杖             等级: 140
Array(1132175, 200, 1, 3), //暴君赫尔梅斯腰带         等级: 150
Array(1102482, 200, 1, 3), //暴君赫尔梅斯披风         等级: 150
Array(1072744, 200, 1, 3), //暴君赫尔梅斯靴           等级: 150
Array(1382049, 200, 1, 3), //朱雀长杖                 等级: 163
Array(1382050, 200, 1, 3), //玄武长杖                 等级: 163
Array(1382051, 200, 1, 3), //白虎长杖                 等级: 163
Array(1382052, 200, 1, 3), //青龙长杖                 等级: 163
Array(1142010, 150, 1, 3), //圣贤者勋章               等级: 200
//飞侠
Array(1012232, 300, 1, 1), //闪亮红色飞侠徽章         等级: 130
Array(1003180, 300, 1, 1), //赫尔巴斯血色头箍         等级: 130
Array(1003446, 300, 1, 1), //君主迅捷头箍             等级: 130
Array(1003592, 300, 1, 1), //豪华赫尔巴斯头箍         等级: 130
Array(1102283, 300, 1, 1), //赫尔巴斯血色披风         等级: 130
Array(1102365, 300, 1, 1), //君主迅捷披风             等级: 130
Array(1102448, 300, 1, 1), //豪华赫尔巴斯披风         等级: 130
Array(1082303, 300, 1, 1), //赫尔巴斯血色手套         等级: 130
Array(1082419, 300, 1, 1), //君主迅捷手套             等级: 130
Array(1082469, 300, 1, 1), //豪华赫尔巴斯手套         等级: 130
Array(1052322, 300, 1, 1), //赫尔巴斯血色锁子甲       等级: 130
Array(1052432, 300, 1, 1), //君主迅捷锁子甲           等级: 130
Array(1052501, 300, 1, 1), //豪华赫尔巴斯锁子甲       等级: 130
Array(1092088, 300, 1, 1), //战神黑暗盾               等级: 130
Array(1072493, 300, 1, 1), //赫尔巴斯血色鞋           等级: 130
Array(1072644, 300, 1, 1), //君主迅捷靴               等级: 130
Array(1072706, 300, 1, 1), //豪华赫尔巴斯靴           等级: 130
Array(1332131, 300, 1, 1), //赫尔巴斯血色屠杀者       等级: 130
Array(1332184, 300, 1, 1), //君主屠杀者               等级: 130
Array(1332194, 300, 1, 1), //豪华赫尔巴斯猎手         等级: 130
Array(1342035, 300, 1, 1), //红花青梅刀               等级: 130
Array(1342064, 300, 1, 1), //君主刀                   等级: 130
Array(1362018, 300, 1, 1), //地狱之路血腥手杖         等级: 130
Array(1362056, 300, 1, 1), //君主手杖                 等级: 130
Array(1362068, 300, 1, 1), //豪华赫尔巴斯手杖         等级: 130
Array(1472123, 300, 1, 1), //赫尔巴斯血色手套         等级: 130
Array(1472174, 300, 1, 1), //君主拳套                 等级: 130
Array(1472180, 300, 1, 1), //豪华赫尔巴斯手套         等级: 130
Array(1092111, 300, 1, 1), //外星人之盾(飞侠)         等级: 135
Array(1332192, 300, 1, 1), //外星人之短刀             等级: 135
Array(1332205, 300, 1, 1), //无爱狂鲨锯               等级: 135
Array(1332214, 300, 1, 1), //布莱克缤短刀             等级: 135
Array(1342070, 300, 1, 1), //外星人之刀               等级: 135
Array(1342075, 300, 1, 1), //无爱之刃                 等级: 135
Array(1342079, 300, 1, 1), //布莱克缤双刀             等级: 135
Array(1362074, 300, 1, 1), //无爱手杖                 等级: 135
Array(1362081, 300, 1, 1), //布莱克缤手杖             等级: 135
Array(1472178, 300, 1, 1), //外星人之拳套             等级: 135
Array(1472197, 300, 1, 1), //无爱大悲赋               等级: 135
Array(1472205, 300, 1, 1), //布莱克缤拳套             等级: 135
Array(1003175, 300, 1, 2), //渡鸦之魂追踪者帽         等级: 140
Array(1102278, 300, 1, 2), //渡鸦之魂猎人披风         等级: 140
Array(1082298, 300, 1, 2), //渡鸦之魂追踪者手套       等级: 140
Array(1052317, 300, 1, 2), //渡鸦之魂追踪者盔甲       等级: 140
Array(1072488, 300, 1, 2), //渡鸦之魂追踪者鞋         等级: 140
Array(1332130, 300, 1, 2), //渡鸦之魂短刀             等级: 140
Array(1342036, 300, 1, 2), //精灵角暗影刀             等级: 140
Array(1362019, 300, 1, 2), //渡鸦之魂真红手杖         等级: 140
Array(1472122, 300, 1, 2), //渡鸦之魂钢铁拳套         等级: 140
Array(1132177, 200, 1, 3), //暴君利卡昂腰带           等级: 150
Array(1102484, 200, 1, 3), //暴君利卡昂披风           等级: 150
Array(1072746, 200, 1, 3), //暴君利卡昂靴             等级: 150
Array(1142012, 150, 1, 3), //影飞侠勋章               等级: 200
//弓箭手
Array(1012226, 300, 1, 1), //闪亮红色弓箭手徽章       等级: 130
Array(1003179, 300, 1, 1), //伊布斯血色头箍           等级: 130
Array(1003445, 300, 1, 1), //君主锋锐头箍             等级: 130
Array(1003591, 300, 1, 1), //豪华伊布斯头箍           等级: 130
Array(1102282, 300, 1, 1), //伊布斯血色披风           等级: 130
Array(1102364, 300, 1, 1), //君主锋锐披风             等级: 130
Array(1102447, 300, 1, 1), //豪华伊布斯披风           等级: 130
Array(1082302, 300, 1, 1), //伊布斯血色手套           等级: 130
Array(1082418, 300, 1, 1), //君主锋锐手套             等级: 130
Array(1082468, 300, 1, 1), //豪华伊布斯手套           等级: 130
Array(1052321, 300, 1, 1), //伊布斯血色锁子甲         等级: 130
Array(1052431, 300, 1, 1), //君主锋锐锁子甲           等级: 130
Array(1052500, 300, 1, 1), //豪华伊布斯锁子甲         等级: 130
Array(1072492, 300, 1, 1), //伊布斯血色鞋             等级: 130
Array(1072643, 300, 1, 1), //君主锋锐靴               等级: 130
Array(1072705, 300, 1, 1), //豪华伊布斯靴             等级: 130
Array(1452112, 300, 1, 1), //伊布斯血色长弓           等级: 130
Array(1452162, 300, 1, 1), //君主长弓                 等级: 130
Array(1452171, 300, 1, 1), //豪华伊布斯长弓           等级: 130
Array(1462100, 300, 1, 1), //伊布斯血色弩             等级: 130
Array(1462152, 300, 1, 1), //君主弩                   等级: 130
Array(1462160, 300, 1, 1), //豪华伊布斯弩             等级: 130
Array(1522017, 300, 1, 1), //史诗血腥双弩枪           等级: 130
Array(1522064, 300, 1, 1), //君主双弩枪               等级: 130
Array(1522072, 300, 1, 1), //豪华伊布斯双弩枪         等级: 130
Array(1452168, 300, 1, 1), //外星人之弓               等级: 135
Array(1452189, 300, 1, 1), //无爱惊电弓               等级: 135
Array(1452196, 300, 1, 1), //布莱克缤弓               等级: 135
Array(1462157, 300, 1, 1), //外星人之弩               等级: 135
Array(1462177, 300, 1, 1), //无爱冥雷弩               等级: 135
Array(1462184, 300, 1, 1), //布莱克缤弩               等级: 135
Array(1522078, 300, 1, 1), //无爱鲜花弩枪             等级: 135
Array(1522085, 300, 1, 1), //布莱克缤双弩枪           等级: 135
Array(1003174, 300, 1, 2), //鹰翼哨兵便帽             等级: 140
Array(1102277, 300, 1, 2), //鹰翼哨兵披风             等级: 140
Array(1082297, 300, 1, 2), //鹰翼哨兵手套             等级: 140
Array(1052316, 300, 1, 2), //鹰翼哨兵服               等级: 140
Array(1072487, 300, 1, 2), //鹰翼哨兵鞋               等级: 140
Array(1452111, 300, 1, 2), //鹰翼组合弓               等级: 140
Array(1462099, 300, 1, 2), //鹰翼重弩                 等级: 140
Array(1522018, 300, 1, 2), //龙翼巨弩枪               等级: 140
Array(1132176, 200, 1, 3), //暴君凯伦腰带             等级: 150
Array(1102483, 200, 1, 3), //暴君凯伦披风             等级: 150
Array(1072745, 200, 1, 3), //暴君凯伦靴               等级: 150
Array(1142011, 150, 1, 3), //狙击王勋章               等级: 200
//海盗
Array(1012238, 300, 1, 1), //闪亮红色海盗徽章         等级: 130
Array(1003181, 300, 1, 1), //维帕尔血色头箍           等级: 130
Array(1003447, 300, 1, 1), //君主炽热头箍             等级: 130
Array(1003593, 300, 1, 1), //豪华维帕尔头箍           等级: 130
Array(1102284, 300, 1, 1), //维帕尔血色披风           等级: 130
Array(1102366, 300, 1, 1), //君主炽热披风             等级: 130
Array(1102449, 300, 1, 1), //豪华维帕尔披风           等级: 130
Array(1082304, 300, 1, 1), //维帕尔血色手套           等级: 130
Array(1082420, 300, 1, 1), //君主炽热手套             等级: 130
Array(1082470, 300, 1, 1), //豪华维帕尔手套           等级: 130
Array(1052323, 300, 1, 1), //维帕尔血色锁子甲         等级: 130
Array(1052433, 300, 1, 1), //君主炽热锁子甲           等级: 130
Array(1052502, 300, 1, 1), //豪华维帕尔锁子甲         等级: 130
Array(1072494, 300, 1, 1), //维帕尔血色鞋             等级: 130
Array(1072645, 300, 1, 1), //君主炽热靴               等级: 130
Array(1072707, 300, 1, 1), //豪华维帕尔靴             等级: 130
Array(1222013, 300, 1, 1), //维帕尔血月               等级: 130
Array(1222034, 300, 1, 1), //君主血月                 等级: 130
Array(1222043, 300, 1, 1), //豪华维帕尔血月           等级: 130
Array(1482085, 300, 1, 1), //维帕尔血色拳甲           等级: 130
Array(1482135, 300, 1, 1), //君主指节                 等级: 130
Array(1482141, 300, 1, 1), //豪华维帕尔指节手套       等级: 130
Array(1492086, 300, 1, 1), //维帕尔血色之鹰           等级: 130
Array(1492135, 300, 1, 1), //君主沙漠之鹰             等级: 130
Array(1492153, 300, 1, 1), //豪华维帕尔之鹰           等级: 130
Array(1532017, 300, 1, 1), //维帕尔血腥火神炮         等级: 130
Array(1532068, 300, 1, 1), //君主火炮                 等级: 130
Array(1532075, 300, 1, 1), //豪华维帕尔火炮           等级: 130
Array(1222044, 300, 1, 1), //无爱紫龙                 等级: 135
Array(1482139, 300, 1, 1), //外星人之指节             等级: 135
Array(1482151, 300, 1, 1), //无爱孔雀翎               等级: 135
Array(1482159, 300, 1, 1), //布莱克缤指节             等级: 135
Array(1492149, 300, 1, 1), //外星人之短枪             等级: 135
Array(1492162, 300, 1, 1), //无爱凤凰铳               等级: 135
Array(1492170, 300, 1, 1), //布莱克缤短枪             等级: 135
Array(1532081, 300, 1, 1), //无爱救世炮               等级: 135
Array(1532089, 300, 1, 1), //布莱克缤火炮             等级: 135
Array(1003176, 300, 1, 2), //鲨齿船长帽               等级: 140
Array(1102279, 300, 1, 2), //鲨齿船长披风             等级: 140
Array(1082299, 300, 1, 2), //鲨齿船长手套             等级: 140
Array(1052318, 300, 1, 2), //鲨齿船长外套             等级: 140
Array(1072489, 300, 1, 2), //鲨齿船长鞋               等级: 140
Array(1222014, 300, 1, 2), //鲨齿灵魂汲取者           等级: 140
Array(1482084, 300, 1, 2), //鲨齿巨鹰爪               等级: 140
Array(1492085, 300, 1, 2), //鲨齿锐利手铳             等级: 140
Array(1532018, 300, 1, 2), //鲨齿火焰炮               等级: 140
Array(1132178, 200, 1, 3), //暴君阿尔泰腰带           等级: 150
Array(1102485, 200, 1, 3), //暴君阿尔泰披风           等级: 150
Array(1072747, 200, 1, 3), //暴君阿尔泰靴             等级: 150
Array(1352304, 200, 1, 3), //超越的八卦宝盒           等级: 160
Array(1142013, 150, 1, 3), //海盗王勋章               等级: 200
//战士
Array(1012214, 300, 1, 1), //闪亮红色战士徽章         等级: 130
Array(1003177, 300, 1, 1), //阿加雷斯血色头箍         等级: 130
Array(1003443, 300, 1, 1), //君主英勇头箍             等级: 130
Array(1003589, 300, 1, 1), //豪华阿加雷斯头箍         等级: 130
Array(1102280, 300, 1, 1), //阿加雷斯血色披风         等级: 130
Array(1102362, 300, 1, 1), //君主英勇披风             等级: 130
Array(1102445, 300, 1, 1), //豪华阿加雷斯披风         等级: 130
Array(1082300, 300, 1, 1), //阿加雷斯血色手套         等级: 130
Array(1082416, 300, 1, 1), //君主英勇手套             等级: 130
Array(1082466, 300, 1, 1), //豪华阿加雷斯手套         等级: 130
Array(1052319, 300, 1, 1), //阿加雷斯血色锁子甲       等级: 130
Array(1052429, 300, 1, 1), //君主英勇锁子甲           等级: 130
Array(1052498, 300, 1, 1), //豪华阿加雷斯锁子甲       等级: 130
Array(1092087, 300, 1, 1), //战神勇士盾               等级: 130
Array(1072490, 300, 1, 1), //阿加雷斯血色鞋           等级: 130
Array(1072641, 300, 1, 1), //君主英勇靴               等级: 130
Array(1072703, 300, 1, 1), //豪华阿加雷斯靴           等级: 130
Array(1302153, 300, 1, 1), //阿加雷斯血色拳刃         等级: 130
Array(1302207, 300, 1, 1), //君主单手剑               等级: 130
Array(1302228, 300, 1, 1), //豪华阿加雷斯拳刃         等级: 130
Array(1312066, 300, 1, 1), //阿加雷斯血色斧           等级: 130
Array(1312110, 300, 1, 1), //君主斧                   等级: 130
Array(1312117, 300, 1, 1), //豪华阿加雷斯头盔         等级: 130
Array(1322097, 300, 1, 1), //阿加雷斯血色锤           等级: 130
Array(1322150, 300, 1, 1), //君主锤                   等级: 130
Array(1322163, 300, 1, 1), //豪华阿加雷斯锤           等级: 130
Array(1402096, 300, 1, 1), //阿加雷斯血色巨剑         等级: 130
Array(1402142, 300, 1, 1), //君主双手剑               等级: 130
Array(1402152, 300, 1, 1), //豪华阿加雷斯双手剑       等级: 130
Array(1412066, 300, 1, 1), //阿加雷斯血色大斧         等级: 130
Array(1412099, 300, 1, 1), //君主双手斧               等级: 130
Array(1412105, 300, 1, 1), //豪华阿加雷斯拳套         等级: 130
Array(1422067, 300, 1, 1), //阿加雷斯血色大槌         等级: 130
Array(1422102, 300, 1, 1), //君主巨锤                 等级: 130
Array(1422108, 300, 1, 1), //豪华阿加雷斯大槌         等级: 130
Array(1432087, 300, 1, 1), //阿加雷斯血色枪           等级: 130
Array(1432131, 300, 1, 1), //君主枪                   等级: 130
Array(1432139, 300, 1, 1), //豪华阿加雷斯之矛         等级: 130
Array(1442117, 300, 1, 1), //阿加雷斯血色矛           等级: 130
Array(1442170, 300, 1, 1), //君主矛                   等级: 130
Array(1442183, 300, 1, 1), //豪华阿加雷斯之矛         等级: 130
Array(1092109, 300, 1, 1), //外星人之盾(战士)         等级: 135
Array(1302070, 300, 1, 1), //布莱克缤单手剑           等级: 135
Array(1302224, 300, 1, 1), //外星人之单手剑           等级: 135
Array(1302248, 300, 1, 1), //无爱破甲剑               等级: 135
Array(1312115, 300, 1, 1), //外星人之单手斧           等级: 135
Array(1312135, 300, 1, 1), //无爱断蚺斧               等级: 135
Array(1312142, 300, 1, 1), //布莱克缤单手斧           等级: 135
Array(1322100, 300, 1, 1), //布莱克缤单手钝器         等级: 135
Array(1322161, 300, 1, 1), //外星人之单手钝器         等级: 135
Array(1322181, 300, 1, 1), //无爱惊破天               等级: 135
Array(1402150, 300, 1, 1), //外星人之双手剑           等级: 135
Array(1402172, 300, 1, 1), //无爱玄冥剑               等级: 135
Array(1402185, 300, 1, 1), //布莱克缤双手剑           等级: 135
Array(1412103, 300, 1, 1), //外星人之双手斧           等级: 135
Array(1412122, 300, 1, 1), //无爱碎鼋斧               等级: 135
Array(1412126, 300, 1, 1), //布莱克缤双手斧           等级: 135
Array(1422106, 300, 1, 1), //外星人之双手钝器         等级: 135
Array(1422124, 300, 1, 1), //无爱威震天               等级: 135
Array(1422129, 300, 1, 1), //布莱克缤双手钝器         等级: 135
Array(1432137, 300, 1, 1), //外星人之枪               等级: 135
Array(1432150, 300, 1, 1), //无爱显圣枪               等级: 135
Array(1432158, 300, 1, 1), //布莱克缤长枪             等级: 135
Array(1442181, 300, 1, 1), //外星人之矛               等级: 135
Array(1442202, 300, 1, 1), //无爱神光戟               等级: 135
Array(1442209, 300, 1, 1), //布莱克缤长矛             等级: 135
Array(1003172, 300, 1, 2), //狮心战斗头盔             等级: 140
Array(1102275, 300, 1, 2), //狮心战斗披风             等级: 140
Array(1082295, 300, 1, 2), //狮心战斗护腕             等级: 140
Array(1052314, 300, 1, 2), //狮心战斗锁子甲           等级: 140
Array(1072485, 300, 1, 2), //狮心战斗鞋               等级: 140
Array(1302152, 300, 1, 2), //狮心弯刀                 等级: 140
Array(1312065, 300, 1, 2), //狮心勇士斧               等级: 140
Array(1322096, 300, 1, 2), //狮心震雷钉               等级: 140
Array(1402095, 300, 1, 2), //狮心战斗弯刀             等级: 140
Array(1412065, 300, 1, 2), //狮心战斗斧               等级: 140
Array(1422066, 300, 1, 2), //狮心巨锤                 等级: 140
Array(1432086, 300, 1, 2), //狮心长枪                 等级: 140
Array(1442116, 300, 1, 2), //狮心矛                   等级: 140
Array(1132174, 200, 1, 3), //暴君西亚戴斯腰带         等级: 150
Array(1102481, 200, 1, 3), //暴君西亚戴斯披风         等级: 150
Array(1072743, 200, 1, 3), //暴君西亚戴斯靴           等级: 150
Array(1402179, 200, 1, 3), //被诅咒的凯瑟利安         等级: 150
Array(1402180, 200, 1, 3), //解放的凯瑟利安           等级: 150
Array(1142009, 100, 1, 3), //战武神勋章               等级: 200
//全职业
Array(1012172, 200, 1, 3), //恐怖鬼娃的伤口           等级: 130
Array(1012239, 200, 1, 3), //旭日脸部彩绘             等级: 130
Array(1012252, 200, 1, 3), //闪亮红色特殊徽章         等级: 130
Array(1012283, 200, 1, 3), //烈日脸饰                 等级: 130
Array(1032088, 200, 1, 3), //体力猎犬耳环             等级: 130
Array(1032089, 200, 1, 3), //魔力猎犬耳环             等级: 130
Array(1032090, 200, 1, 3), //超级猎犬耳环             等级: 130
Array(1032091, 200, 1, 3), //敏捷猎犬耳环             等级: 130
Array(1032093, 200, 1, 3), //旭日耳环                 等级: 130
Array(1032110, 200, 1, 3), //烈日耳环                 等级: 130
Array(1032136, 200, 1, 3), //地狱火焰                 等级: 130
Array(1122091, 200, 1, 3), //巨熊紫色吊坠             等级: 130
Array(1122095, 200, 1, 3), //猫头鹰紫色吊坠           等级: 130
Array(1122099, 200, 1, 3), //野狼紫色吊坠             等级: 130
Array(1122103, 200, 1, 3), //孔雀紫色吊坠             等级: 130
Array(1122104, 200, 1, 3), //旭日吊坠                 等级: 130
Array(1122148, 200, 1, 3), //无双吊坠                 等级: 130
Array(1122149, 200, 1, 3), //烈日吊坠                 等级: 130
Array(1132053, 200, 1, 3), //坚韧极限腰带             等级: 130
Array(1132063, 200, 1, 3), //智慧极限腰带             等级: 130
Array(1132073, 200, 1, 3), //锐利极限腰带             等级: 130
Array(1132083, 200, 1, 3), //幸运极限腰带             等级: 130
Array(1132085, 200, 1, 3), //旭日腰带                 等级: 130
Array(1132104, 200, 1, 3), //烈日腰带                 等级: 130
Array(1132141, 200, 1, 3), //君主腰带                 等级: 130
Array(1142372, 200, 1, 3), //时间旅行者               等级: 130
Array(1142541, 200, 1, 3), //最强勋章                 等级: 130
Array(1152046, 200, 1, 3), //坚韧闪亮皇家护肩         等级: 130
Array(1152047, 200, 1, 3), //智慧闪亮皇家护肩         等级: 130
Array(1152048, 200, 1, 3), //锐利闪亮皇家护肩         等级: 130
Array(1152049, 200, 1, 3), //幸运闪亮皇家护肩         等级: 130
Array(1152079, 200, 1, 3), //君主护肩                 等级: 130
Array(1112579, 200, 1, 3), //力量戒指Ⅶ               等级: 130
Array(1112580, 200, 1, 3), //智慧戒指Ⅶ               等级: 130
Array(1112581, 200, 1, 3), //敏捷戒指Ⅶ               等级: 130
Array(1112582, 200, 1, 3), //幸运戒指Ⅶ               等级: 130
Array(1112584, 200, 1, 3), //旭日戒指                 等级: 130
Array(1112590, 200, 1, 3), //威力戒指Ⅳ               等级: 130
Array(1112662, 200, 1, 3), //烈日戒指                 等级: 130
Array(1112712, 200, 1, 3), //君主戒指                 等级: 130
Array(1022144, 200, 1, 3), //混沌品克缤瞳印           等级: 135
Array(1032142, 200, 1, 3), //外星人之耳环             等级: 135
Array(1122197, 200, 1, 3), //外星人之吊坠             等级: 135
Array(1132152, 200, 1, 3), //外星人之腰带             等级: 135
Array(1003540, 200, 1, 3), //外星人之头盔             等级: 135
Array(1003621, 200, 1, 3), //混沌品克缤帽             等级: 135
Array(1003622, 200, 1, 3), //布莱克缤帽               等级: 135
Array(1082432, 200, 1, 3), //外星人之手套             等级: 135
Array(1052460, 200, 1, 3), //外星人之套装             等级: 135
Array(1052526, 200, 1, 3), //混沌品克缤大衣           等级: 135
Array(1052527, 200, 1, 3), //布莱克缤大衣             等级: 135
Array(1112738, 200, 1, 3), //外星人之戒指             等级: 135
Array(1072664, 200, 1, 3), //外星人之靴               等级: 135
Array(1122012, 150, 1, 3), //永恒玉佩                 等级: 140
Array(1122150, 150, 1, 3), //统治者吊坠               等级: 140
Array(1003719, 150, 1, 3), //进阶精灵帽               等级: 140
Array(1003720, 150, 1, 3), //进阶半半头盔             等级: 140
Array(1003721, 150, 1, 3), //进阶女王王冠             等级: 140
Array(1003722, 150, 1, 3), //进阶贝伦头盔             等级: 140
Array(1112597, 150, 1, 3), //希纳斯的钻石戒指         等级: 140
Array(1122085, 150, 1, 3), //至尊不速之客项链         等级: 145
Array(1012173, 150, 1, 3), //恐怖鬼娃的伤口           等级: 150
Array(1142395, 150, 1, 3), //阿斯旺不死鸟             等级: 170
Array(1142396, 150, 1, 3), //熟悉希拉的人             等级: 170
Array(1142397, 150, 1, 3), //阿斯旺之光               等级: 170
Array(1012174, 150, 1, 3), //恐怖鬼娃的伤口           等级: 180
Array(1142133, 150, 1, 3), //英雄战神勋章             等级: 200
Array(1142158, 150, 1, 3), //英雄的后裔               等级: 200
Array(1142246, 150, 1, 3), //特别课程毕业生           等级: 200
Array(1142340, 150, 1, 3), //精灵之王                 等级: 200
Array(1142345, 150, 1, 3), //复仇的化身               等级: 200
Array(1142379, 150, 1, 3), //怪盗幻影                 等级: 200
Array(1142403, 150, 1, 3), //真正的光之骑士           等级: 200
Array(1142483, 150, 1, 3), //命运的对抗者             等级: 200
Array(1142488, 150, 1, 3), //到达极意的人             等级: 200
Array(1142499, 50, 1, 3) //超级巨星★               等级: 200

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我可冰冻了各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (im.getHyPay(1) >= 5) {
            im.sendYesNo("神秘之冰E中有各类#b装备、卷轴或稀有新奇的道具#k噢！\r\n你遇见我不容易哦 使用5幻币就能进行一次抽奖哦\r\n含:绝版点装/椅子/玩具/高级装备/技能皮肤/伤害皮肤/等...\r\n是否要进行抽奖呢?");
        } else {
            im.sendOk("你没有5幻币不能进行抽奖哟!!!\r\n好东西等你拿:(绝版点装/椅子/玩具/高级装备/技能皮肤/伤害皮肤/等...)");
            im.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "神秘之冰E", notice);
            if (item != -1) {
                im.addHyPay(5);
				im.gainItem(2431885, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                im.sendOk("你确实有5幻币吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：星星 100个。)");
            im.addHyPay(5);
            im.gainItem(4001839, 100);
			im.gainItem(2431885, -1);
            im.safeDispose();
        }
    }
}