status = -1;
var itemList;
var random = java.lang.Math.floor(Math.random() * 7 + 1);
if(random == 1){
itemList = Array(
// ------ 卷轴 ------
Array(2049100, 500, 1, 3), //混沌卷轴60%
Array(2048052, 500, 1, 3), //宠物装备攻击力卷轴 40%
Array(2048052, 500, 1, 3), //宠物装备魔力卷轴 40%
Array(2531001, 500, 1, 3), //防爆卷轴
Array(2040811, 500, 1, 3), //手套攻击诅咒卷轴
Array(2040807, 500, 1, 3), //手套攻击诅咒卷轴
Array(2340000, 500, 1, 3), //祝福卷轴
Array(2046319, 500, 1, 3), //饰品魔力卷轴
Array(2040814, 500, 1, 3), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 3), //手套魔力诅咒卷轴30%
Array(2048026, 500, 1, 3), //宠物装备攻击力卷轴
Array(2048027, 500, 1, 3), //宠物装备魔法攻击力卷轴
Array(2049300, 500, 1, 3), //高级装备强化卷轴
Array(2049700, 500, 1, 3), //A级潜能卷轴
Array(2049752, 500, 1, 3), //S级潜能卷轴 30%
Array(2040917, 500, 1, 3), //盾牌攻击诅咒卷轴30%
Array(2040922, 500, 1, 3), //盾牌魔力诅咒卷轴30%
Array(2040852, 500, 1, 3), //品克缤手套攻击力卷轴
Array(2040853, 500, 1, 3), //品克缤手套攻击力卷轴
Array(2049132, 500, 1, 3), //惊人混沌卷轴30%
Array(2045004, 500, 1, 3), //白医卷轴—仙
Array(2045005, 500, 1, 3), //白医卷轴—神
Array(2049012, 500, 1, 3), //诅咒白医卷轴
Array(2045000, 500, 1, 3), //白医卷轴
Array(2045001, 500, 1, 3), //白医卷轴
Array(2045002, 500, 1, 3), //白医卷轴
Array(2049122, 300, 1, 3)  //正向混沌卷
);
} else if(random == 2){
itemList = Array(
// ------ 药品 ------
Array(2022956, 500, 1, 3), //火红玫瑰
Array(5121003, 500, 1, 3), //参鸡汤
Array(5121004, 500, 1, 3), //松糕  
Array(5121005, 500, 1, 3), //韩果  
Array(5121006, 500, 1, 3), //小魔女  
Array(5121007, 500, 1, 3), //圣诞树铃铛  
Array(5121008, 500, 1, 3), //祝你生日快乐  
Array(5121009, 500, 1, 3), //火红玫瑰  
Array(5121010, 500, 1, 3), //浪漫樱花  
Array(5121015, 500, 1, 3), //雪孩子  
Array(5121016, 500, 1, 3), //巧克力糖果  
Array(5121020, 500, 1, 3), //喜洋洋  
Array(5121025, 500, 1, 3), //2010胜利祈愿 
Array(5122000, 500, 1, 3), //熊宝宝
Array(2210120, 500, 1, 3), //希拉变身药水
Array(2210121, 500, 1, 3), //麦格纳斯变身药水
Array(2210122, 500, 1, 3), //班·雷昂变身药水
Array(2210123, 500, 1, 3), //阿卡伊勒变身药水
Array(2022530, 500, 1, 3)  //迎春花花语
);
} else if(random == 3){
itemList = Array(
// ------ 坐骑 ------
Array(2430406, 500, 1, 3), //飞船7天使用券 [飞船]。 
Array(2430407, 500, 1, 3), //天马7天使用券 [天马]。 
Array(2430408, 500, 1, 3), //暗光龙7天使用券 [暗光龙]。 
Array(2430409, 500, 1, 3), //魔法扫帚7天使用券 [魔法扫帚]。 
Array(2430410, 500, 1, 3), //筋斗云7天使用券 [筋斗云]。 
Array(2430411, 500, 1, 3), //骑士团战车7天使用券 [骑士团战车]。 
Array(2430412, 500, 1, 3), //梦魇7天使用券 [梦魇]。 
Array(2430413, 500, 1, 3), //蝙蝠怪7天使用券 [蝙蝠怪]。 
Array(2430440, 500, 1, 3), //透明蝙蝠怪7天使用券 [透明蝙蝠怪]。 
Array(2430414, 500, 1, 3), //猫头鹰7天使用券 [猫头鹰]。 
Array(2430415, 500, 1, 3), //直升机7天使用券 [直升机]。 
Array(2430416, 500, 1, 3), //妮娜的魔法7天使用券 [妮娜的魔法阵]。
Array(2430417, 500, 1, 3), //青蛙7天使用券 [青蛙]。
Array(2430418, 500, 1, 3), //小龟龟7天使用券 [小龟龟]。
Array(2430419, 500, 1, 3), //无辜水牛7天使用券 [无辜水牛]。
Array(2430420, 500, 1, 3), //玩具坦克7天使用券 [玩具坦克]。
Array(2430421, 500, 1, 3), //维京战车7天使用券 [维京战车]。
Array(2430422, 500, 1, 3), //打豆豆机器人7天使用券 [打豆豆机器人]。
Array(2430423, 500, 1, 3), //暴风摩托7天使用券 [暴风摩托]。
Array(2430424, 500, 1, 3), //玩具木马7天使用券 [玩具木马]。
Array(2430425, 500, 1, 3), //老虎只是传说7天使用券 [老虎只是传说]。
Array(2430426, 500, 1, 3), //莱格斯的豺犬7天使用券 [莱格斯的豺犬]。
Array(2430427, 500, 1, 3), //鸵鸟7天使用券 [鸵鸟]。
Array(2430428, 500, 1, 3), //跑车7天使用券 [跑车]。
Array(2430429, 500, 1, 3), //拿破仑的白马7天使用券 [拿破仑的白马]。
Array(2430430, 500, 1, 3), //鳄鱼王7天使用券 [鳄鱼王]。
Array(2430431, 500, 1, 3), //女女机车7天使用券 [女女机车]。
Array(2430432, 500, 1, 3), //男男机车7天使用券 [男男机车]。
Array(2430433, 500, 1, 3), //赛车7天使用券 [赛车]。
Array(2430434, 500, 1, 3), //超能套装7天使用券 [超能套装]。
Array(2430435, 500, 1, 3), //巨无霸兔子7天使用券 [巨无霸兔子]。
Array(2430436, 500, 1, 3), //兔兔加油7天使用券 [兔兔加油]。
Array(2430437, 500, 1, 3), //兔子车夫7天使用券 [兔子车夫]。
Array(2430438, 500, 1, 3), //走路鸡7天使用券 [走路鸡]。
Array(2430439, 500, 1, 3), //钢铁变形侠7天使用券 [钢铁变形侠]。
Array(2430036, 500, 1, 3), //黑鳄鱼1天使用券 
Array(2430037, 500, 1, 3), //男男机车1天使用券
Array(2430038, 500, 1, 3), //女女机车1天使用券
Array(2430039, 500, 1, 3), //筋斗云1天使用券
Array(2430040, 500, 1, 3)  //蝙蝠怪1天使用券
);
} else if(random == 4){
itemList = Array(
// ------ 称号 ------
Array(3700031, 500, 1, 3), //见习猎人资格证
Array(3700032, 500, 1, 3), //B级猎人资格证
Array(3700033, 500, 1, 3), //A级猎人资格证
Array(3700034, 500, 1, 3), //S级猎人资格证
Array(3700035, 500, 1, 3), //甜蜜情人节！
Array(3700036, 500, 1, 3), //情人节的糖果真甜
Array(3700037, 500, 1, 3), //枫树管理员
Array(3700039, 500, 1, 3), //打架王
Array(3700040, 500, 1, 3), //复仇者
Array(3700041, 500, 1, 3), //拥有虚弱魅力的人
Array(3700042, 500, 1, 3), //斗士
Array(3700043, 500, 1, 3), //最强斗士
Array(3700044, 500, 1, 3), //我最受欢迎
Array(3700045, 500, 1, 3), //我也很受欢迎
Array(3700046, 500, 1, 3), //我也挺受欢迎
Array(3700047, 500, 1, 3), //角斗士
Array(3700048, 500, 1, 3), //平定战场的人
Array(3700049, 500, 1, 3), //与末日风暴同在的
Array(3700053, 500, 1, 3), //中秋动物农场
Array(3700054, 500, 1, 3), //LTE 尤茨 
Array(3700055, 500, 1, 3), //双倍双倍
Array(3700056, 500, 1, 3), //落火
Array(3700057, 500, 1, 3), //谁会成为猪呢
Array(3700058, 500, 1, 3), //告别尤茨游戏菜鸟水平
Array(3700059, 500, 1, 3), //坚持尤茨游戏
Array(3700060, 500, 1, 3), //尤茨特殊人才
Array(3700061, 500, 1, 3), //武陵巨熊
Array(3700062, 500, 1, 3), //神木村飞龙
Array(3700063, 500, 1, 3), //班·雷昂狮子
Array(3700064, 500, 1, 3), //克里塞巨人
Array(3700065, 500, 1, 3), //万神殿英雄
Array(3700066, 500, 1, 3), //乌山老虎
Array(3700067, 500, 1, 3), //奥尔卡双胞胎
Array(3700068, 500, 1, 3), //射手村老鹰
Array(3700073, 500, 1, 3), //开路先锋
Array(3700074, 500, 1, 3), //熊的力量
Array(3700075, 500, 1, 3), //尼浩玛
Array(3700076, 500, 1, 3), //哭哭狸
Array(3700077, 500, 1, 3), //光舞 
Array(3700079, 500, 1, 3), //我是动作英雄
Array(3700080, 500, 1, 3), //这才是高手
Array(3700081, 500, 1, 3), //欢迎任何人来和我对决 
Array(3700082, 500, 1, 3), //不要放弃
Array(3700083, 500, 1, 3), //冒险岛酷暑
Array(3700084, 500, 1, 3), //夏天就该吃冰激凌
Array(3700085, 500, 1, 3), //拼图收藏家
Array(3700086, 500, 1, 3), //今天满勤
Array(3700087, 500, 1, 3), //喜欢红色
Array(3700088, 500, 1, 3)  //恶魔复仇者成就达成
);
} else if(random == 5){
itemList = Array(
// ------ 椅子 ------
Array(3010000, 500, 1, 3), //休闲椅
Array(3010001, 500, 1, 3), //蓝色木椅
Array(3010002, 500, 1, 3), //绿色时尚转椅
Array(3010003, 500, 1, 3), //红色时尚转椅
Array(3010004, 500, 1, 3), //黄蓝休闲椅
Array(3010005, 500, 1, 3), //红蓝休闲椅
Array(3010006, 500, 1, 3), //黄色时尚转椅
Array(3010007, 500, 1, 3), //粉色海豹靠垫
Array(3010008, 500, 1, 3), //蓝色海豹靠垫
Array(3010009, 500, 1, 3), //榻榻凳
Array(3010010, 500, 1, 3), //白色海豹靠垫
Array(3010012, 500, 1, 3), //剑士 宝座
Array(3010013, 500, 1, 3), //悠长假期
Array(3010014, 500, 1, 3), //月亮弯
Array(3010016, 500, 1, 3), //黑色海豹靠垫
Array(3010017, 500, 1, 3), //金色海豹靠垫
Array(3010018, 500, 1, 3), //椰子树沙滩椅
Array(3010019, 500, 1, 3), //寿司椅
Array(3010020, 500, 1, 3), //澎澎檜木桶
Array(3010021, 500, 1, 3), //暖暖桌
Array(3010024, 500, 1, 3), //玩具粉熊椅
Array(3010025, 500, 1, 3), //5周年枫叶纪念凳
Array(3010026, 500, 1, 3), //恶灵附身的娃娃椅子
Array(3010028, 500, 1, 3), //海盗的俘虏
Array(3010029, 500, 1, 3), //蓝环凳
Array(3010030, 500, 1, 3), //黑环凳
Array(3010031, 500, 1, 3), //红环凳
Array(3010032, 500, 1, 3), //黄环凳
Array(3010033, 500, 1, 3), //绿环凳
Array(3010151, 500, 1, 3), //无人岛椅子
Array(3010152, 500, 1, 3), //黄三角帐篷椅
Array(3010073, 500, 1, 3), //baby品克缤
Array(3010034, 500, 1, 3), //悠长假期(红色)
Array(3010035, 500, 1, 3), //悠长假期(蓝色)
Array(3010036, 500, 1, 3), //浪漫秋千
Array(3010037, 500, 1, 3), //猪猪凳
Array(3010038, 500, 1, 3), //空气沙发
Array(3010039, 500, 1, 3), //黑色海狗靠垫
Array(3010040, 500, 1, 3), //蝙蝠椅
Array(3010041, 500, 1, 3), //骷髅王座
Array(3010043, 500, 1, 3), //魔女的飞扫把
Array(3010044, 500, 1, 3), //同一红伞下
Array(3010045, 500, 1, 3), //寒冰椅子
Array(3010046, 500, 1, 3), //红龙椅
Array(3010047, 500, 1, 3), //蓝龙椅
Array(3010048, 500, 1, 3), //圣诞树椅子
Array(3010049, 500, 1, 3), //雪房子
Array(3010050, 500, 1, 3), //公主凳
Array(3010051, 500, 1, 3), //沙漠兔子1靠垫
Array(3010052, 500, 1, 3), //沙漠兔子2靠垫
Array(3010053, 500, 1, 3), //兔子纪念版椅子
Array(3010054, 500, 1, 3), //呼噜呼噜床
Array(3010055, 500, 1, 3), //冰雪糕丸子椅
Array(3010057, 500, 1, 3), //血色玫瑰
Array(3010058, 500, 1, 3), //世界末日
Array(3010059, 500, 1, 3), //甜甜的零食王座
Array(3010060, 500, 1, 3), //初心凳
Array(3010061, 500, 1, 3), //枫树下
Array(3010062, 500, 1, 3), //竹凳
Array(3010063, 500, 1, 3), //月亮星星抱枕椅
Array(3010064, 500, 1, 3), //棕色砂兔抱枕椅
Array(3010065, 500, 1, 3), //粉红海滩遮阳椅
Array(3010066, 500, 1, 3), //深蓝色绒毛沙发
Array(3010067, 500, 1, 3), //红色设计师椅
Array(3010068, 500, 1, 3), //露水椅子
Array(3010069, 500, 1, 3)  //大黄风
);
} else if(random == 6){
itemList = Array(
// ------ 装备 ------
Array(1012319, 100, 1, 3), //8周年点点红
Array(1112915, 50, 1, 3), //蓝调戒指
Array(1202023, 500, 1, 3), //真·乔图腾
Array(1202027, 500, 1, 3), //真·海丽蜜图腾
Array(1202031, 500, 1, 3), //真·小龙图腾
Array(1202035, 500, 1, 3), //真·李卡司图腾
Array(1112748, 400, 1, 3), //黑天使的祝福
Array(1112738, 500, 1, 3), //外星人之戒指
Array(1113084, 100, 1, 3)  //黑龙传说指环
);
} else if(random == 7){
itemList = Array(
// ------ 特殊 ------
Array(5064300, 500, 1, 3), //卷轴防护卷轴
Array(5062500, 500, 1, 3), //大师附加神奇魔方
Array(5062000, 500, 1, 3), //神奇魔方
Array(5064000, 500, 1, 3), //防爆卷轴
Array(5064100, 500, 1, 3), //保护卷轴
Array(5062002, 500, 1, 3), //高级神奇魔方
Array(5220040, 500, 1, 3), //冒险岛转蛋券
Array(2614006, 500, 1, 3), //突破一万之石 30%
Array(2614009, 500, 1, 3), //突破一万之石 30%
Array(2614012, 500, 1, 3), //突破一万之石 50%
Array(2614015, 500, 1, 3)  //突破一万之石 50%
);
}

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 1100);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "每日礼物箱", notice);
            if (item != -1) {
		im.gainItem(2430781, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
	    im.gainItem(2430781, -1);
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}