status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010941, 100, 1, 1), //阿卡伊勒童话书椅子
Array(3010942, 100, 1, 1), //魔力品克缤
Array(3010943, 100, 1, 1), //扎昆的帝王椅子
Array(3010920, 100, 1, 1), //水晶月亮
Array(3010923, 100, 1, 1), //10周年椅子
Array(3010689, 100, 1, 1), //10周年椅子
Array(3010876, 100, 1, 1), //冒险岛行星椅子
Array(1302073, 300, 1, 1), //新加坡国旗（初学者）
Array(1302074, 300, 1, 1), //马来西亚国旗（初学者）
Array(1302075, 300, 1, 1), //新加坡国旗（单手剑）
Array(1302076, 300, 1, 1), //马来西亚国旗（单手剑）
Array(1312035, 300, 1, 1), //新加坡国旗（单手斧）
Array(1312036, 300, 1, 1), //马来西亚国旗（单手斧）
Array(1322057, 300, 1, 1), //新加坡国旗（单手杖）
Array(1322058, 300, 1, 1), //马来西亚国旗（单手杖）
Array(1332060, 300, 1, 1), //新加坡国旗（短剑）
Array(1332061, 300, 1, 1), //马来西亚国旗（短剑）
Array(1382043, 300, 1, 1), //新加坡国旗（长杖）
Array(1382044, 300, 1, 1), //马来西亚国旗（长杖）
Array(1402042, 300, 1, 1), //新加坡国旗（双手剑）
Array(1412030, 300, 1, 1), //新加坡国旗（双手斧）
Array(1412031, 300, 1, 1), //马来西亚国旗（双手斧）
Array(1422034, 300, 1, 1), //新加坡国旗（双手杖）
Array(1432043, 300, 1, 1), //新加坡国旗（枪）
Array(1432044, 300, 1, 1), //马来西亚国旗（枪）
Array(1442058, 300, 1, 1), //新加坡国旗（矛）
Array(1452049, 300, 1, 1), //新加坡国旗（弓）
Array(1452050, 300, 1, 1), //马来西亚国旗（弓）
Array(1462044, 300, 1, 1), //新加坡国旗（弩）
Array(1462045, 300, 1, 1), //马来西亚国旗（弩）
Array(1472059, 300, 1, 1), //新加坡国旗（指节）
Array(1472060, 300, 1, 1), //马来西亚国旗（指节）
Array(3010824, 80, 1, 1), //水星椅子
Array(3010825, 140, 1, 1), //金星椅子
Array(3010826, 80, 1, 1), //地球椅子
Array(3010827, 80, 1, 1), //火星椅子
Array(3010828, 80, 1, 1), //木星椅子
//Array(3010832, 80, 1, 1), //太阳椅子
Array(3010217, 80, 1, 1), //香橙果冻布丁
Array(3010829, 180, 1, 1), //土星椅子
Array(3010830, 80, 1, 1), //天王星椅子
Array(3015263, 80, 1, 1), //海王星椅子
Array(3015236, 80, 1, 1), //海王星椅子
Array(3015272, 80, 1, 1), //海王星椅子
Array(3015304, 80, 1, 1), //海王星椅子
Array(3015257, 60, 1, 1), //海王星椅子
Array(3015303, 60, 1, 1), //海王星椅子
Array(3015315, 60, 1, 1), //海王星椅子
Array(3010729, 60, 1, 1), //海王星椅子
Array(3015268, 60, 1, 1), //海王星椅子
Array(3015267, 80, 1, 1), //海王星椅子
Array(3015271, 80, 1, 1), //海王星椅子
Array(3015269, 80, 1, 1), //海王星椅子
Array(3015270, 80, 1, 1), //海王星椅子
Array(3016101, 80, 1, 1), //海王星椅子
Array(3015328, 60, 1, 1), //海王星椅子
Array(3015344, 80, 1, 1), //海王星椅子
Array(3015338, 80, 1, 1), //海王星椅子
Array(3015338, 80, 1, 1), //海王星椅子
Array(3015312, 80, 1, 1), //海王星椅子
Array(3015029, 80, 1, 1), //海王星椅子
Array(3010831, 80, 1, 1), //海王星椅子
//Array(3020014, 100, 1, 1), //我来组成头部
//Array(3020015, 100, 1, 1), //我来组成心脏
//Array(3020016, 100, 1, 1), //我来组成右臂
//Array(3020017, 100, 1, 1), //我来组成左臂
//Array(3020018, 100, 1, 1), //我来组成右脚
//Array(3020019, 100, 1, 1), //我来组成左脚
Array(3010300, 200, 1, 1), //橙色HP药水椅子
Array(3010301, 200, 1, 1), //高级HP药水椅子
Array(3010302, 100, 1, 1), //超级药水椅子
Array(3010303, 100, 1, 1), //加肥抱抱椅
Array(3010304, 100, 1, 1), //恶魔绵羊椅子
Array(3010305, 200, 1, 1), //玫红手柄座椅
Array(3010306, 100, 1, 1), //生如夏花椅子
Array(3010307, 50, 1, 1), //品克缤椅子
Array(3010311, 200, 1, 1), //黑龙椅子
Array(3010313, 200, 1, 1), //粉色扎昆椅子
Array(3010318, 200, 1, 1), //噢我的女皇
Array(5010042, 300, 1, 1), //小蜜蜂特效
Array(1112959, 300, 1, 1), //碟恋花特效
Array(2101001, 500, 1, 1), //蝙蝠魔召唤
Array(2100902, 500, 1, 1), //神秘召唤包
Array(2101004, 500, 1, 1), //绿水灵王召唤
Array(1012011, 500, 1, 1), //圣诞鹿的鼻子
Array(1012012, 500, 1, 1), //圣诞鹿的鼻子
Array(1012013, 500, 1, 1), //圣诞鹿的鼻子
Array(1012018, 500, 1, 1), //圣诞鹿的鼻子
Array(1012019, 500, 1, 1), //圣诞鹿的鼻子
Array(1012020, 500, 1, 1), //圣诞鹿的鼻子
Array(1012056, 500, 1, 1), //狗狗鼻
Array(1012058, 500, 1, 1), //匹诺曹的鼻子
Array(1012061, 500, 1, 1), //匹诺曹的鼻子
Array(1032026, 100, 1, 1), //黄水晶耳环
Array(1032027, 100, 1, 1), //黑水晶耳环
Array(1032028, 100, 1, 1) //红水晶耳环
);

var itemList2 = Array(
Array(1032030, 200, 1, 1), //勇气耳环
Array(1032031, 200, 1, 1), //永恒金盾坠
Array(1032032, 500, 1, 1), //秋叶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 500, 1, 1), //枫叶型耳环,800,1,0), //初
Array(1032041, 500, 1, 1), //枫叶型耳环,800,1,0), //庆
Array(1032042, 500, 1, 1), //枫叶型耳环,800,1,0), //盛
Array(1032055, 500, 1, 1), //工作人员C的旧收信机
Array(1032056, 500, 1, 1), //工作人员C的旧收信机
Array(1032057, 500, 1, 0), //工作人员C的旧收信机
Array(1032058, 500, 1, 0), //工作人员C钛质收信机
Array(1122001, 500, 1, 1), //绿色蝶形领结
Array(1122002, 500, 1, 1), //红色蝶形领结
Array(1122003, 500, 1, 1), //黄色蝶形领结
Array(1122004, 500, 1, 1), //粉红蝶形领结
Array(1122005, 500, 1, 1), //黑色蝶形领结
Array(1122006, 500, 1, 1), //蓝色蝶形领结
Array(1122015, 500, 1, 1), //枫叶围巾
Array(1122058, 100, 1, 1), //休彼德蔓的混沌项链
Array(1132000, 500, 1, 1), //白色腰带
Array(1132001, 500, 1, 1), //黄色腰带
Array(1132002, 500, 1, 1), //蓝色腰带
Array(1132003, 500, 1, 1), //红色腰带
Array(1132004, 450, 1, 1), //黑贺腰带
Array(1132010, 500, 1, 1), //黄金猪猪腰带
Array(1132011, 500, 1, 1), //黄金猪猪腰带
Array(1132012, 500, 1, 1), //法老的腰带
Array(1132013, 500, 1, 1), //不灭的法老腰带
Array(1122074, 500, 1, 1), //枫叶吊坠
Array(1122075, 500, 1, 1), //黄金枫叶魔法吊坠
Array(1002390, 500, 1, 1), //真扎昆头盔
Array(1002391, 500, 1, 0),  //海盗头巾(绿)


// ------ 卷轴 ------
Array(2049002, 200, 1, 1), //白医卷轴
Array(2340000, 200, 1, 1), //祝福卷轴
Array(2049300, 300, 1, 1), //高级装备强化卷轴
Array(2049400, 300, 1, 1), //高级潜能附加卷轴
Array(2049401, 300, 1, 1), //潜能附加卷轴
Array(2049301, 300, 1, 1), //装备强化卷轴
Array(2290285, 300, 1, 1), //神秘能手册
Array(2049116, 300, 1, 1), //强化混沌卷轴
Array(2340000, 200, 1, 1), //祝福卷轴
Array(2049004, 200, 1, 1), //白医卷轴—仙
Array(2290285, 300, 1, 1), //神秘能手册
Array(2290285, 300, 1, 1), //神秘能手册
Array(2049611, 200, 1, 1), //还原卷轴
Array(2700000, 300, 1, 1), //还原卷轴
Array(2047817, 300, 1, 1), //10周年极品双手武器卷轴
Array(2046995, 300, 1, 1), //10周年极品单手武器卷轴
Array(2046876, 300, 1, 1), //10周年极品饰品卷轴
// ------ 特殊 ------
Array(1022097, 300, 1, 1), //龙眼镜 - 含有龙的力量的眼镜。
Array(1152054, 300, 1, 1), //完成的护肩
Array(1202004, 300, 1, 1), //诅咒僵尸-图腾
Array(2040807, 100, 1, 1), //手套攻击诅咒卷轴 - 成功率100%，物理攻击力+3
Array(2043003, 100, 1, 1), //单手剑攻击必成卷 - 
Array(2043103, 100, 1, 1), //单手斧攻击必成卷 - 
Array(2043203, 100, 1, 1), //单手钝器攻击必成卷 
Array(2043303, 100, 1, 1), //短剑攻击必成卷 - 
Array(2613000, 200, 1, 1), //星火单手武器攻击力卷轴 - 
Array(2613001, 200, 1, 1), //星火单手武器魔法力卷轴 - 
Array(2612010, 100, 1, 1), //星火双手武器攻击力卷轴 -
Array(2043703, 100, 1, 1), //短杖攻击必成卷 -
Array(2043803, 100, 1, 1), //长杖攻击必成卷 - 
Array(2044003, 100, 1, 1), //双手剑攻击必成卷 - 
Array(2044019, 100, 1, 1), //双手剑魔力必成卷 - 
Array(2044203, 100, 1, 1), //双手钝器攻击必成卷 - 
Array(2044303, 100, 1, 1), //枪攻击必成卷 - 为枪增加攻击力属性。\n成功率：10
Array(2044403, 100, 1, 1), //矛攻击必成卷 - 为矛增加攻击力属性。\n成
Array(2044503, 100, 1, 1), //弓攻击必成卷 - 为弓增加攻击力属性。\n
Array(2044603, 100, 1, 1), //弩攻击必成卷 - 为弩增加攻击力属性。\n
Array(2044703, 100, 1, 1), //拳套攻击必成卷 - 为拳套增加攻击力属性
Array(2044815, 100, 1, 1), //指节攻击必成卷 - 成功率:100%, 物理攻击力+5, 力量+3, 物理防御力+1 
Array(2044908, 100, 1, 1), //短枪攻击必成卷 - 成功率:100%, 物理攻击力+5, 命中值+60, 敏捷+1 
Array(2040303, 100, 1, 1), //耳环智力必成卷 - 为耳饰增加智力属性。
Array(2040506, 100, 1, 1), //全身盔甲敏捷必成卷 - 为全身盔甲增加敏捷属性。
Array(2040710, 300, 1, 1),  //鞋子跳跃必成卷 - 成功率:1 
Array(5062000, 200, 1, 1), //神奇魔方
Array(2432466, 400, 1, 1), //明日礼物箱子(银)
Array(2290285, 300, 1, 1), //神秘能手册
Array(2290285, 300, 1, 1), //神秘能手册
Array(5064000, 200, 1, 1), //防爆卷轴
Array(2022800, 300, 1, 1), //心跳停止糖
Array(2022800, 300, 1, 1), //心跳停止糖
Array(2022800, 300, 1, 1), //心跳停止糖
Array(4310015, 300, 1, 1), //斗神证物
Array(5220040, 200, 1, 1), //冒险岛转蛋券
Array(5570000, 200, 1, 1), //金锤子
Array(5150040, 200, 1, 1), //皇家理发券
Array(5064100, 200, 1, 1), //保护卷轴
Array(5062002, 200, 1, 1), //高级神奇魔方
Array(5064300, 200, 1, 1), //卷轴防护卷轴
Array(2290096, 100, 1, 1), //[能手册]冒险岛勇士 20
Array(2290125, 100, 1, 1), //[能手册]冒险岛勇士 30
// ------ 卷轴 ------
Array(2000012, 600, 300, 1), //特殊药水
Array(2000019, 600, 300, 1), //超级药水
// 在线点为 61 - 180 的奖励
Array(2022529, 300, 1, 1), //金达莱花语 - 金达莱的花语是爱。30分钟内金币掉落率提高2倍。
Array(2022530, 300, 1, 1), //迎春花花语 - 迎春花的花语是希望。30分钟内物品掉落率提高2倍。
Array(2022531, 300, 1, 1), //四叶草花语 - 四叶草的花语是幸运。1小时内物品掉落率提高2倍。

// ------ 玩具 ------
Array(1442018, 100, 1, 1), //冻冻鱼
Array(1092022, 200, 1, 1), //调色板盾牌
Array(1322051, 200, 1, 1), //七夕
Array(1402044, 200, 1, 1), //南瓜灯笼
Array(1302087, 200, 1, 1), //火炬
Array(1422011, 300, 1, 1), //酒瓶
Array(1402029, 200, 1, 1), //鬼刺狼牙棒
Array(1302063, 200, 1, 1), //燃烧的火焰刀
Array(1322102, 200, 1, 1), //蛋糕大战馅饼兵器
Array(1302084, 200, 1, 1), //火柴
Array(1402063, 200, 1, 1),  //樱花伞
Array(1003797, 50, 1, 1),  //高贵战士头盔
Array(1003798, 50, 1, 1),  //高贵流丹维奇帽
Array(1003799, 50, 1, 1), //高贵游侠贝雷帽
Array(1003800, 50, 1, 1),  //高贵刺客软帽
Array(1003801, 50, 1, 1),  //高贵流浪者帽
Array(1042254, 50, 1, 1),  //鹰眼战士盔甲
Array(1042255, 50, 1, 1),  //鹰眼丹维奇长袍
Array(1042257, 60, 1, 1),  //鹰眼刺客衬衣
Array(1042258, 60, 1, 1),  //鹰眼流浪者外衣
Array(1062165, 60, 1, 1),  //魔术师战士短裤
Array(1062166, 60, 1, 1),  //魔术师丹维奇短裤
Array(1062167, 60, 1, 1),  //魔术师游侠短裤
Array(1062168, 60, 1, 1),  //魔术师刺客短裤
Array(1062169, 60, 1, 1),  //魔术师流浪者短裤
Array(1132246, 30, 1, 1),  //最高级贝勒德刻印腰带
Array(1122267, 20, 1, 1),  //最高级贝勒德刻印吊坠
Array(1032223, 30, 1, 1),  //最高级贝勒德耳环
Array(1113075, 60, 1, 1),  //最高级贝勒德戒指
Array(1212063, 60, 1, 1),  //法弗纳魔力源泉杖
Array(1222058, 40, 1, 1),  //法弗纳天使手铳
Array(1232057, 60, 1, 1),  //法弗纳死亡使者
Array(1242060, 40, 1, 1),  //法弗纳精神之刃
Array(1242061, 30, 1, 1),  //法弗纳精神之刃
Array(1302275, 30, 1, 1),  //法弗纳银槲之剑   
Array(1312153, 40, 1, 1),  //法弗纳双刃切肉斧
Array(1322203, 30, 1, 1),  //法弗纳戈耳迪锤
Array(1332225, 30, 1, 1),  //法弗纳大马士革剑
Array(1342082, 40, 1, 1),  //法弗纳急速之刃   
Array(1362090, 30, 1, 1),  //法弗纳洞察手杖
Array(1372177, 30, 1, 1),  //法弗纳魔力夺取者
Array(1382208, 30, 1, 1),  //法弗纳魔冠之杖   
Array(1402196, 30, 1, 1),  //法弗纳忏悔之剑
Array(1412135, 30, 1, 1),  //法弗纳战斗切肉斧  
Array(1422140, 30, 1, 1),  //法弗纳闪电锤  
Array(1432167, 30, 1, 1),  //法弗纳贯雷枪 
Array(1442223, 30, 1, 1),  //法弗纳半月宽刃斧 
Array(1452205, 30, 1, 1),  //法弗纳追风者
Array(1462193, 30, 1, 1),  //法弗纳风翼弩   
Array(1472214, 30, 1, 1),  //法弗纳危险之手
Array(1482168, 60, 1, 1),  //法弗纳巨狼之爪
Array(1492179, 60, 1, 1),  //法弗纳左轮枪
Array(1522094, 60, 1, 1),  //法弗纳双风翼弩
Array(1532098, 60, 1, 1),  //法弗纳荣耀炮
Array(1152038, 60, 1, 1),  //坚韧皇家护肩
Array(1152039, 60, 1, 1),  //智慧皇家护肩
Array(1152040, 60, 1, 1),  //锐利皇家护肩
Array(1152041, 60, 1, 1),  //幸运皇家护肩
Array(1152046, 60, 1, 1),  //坚韧闪亮皇家护肩
Array(1152047, 60, 1, 1),  //智慧闪亮皇家护肩
Array(1152048, 60, 1, 1),  //锐利闪亮皇家护肩
Array(1152049, 60, 1, 1),  //幸运闪亮皇家护肩
Array(1152125, 60, 1, 1),  //皇家护肩
Array(1042255, 60, 1, 1),  //鹰眼丹维奇长袍
Array(1042256, 60, 1, 1),  //鹰眼游侠斗篷

// ------ 暴君 ------
Array(1132174, 10, 1, 1),  //
Array(1132175, 30, 1, 1),  //
Array(1132176, 10, 1, 1),  //
Array(1132177, 10, 1, 1),  //
Array(1132178, 20, 1, 1),  //
Array(1102481, 20, 1, 1),  //
Array(1102482, 20, 1, 1),  //
Array(1102483, 10, 1, 1),  //
Array(1102484, 30, 1, 1),  //
Array(1102485, 10, 1, 1),  //
Array(1082543, 10, 1, 1),  //
Array(1082544, 20, 1, 1),  //
Array(1082545, 10, 1, 1),  //
Array(1082546, 10, 1, 1),  //
Array(1082547, 10, 1, 1),  //
Array(1072743, 10, 1, 1),  //
Array(1072744, 10, 1, 1),  //
Array(1072745, 10, 1, 1),  //
Array(1072746, 10, 1, 1),  //
Array(1072747, 10, 1, 1)  //
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、暴君、新奇道具、蜡笔、新椅子#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        if (finalitem.length != 0 && cm.getPlayer().getCSPoints(1)>=10000) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "大转盘", notice);
            if (item != -1) {
		cm.gainNX(- 5000);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。\r\n确认是否有5000点卷。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n");
           // cm.gainItem(4310030, 10); (获得了安慰奖：运动会币 x10。)
            cm.safeDispose();
        }
    }
}