status = -1;
var tz15 = "#fEffect/CharacterEff/1112949/0/0#";  //花样音符
var itemList = Array(

Array(3010013, 300, 1, 1), //悠长假期
Array(1004405, 300, 1, 1), //悠长假期
Array(1042342, 300, 1, 1), //悠长假期
Array(1062226, 300, 1, 1), //悠长假期
Array(1702567, 300, 1, 1), //悠长假期
Array(1702553, 300, 1, 1), //悠长假期
Array(1702554, 300, 1, 1), //悠长假期
Array(1702555, 300, 1, 1), //悠长假期
Array(1003049, 300, 1, 1), //悠长假期
Array(1052655, 300, 1, 1), //悠长假期
Array(1003049, 500, 1, 1), //悠长假期
Array(1052655, 300, 1, 1), //悠长假期
Array(1072998, 300, 1, 1), //悠长假期
Array(1702533, 300, 1, 1), //悠长假期
Array(1702529, 300, 1, 1), //悠长假期
Array(1702523, 300, 1, 1), //月亮弯
Array(1702583, 300, 1, 1), //椰子树沙滩椅
Array(1004193, 300, 1, 1), //寿司椅
Array(1004181, 300, 1, 1), //暖暖桌
Array(1702557, 300, 1, 1), //枫叶纪念凳
Array(1702566, 300, 1, 1), //海盗的俘虏
Array(3010029, 300, 1, 1), //蓝环凳
Array(3010030, 300, 1, 1), //黑环凳
Array(3010031, 500, 1, 1), //红环凳
Array(3010032, 500, 1, 1), //黄环凳
Array(3010033, 500, 1, 1), //绿环凳
Array(3010037, 500, 1, 1), //猪猪凳
Array(3010044, 500, 1, 1), //同一红伞下
Array(3012001, 550, 1, 1), //篝火
Array(3012002, 550, 1, 1), //浴桶
Array(3010073, 150, 1, 1), //PB克缤
Array(3012003, 150, 1, 1), //爱心椅子
Array(3010012, 150, 1, 1), //剑士 宝座
Array(3010025, 200, 1, 1), //枫叶纪念凳
Array(3010037, 150, 1, 1), //猪猪凳
Array(3010038, 250, 1, 1), //爱心椅子
Array(3010040, 200, 1, 1), //蝙蝠椅
Array(3010041, 250, 1, 1), //骷髅王座
Array(3010043, 250, 1, 1), //魔女的飞扫把
Array(3010044, 150, 1, 1), //同一红伞下
Array(3010045, 150, 1, 1), //寒冰椅子
Array(3010046, 150, 1, 1), //红龙椅
Array(3010047, 100, 1, 1), //蓝龙椅
Array(3010048, 100, 1, 1), //圣诞树椅子
Array(3010049, 100, 1, 1), //雪房子
Array(3010050, 100, 1, 1), //公主凳
Array(3010057, 100, 1, 1), //血色玫瑰
Array(3010058, 100, 1, 1), //世界末日
Array(3010068, 100, 1, 1), //露水椅子
Array(3010070, 150, 1, 1), //巨无霸品克缤
Array(3010071, 225, 1, 1), //神兽椅
Array(3010077, 225, 1, 1), //猫头鹰椅子
Array(3010085, 225, 1, 1), //鬼娃娃椅子
Array(3010096, 225, 1, 1), //恐龙化石宝座
Array(3010095, 225, 1, 1), //石头人座椅
Array(3010094, 115, 1, 1), //漂漂猪椅子
Array(3010098, 125, 1, 1), //电视宅人
Array(3010106, 125, 1, 1), //雪狼战椅
Array(3010112, 125, 1, 1), //情书柜子
Array(3010117, 125, 1, 1), //魔法书椅子
Array(3010119, 125, 1, 1), //羊羊椅子
Array(3010120, 125, 1, 1), //彩蛋篮子
Array(3010123, 125, 1, 1), //夏日花朵
Array(3010124, 125, 1, 1), //都纳斯喷气椅子
Array(3010125, 125, 1, 1), //尼贝隆战舰椅
Array(3010127, 125, 1, 1), //扎昆宝座
Array(3012001, 125, 1, 0), //篝火
Array(3010136, 150, 1, 1), //6周年怪物王座
Array(3010155, 150 * 2, 1, 1), //暗影双刀的猫头鹰椅子
Array(3010144, 150 * 2, 1, 1), //七夕椅子
Array(3010149, 150 * 2, 1, 1), //猫咪风扇椅
Array(3010129, 150 * 2, 1, 1), //酋长宝座
Array(3010131, 150 * 2, 1, 1), //贪吃熊猫椅
Array(3010132, 150 * 2, 1, 1), //撒娇喵咪椅
Array(3010133, 150 * 2, 1, 1), //帐篷椅
Array(3010163, 150 * 2, 1, 1), //满月椅
Array(1112915, 100, 1, 1), //蓝调戒指
Array(1102730, 100, 1, 1), //浓翅膀
Array(1012172, 200, 1, 1), //娃娃脸
Array(1402014, 200, 1, 1), //温度计
Array(2431944, 100, 1, 1), //140 武器
Array(2431945, 100, 1, 1),//140防具
Array(3015002, 40, 1, 1),//七彩摩天轮
Array(1003422, 100, 1, 1),//石榴石渡鸦面具
Array(1662027, 50, 1, 1),//银河战士
Array(1662032, 50, 1, 1), //女妖机器人
Array(2432069, 30, 1, 1), //暴君
Array(2431988, 30, 1, 1), //150
Array(1672027, 50, 1, 1), //极真锂心脏
Array(3010832, 20, 1, 1) //太阳椅子
// ------ 特殊奖品 --------------
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4000164, 300)) {
            cm.sendYesNo("            #e"+tz15+"#r『蓝泡泡抽奖机』 "+tz15+"\r\n\r\n#k使用“#b300个#t4000164##k”就可以交换. 水底世界中的“大鱼峡谷”－“怪物”区里有噢。#d收集300个蓝泡泡翻车鱼之心，另外还能抽到游戏里没有的物品如下：#k现在要玩蓝泡泡抽奖机么?\r\n———————————————————————— \r\n#v2432069#(暴君防具箱子)#v3015002#(七彩摩天轮)#v3010832#(太阳椅子)\r\n#v1072998#   #v1702529#   #v1702583#   #v1004295#   #v1004181#   #v1702566#");
        } else {
            cm.sendOk("            #e"+tz15+"#r『蓝泡泡抽奖机』 "+tz15+"\r\n#k使用“#b300个#t4000164##k”就可以交换. 水底世界中的“大鱼峡谷”－“怪物”区里有噢。#d收集300个蓝泡泡翻车鱼之心，另外还能抽到游戏里没有的物品如下：#k现在要玩蓝泡泡抽奖机么?\r\n———————————————————————— \r\n#v1702566#   #v1004181#   #v1004295#   #v1702583#   #v1702529#   #v1072998#\r\n#v2432069#(暴君防具箱子)#v3015002#(七彩摩天轮)#v3010832#(太阳椅子)\r\n你背包里好像没有#b300个#t4000164##k哦!请通过游戏怪物获取!");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "蓝泡泡抽奖机", notice);
            if (item != -1) {
                cm.gainItem(4000164, -300);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有300个#b#t4000164##k吗？如果是，请你确认在背包的装备，消耗，#b其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("#r(获得了安慰奖：星星 100 个。)\r\n今天的运气可真差，什么都没有拿到。");
            cm.gainItem(4000164, -300);
            cm.gainItem(4001839, 100);
            cm.safeDispose();
        }
    }
}