status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010941, 100, 1, 1), //阿卡伊勒童话书椅子
Array(3010942, 100, 1, 1), //魔力品克缤
Array(3010943, 100, 1, 1), //扎昆的帝王椅子
Array(3010920, 100, 1, 1), //水晶月亮
Array(3010923, 100, 1, 1), //10周年椅子
Array(3010689, 100, 1, 1), //10周年椅子
Array(3010876, 100, 1, 1), //冒险岛行星椅子
//Array(3010824, 80, 1, 1), //水星椅子
Array(3010825, 140, 1, 1), //金星椅子
Array(3010826, 80, 1, 1), //地球椅子
Array(3010827, 80, 1, 1), //火星椅子
Array(2431642, 80, 1, 1), //10W点卷盒子
//Array(3010828, 80, 1, 1), //木星椅子
//Array(3010832, 80, 1, 1), //太阳椅子
Array(3010217, 80, 1, 1), //香橙果冻布丁
Array(3010829, 180, 1, 1), //土星椅子
Array(3010830, 80, 1, 1), //天王星椅子
Array(3010831, 80, 1, 1), //海王星椅子
Array(3010651, 100, 1, 1), //冒险岛金刚（红）
Array(3010652, 100, 1, 1), //冒险岛金刚（黑）
Array(3010653, 100, 1, 1), //冒险岛金刚（蓝）
Array(3010654, 100, 1, 1), //冒险岛金刚（粉）
Array(3010655, 100, 1, 1), //冒险岛金刚（黄）
Array(3010656, 100, 1, 1), //冒险岛金刚（绿）
Array(3010300, 100, 1, 1), //橙色HP药水椅子
Array(3010301, 100, 1, 1), //高级HP药水椅子
Array(3010302, 100, 1, 1), //超级药水椅子
Array(3010303, 100, 1, 1), //加肥抱抱椅
Array(3010304, 100, 1, 1), //恶魔绵羊椅子
Array(3010305, 100, 1, 1), //玫红手柄座椅
Array(3010306, 100, 1, 1), //生如夏花椅子
Array(3010307, 100, 1, 1), //品克缤椅子
Array(3010311, 100, 1, 1), //黑龙椅子
Array(3010313, 100, 1, 1), //粉色扎昆椅子
Array(3010318, 100, 1, 1), //噢我的女皇
//Array(3994417, 200, 1, 1), //红色蜡笔
Array(5010042, 300, 1, 1), //小蜜蜂特效
Array(1112959, 300, 1, 1), //碟恋花特效
//Array(4033647, 80, 1, 1), //大丽花
Array(4000313, 100, 1, 1), //黄金枫叶
//Array(3994418, 200, 1, 1), //橙色蜡笔
//Array(3994419, 200, 1, 1), //黄色蜡笔
//Array(3994420, 200, 1, 1), //绿色蜡笔
//Array(3994421, 200, 1, 1), //青色蜡笔
//Array(3994422, 200, 1, 1), //蓝色蜡笔
//Array(3994423, 200, 1, 1), //紫色蜡笔

// ------ 特殊 ------
Array(1022097, 300, 1, 1), //龙眼镜 - 含有龙的力量的眼镜。
Array(1202004, 300, 1, 1), //诅咒僵尸-图腾
Array(2040807, 100, 1, 1), //手套攻击诅咒卷轴 - 成功率100%，物理攻击力+3
Array(2043003, 100, 1, 1), //单手剑攻击必成卷 - 
Array(2043103, 100, 1, 1), //单手斧攻击必成卷 - 
Array(2043203, 100, 1, 1), //单手钝器攻击必成卷 
Array(2043303, 100, 1, 1), //短剑攻击必成卷 - 
Array(2043703, 100, 1, 1), //短杖攻击必成卷 -
Array(2043803, 100, 1, 1), //长杖攻击必成卷 - 
Array(2044003, 100, 1, 1), //双手剑攻击必成卷 - 
Array(2044019, 100, 1, 1), //双手剑魔力必成卷 - 
Array(2044203, 100, 1, 1), //双手钝器攻击必成卷 - 
Array(2044303, 100, 1, 1), //枪攻击必成卷 - 为枪增加攻击力属性。\n成功率：10
Array(2044403, 100, 1, 1), //矛攻击必成卷 - 为矛增加攻击力属性。\n成
Array(2044503, 100, 1, 1), //弓攻击必成卷 - 为弓增加攻击力属性。\n
Array(2044603, 100, 1, 1), //弩攻击必成卷 - 为弩增加攻击力属性。\n
Array(2044703, 100, 1, 1), //拳套攻击必成卷 - 为拳套增加攻击力属性
Array(2044815, 100, 1, 1), //指节攻击必成卷 - 成功率:100%, 物理攻击力+5, 力量+3, 物理防御力+1 
Array(2044908, 100, 1, 1), //短枪攻击必成卷 - 成功率:100%, 物理攻击力+5, 命中值+60, 敏捷+1 
Array(2040303, 100, 1, 1), //耳环智力必成卷 - 为耳饰增加智力属性。
Array(2040506, 100, 1, 1), //全身盔甲敏捷必成卷 - 为全身盔甲增加敏捷属性。
Array(2040710, 300, 1, 1),  //鞋子跳跃必成卷 - 成功率:1 
Array(2432466, 400, 1, 1), //明日礼物箱子(银)
Array(2432466, 400, 1, 1), //明日礼物箱子(银)
Array(2290096, 100, 1, 1), //[能手册]冒险岛勇士 20
Array(2290125, 100, 1, 1), //[能手册]冒险岛勇士 30
// ------ 玩具 ------
Array(1442018, 100, 1, 1), //冻冻鱼
Array(1092022, 200, 1, 1), //调色板盾牌
Array(1322051, 200, 1, 1), //七夕
Array(1402044, 200, 1, 1), //南瓜灯笼
Array(1302087, 200, 1, 1), //火炬
Array(1422011, 300, 1, 1), //酒瓶
//Array(1402029, 200, 1, 1), //鬼刺狼牙棒
Array(1302063, 200, 1, 1), //燃烧的火焰刀
Array(1322102, 200, 1, 1), //蛋糕大战馅饼兵器
Array(1302084, 200, 1, 1), //火柴
Array(1402063, 200, 1, 1),  //樱花伞
Array(1003797, 60, 1, 1),  //高贵战士头盔
Array(1003798, 60, 1, 1),  //高贵流丹维奇帽
Array(1003799, 60, 1, 1), //高贵游侠贝雷帽
Array(1003800, 60, 1, 1),  //高贵刺客软帽
Array(1003801, 60, 1, 1),  //高贵流浪者帽
Array(1042254, 60, 1, 1),  //鹰眼战士盔甲
Array(1042255, 60, 1, 1),  //鹰眼丹维奇长袍
Array(1042257, 60, 1, 1),  //鹰眼刺客衬衣
Array(1042258, 60, 1, 1),  //鹰眼流浪者外衣
Array(1062165, 60, 1, 1),  //魔术师战士短裤
Array(1062166, 60, 1, 1),  //魔术师丹维奇短裤
Array(1062167, 60, 1, 1),  //魔术师游侠短裤
Array(1062168, 60, 1, 1),  //魔术师刺客短裤
Array(1062169, 60, 1, 1),  //魔术师流浪者短裤
Array(1132246, 60, 1, 1),  //最高级贝勒德刻印腰带
Array(1122267, 60, 1, 1),  //最高级贝勒德刻印吊坠
Array(1032223, 60, 1, 1),  //最高级贝勒德耳环
Array(1113075, 60, 1, 1),  //最高级贝勒德戒指
Array(1212063, 60, 1, 1),  //法弗纳魔力源泉杖
Array(1222058, 60, 1, 1),  //法弗纳天使手铳
Array(1232057, 60, 1, 1),  //法弗纳死亡使者
Array(1242060, 60, 1, 1),  //法弗纳精神之刃
Array(1242061, 60, 1, 1),  //法弗纳精神之刃
Array(1302275, 60, 1, 1),  //法弗纳银槲之剑   
Array(1312153, 60, 1, 1),  //法弗纳双刃切肉斧
Array(1322203, 60, 1, 1),  //法弗纳戈耳迪锤
Array(1332225, 60, 1, 1),  //法弗纳大马士革剑
Array(1342082, 60, 1, 1),  //法弗纳急速之刃   
Array(1362090, 60, 1, 1),  //法弗纳洞察手杖
Array(1372177, 60, 1, 1),  //法弗纳魔力夺取者
Array(1382208, 60, 1, 1),  //法弗纳魔冠之杖   
Array(1402196, 60, 1, 1),  //法弗纳忏悔之剑
Array(1412135, 60, 1, 1),  //法弗纳战斗切肉斧  
Array(1422140, 60, 1, 1),  //法弗纳闪电锤  
Array(1432167, 60, 1, 1),  //法弗纳贯雷枪 
Array(1442223, 60, 1, 1),  //法弗纳半月宽刃斧 
Array(1452205, 60, 1, 1),  //法弗纳追风者
Array(1462193, 60, 1, 1),  //法弗纳风翼弩   
Array(1472214, 60, 1, 1),  //法弗纳危险之手
Array(1482168, 60, 1, 1),  //法弗纳巨狼之爪
Array(1492179, 60, 1, 1),  //法弗纳左轮枪
Array(1522094, 60, 1, 1),  //法弗纳双风翼弩
Array(1532098, 60, 1, 1),  //法弗纳荣耀炮
Array(1152038, 60, 1, 1),  //坚韧皇家护肩
Array(1152039, 60, 1, 1),  //智慧皇家护肩
Array(1152040, 60, 1, 1),  //锐利皇家护肩
Array(1152041, 60, 1, 1),  //幸运皇家护肩
Array(1152046, 60, 1, 1),  //坚韧闪亮皇家护肩
Array(1152047, 60, 1, 1),  //智慧闪亮皇家护肩
Array(1152048, 60, 1, 1),  //锐利闪亮皇家护肩
Array(1152049, 60, 1, 1),  //幸运闪亮皇家护肩
Array(1152125, 60, 1, 1),  //皇家护肩
Array(1042255, 60, 1, 1),  //鹰眼丹维奇长袍
Array(1042256, 30, 1, 1)  //鹰眼游侠斗篷
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、暴君、新奇道具、蜡笔、新椅子#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0 && cm.getPlayer().getCSPoints(1)>=20000) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "大转盘", notice);
            if (item != -1) {
		cm.gainNX(- 20000);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。\r\n确认是否有20000点卷。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n（或没足够的点卷）)");
            //cm.gainItem(4310030, 1);
            //cm.gainNX(- 5000);
            cm.safeDispose();
        }
    }
}