var a = 0;
var text;
var selects; //记录玩家的选项
var buynum = 0;
var itemlist = Array(
Array(2042400, 500), //双弩枪攻击力卷轴
Array(2042401, 500), //双弩枪攻击力卷轴
Array(2042402, 500), //双弩枪攻击力卷轴
Array(2042403, 500), //双弩枪攻击力卷轴
Array(2042404, 500), //双弩枪攻击力卷轴
Array(2042405, 500), //双弩枪攻击力卷轴
Array(2042406, 500), //双弩枪攻击力卷轴
Array(2042407, 500), //双弩枪攻击力卷轴
Array(2042408, 500), //双弩枪攻击力卷轴
Array(2045200, 500), //双弩枪攻击力卷轴
Array(2045201, 500), //双弩枪攻击力卷轴
Array(2045202, 500), //双弩枪攻击力卷轴
Array(2045203, 500), //双弩枪攻击力卷轴
Array(2045204, 500), //双弩枪攻击力卷轴
Array(2045205, 500), //双弩枪攻击力卷轴
Array(2045206, 500), //双弩枪攻击力卷轴
Array(2045208, 500), //双弩枪攻击力卷轴
Array(2043400, 500), //刀攻击力卷轴 100%
Array(2043401, 500), //刀攻击力卷轴 60% 
Array(2043402, 500), //刀攻击力卷轴 10%
Array(2043403, 500), //刀攻击力卷轴
Array(2043404, 500), //刀攻击力卷轴
Array(2040000, 500), //头盔防御卷轴 成功率100%
Array(2040001, 500), //头盔防御卷轴60%
Array(2040002, 500), //头盔防御卷轴10%
Array(2040003, 500), //头盔体力卷轴100%
Array(2040004, 500), //头盔体力卷轴60%
Array(2040005, 500), //头盔体力卷轴10%
Array(2040008, 500), //头盔防御诅咒卷轴70%
Array(2040009, 500), //头盔防御诅咒卷轴30%
Array(2040010, 500), //头盔体力诅咒卷轴70%
Array(2040011, 500), //头盔体力诅咒卷轴30%
Array(2040012, 500), //头盔智力卷轴70%
Array(2040013, 500), //头盔智力卷轴30%
Array(2040014, 500), //头盔命中率诅咒卷轴70%
Array(2040015, 500), //头盔命中率诅咒卷轴30%
Array(2040016, 600), //头盔命中率卷轴10%
Array(2040017, 500), //头盔命中率卷轴60%
Array(2040018, 500), //头盔命中率卷轴100%
Array(2040019, 500), //头盔防御卷轴65%
Array(2040020, 500), //头盔防御卷轴15%
Array(2040021, 500), //头盔体力卷轴65%
Array(2040022, 500), //头盔体力卷轴15%
Array(2040024, 500), //头盔智力卷轴100%
Array(2040025, 500), //头盔智力卷轴60%
Array(2040026, 500), //头盔智力卷轴10%
Array(2040027, 500), //头盔敏捷卷轴100%
Array(2040028, 750), //头盔敏捷卷轴70%
Array(2040029, 500), //头盔敏捷卷轴60%
Array(2040030, 500), //头盔敏捷卷轴30%
Array(2040031, 500), //头盔敏捷卷轴10%
Array(2040043, 500), //头盔敏捷卷轴65%
Array(2040044, 500), //头盔敏捷卷轴15%
Array(2040100, 500), //脸部装饰生命卷轴10%
Array(2040101, 500), //脸部装饰生命卷轴60%
Array(2040103, 500), //脸部装饰生命诅咒卷轴30%
Array(2040104, 500), //脸部装饰生命诅咒卷轴70%
Array(2040105, 500), //脸部装饰回避率卷轴10%
Array(2040106, 500), //脸部装饰回避率卷轴60%
Array(2040108, 500), //脸部装饰回避率诅咒卷轴30%
Array(2040109, 800), //脸部装饰回避率诅咒卷轴70%
Array(2040200, 200), //眼部装饰命中率卷轴10%
Array(2040201, 200), //眼部装饰命中率卷轴60%
Array(2040203, 200), //眼部装饰命中率诅咒卷轴30%
Array(2040204, 200), //眼部装饰命中率诅咒卷轴70%
Array(2040205, 200), //眼部装饰智力卷轴10%
Array(2040206, 200), //眼部装饰智力卷轴60%
Array(2040208, 200), //眼部装饰智力诅咒卷轴30%
Array(2040209, 200), //眼部装饰智力诅咒卷轴70%
Array(2040300, 100), //耳环智力卷轴100%
Array(2040301, 100), //耳环智力卷轴60%
Array(2040302, 150), //耳环智力卷轴10%
Array(2040304, 100), //耳环智力诅咒卷轴70%
Array(2040305, 100), //耳环智力诅咒卷轴30%
Array(2040306, 200), //耳环敏捷卷轴70%
Array(2040307, 200), //耳环敏捷卷轴30%
Array(2040308, 500), //耳环防御力诅咒卷轴70%
Array(2040309, 500), //耳环防御力诅咒卷轴30%
Array(2040310, 500), //耳环防御力卷轴10%
Array(2040311, 500), //耳环防御力卷轴60%
Array(2040312, 500), //耳环防御力卷轴100%
Array(2040313, 100), //耳环智力卷轴65%
Array(2040314, 200), //耳环智力卷轴15%
Array(2040316, 100), //耳环敏捷卷轴100%
Array(2040317, 100), //耳环敏捷卷轴60%
Array(2040318, 200), //耳环敏捷卷轴10%
Array(2040319, 200), //耳环装饰运气卷轴100%
Array(2040320, 200), //耳环运气卷轴70%
Array(2040321, 200), //耳环装饰运气卷轴60%
Array(2040322, 200), //耳环装饰运气卷轴30%
Array(2040323, 100), //耳环运气卷轴10%
Array(2040324, 500), //耳环装饰体力卷轴100%
Array(2040325, 600), //耳环装饰体力卷轴70%
Array(2040326, 100), //耳环装饰体力卷轴60%
Array(2040327, 100), //耳环装饰体力卷轴30%
Array(2040328, 100), //耳环装饰体力卷轴10%
Array(2040335, 500), //耳环装饰敏捷卷轴65%
Array(2040336, 500), //耳环装饰敏捷卷轴15%
Array(2040337, 500), //耳环装饰运气卷轴65%
Array(2040338, 500), //耳环装饰运气卷轴15%
Array(2040339, 500), //耳环装饰体力卷轴65%
Array(2040340, 500), //耳环装饰体力卷轴15%
Array(2040400, 500), //上衣防御卷轴100%
Array(2040401, 500), //上衣防御卷轴60%
Array(2040402, 500), //上衣防御卷轴10%
Array(2040404, 500), //上衣防御诅咒卷轴70%
Array(2040405, 500), //上衣防御诅咒卷轴30%
Array(2040406, 500) //上衣力量卷轴70%
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			text = "#h0#,您可以在这里购买#e#b普通卷轴#n#k,请选择你想要购买的物品\r\n#b";
			for (var i=0; i<itemlist.length; i++) {
				text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# - #r"+(itemlist[i][1]*500)+"#b游戏币  \r\n";
				if (i != 0 && (i+1) % 5 == 0) {
					text += "\r\n";
				}
			}
            cm.sendSimple(text);
        } else if (a == 1) {
			selects = selection;
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r1个需要" + (itemlist[selects][1]*500) + "个#b游戏币#k", 0, 0, 999999);
        } else if (a == 2) {
            buynum = selection;
            cm.sendNext("你想购买" + buynum + "个#r#i" + itemlist[selects][0] + "##k？\r\n你将使用掉" + (buynum * itemlist[selects][1]*500) + "游戏币。");
        } else if (a == 3) {
            if (cm.getPlayer().getMeso() >= -buynum * itemlist[selects][1]*500) {
                cm.gainMeso(-buynum * itemlist[selects][1]*500);
                cm.gainItem(itemlist[selects][0], buynum);
                cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的游戏币。");
                cm.dispose();
            }
        }
    }//mode
}//f