var a = 0;
var text;
var selects; //记录玩家的选项
var buynum = 0;
var itemlist = Array(
Array(2040407, 500), //上衣力量卷轴30%
Array(2040408, 500), //上衣体力卷轴70%
Array(2040409, 500), //上衣体力卷轴30%
Array(2040410, 300), //上衣运气诅咒卷轴70%
Array(2040411, 300), //上衣运气诅咒卷轴30%
Array(2040412, 300), //上衣运气卷轴10%
Array(2040413, 300), //上衣运气卷轴60%
Array(2040414, 500), //上衣运气卷轴100%
Array(2040415, 500), //上衣防御力卷轴65%
Array(2040416, 500), //上衣防御力卷轴15%
Array(2040417, 500), //上衣力量卷轴100%
Array(2040418, 500), //上衣力量卷轴60%
Array(2040419, 500), //上衣力量卷轴10%
Array(2040420, 500), //上衣体力卷轴100%
Array(2040421, 500), //上衣体力卷轴60%
Array(2040422, 500), //上衣体力卷轴10%
Array(2040423, 500), //上衣运气卷轴100%
Array(2040424, 500), //上衣运气卷轴70%
Array(2040425, 500), //上衣运气卷轴60%
Array(2040426, 500), //上衣运气卷轴30%
Array(2040427, 500), //上衣运气卷轴10%
Array(2040431, 500), //上衣力量卷轴65%
Array(2040432, 500), //上衣力量卷轴15%
Array(2040433, 500), //上衣体力卷轴65%
Array(2040434, 500), //上衣体力卷轴15%"
Array(2040435, 500), //上衣运气卷轴65%
Array(2040436, 500), //上衣运气卷轴15%
Array(2040500, 500), //全身铠甲敏捷卷轴100%
Array(2040501, 200), //全身铠甲敏捷卷轴60%
Array(2040502, 100), //全身铠甲敏捷卷轴10%
Array(2040503, 300), //全身铠甲防御卷轴100%
Array(2040504, 100), //全身铠甲防御卷轴60%
Array(2040505, 200), //全身铠甲防御卷轴10%
Array(2040508, 300), //全身铠甲敏捷诅咒卷轴70%
Array(2040509, 300), //全身铠甲敏捷诅咒卷轴30%
Array(2040510, 300), //全身铠甲防御诅咒卷轴70%
Array(2040511, 300), //全身铠甲防御诅咒卷轴70%
Array(2040512, 300), //全身铠甲智力卷轴100%
Array(2040513, 300), //全身铠甲智力卷轴60%
Array(2040514, 200), //全身铠甲智力卷轴10%
Array(2040515, 400), //全身铠甲运气卷轴100%
Array(2040516, 400), //全身铠甲运气卷轴60%
Array(2040517, 300), //全身铠甲运气卷轴10%
Array(2040518, 400), //全身盔甲智力卷轴70%
Array(2040519, 400), //全身盔甲智力卷轴30%
Array(2040520, 400), //全身盔甲幸运卷轴70%
Array(2040521, 400), //全身盔甲幸运卷轴30%
Array(2040522, 400), //全身盔甲敏捷卷轴65%
Array(2040523, 300), //全身盔甲敏捷卷轴15%
Array(2040524, 400), //全身盔甲防御卷轴65%
Array(2040525, 400), //全身盔甲防御卷轴15%
Array(2040526, 300), //全身盔甲智力卷轴65%
Array(2040527, 400), //全身盔甲智力卷轴15%
Array(2040528, 300), //全身盔甲幸运卷轴65%
Array(2040529, 400), //全身盔甲幸运卷轴15%
Array(2040530, 500), //全身盔甲力量卷轴100%
Array(2040531, 400), //全身盔甲力量卷轴70%
Array(2040532, 400), //全身盔甲力量卷轴60%
Array(2040533, 400), //全身盔甲力量卷轴30%
Array(2040534, 300), //全身盔甲力量卷轴10%
Array(2040540, 400), //全身盔甲力量卷轴65%
Array(2040541, 500), //全身盔甲力量卷轴15%
Array(2040600, 500), //裤/裙防御卷轴100%
Array(2040601, 500), //裤/裙防御卷轴60%
Array(2040602, 500), //裤/裙防御卷轴10%
Array(2040604, 500), //裤/裙防御诅咒卷轴70%
Array(2040605, 500), //裤/裙防御诅咒卷轴30%
Array(2040606, 500), //裤裙跳跃诅咒卷轴70%
Array(2040607, 500), //裤裙跳跃诅咒卷轴30%
Array(2040608, 500), //裤裙体力诅咒卷轴70%
Array(2040609, 500), //裤裙体力诅咒卷轴30%
Array(2040610, 500), //裤裙敏捷诅咒卷轴70%
Array(2040611, 500), //裤裙敏捷诅咒卷轴30%
Array(2040612, 500), //裤裙敏捷卷轴10%
Array(2040613, 500), //裤裙敏捷卷轴60%
Array(2040614, 500), //裤裙敏捷卷轴100%
Array(2040615, 500), //裤裙防御卷轴65%
Array(2040616, 500), //裤裙防御卷轴15%
Array(2040617, 500), //裤裙跳跃卷轴100%
Array(2040618, 500), //裤裙跳跃卷轴60%
Array(2040619, 500), //裤裙跳跃卷轴10%
Array(2040620, 500), //裤裙体力卷轴100%
Array(2040621, 500), //裤裙体力卷轴60%
Array(2040622, 500), //裤裙体力卷轴10%
Array(2040623, 300), //裤裙敏捷卷轴100%
Array(2040624, 300), //裤裙敏捷卷轴70%
Array(2040625, 300), //裤裙敏捷卷轴60%
Array(2040626, 300), //裤裙敏捷卷轴30%
Array(2040627, 200), //裤裙敏捷卷轴10%
Array(2040631, 100), //裤裙跳跃卷轴65%
Array(2040632, 300)//裤裙跳跃卷轴15%
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			text = "#h0#,您可以在这里购买#e#b普通卷轴#n#k,请选择你想要购买的物品\r\n#b";
			for (var i=0; i<itemlist.length; i++) {
				text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# - #r"+(itemlist[i][1]*500)+"#b游戏币  \r\n";
				if (i != 0 && (i+1) % 5 == 0) {
					text += "\r\n";
				}
			}
            cm.sendSimple(text);
        } else if (a == 1) {
			selects = selection;
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r1个需要" + (itemlist[selects][1]*500) + "个#b游戏币#k", 0, 0, 999999);
        } else if (a == 2) {
            buynum = selection;
            cm.sendNext("你想购买" + buynum + "个#r#i" + itemlist[selects][0] + "##k？\r\n你将使用掉" + (buynum * itemlist[selects][1]*500) + "游戏币。");
        } else if (a == 3) {
            if (cm.getPlayer().getMeso() >= -buynum * itemlist[selects][1]*500) {
                cm.gainMeso(-buynum * itemlist[selects][1]*500);
                cm.gainItem(itemlist[selects][0], buynum);
                cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的游戏币。");
                cm.dispose();
            }
        }
    }//mode
}//f