/*  This is mada by Kent    
 *  This source is made by Funms Team
 *  功能：隐藏的椅子
 *  @Author Kent 
 */

var a = 0;
var luckyItem = Array();
var selectedItem;
var pass = true;
var needOnlineTime = 720;		//需要在线时间
var Allitem = Array(
        3010984, //苹果
        3010020, //一代不速之客 指节
        3010021, //三代不速之客弓
        3010024, //传说狂龙怒斩
        3010025, //二代不速之客 指节
        3010026, //冒险岛宝石斧
        3010028, //耳环智力卷轴65%
        3010029, //耳环装饰敏捷卷轴65%
        3010030, //耳环装饰运气卷轴65%
        3010031, //上衣力量卷轴65%
        3010032, //上衣运气卷轴65%
        3010033, //全身盔甲敏捷卷轴65%
        3010034, //全身盔甲幸运卷轴65%
        3010035, //全身盔甲智力卷轴65%
        3010036, //全身盔甲力量卷轴65%
        3010037, //裤裙防御卷轴65%
        3010038, //鞋子跳跃卷轴65%
        3010039, //手套敏捷卷轴65%
        3010040, //裤裙敏捷卷轴65%
        3010041, //手套攻击卷轴65%
        3010042, //盾牌力量卷轴65%
        3010043, //披风智力卷轴65%
        3010044, //盾牌运气卷轴65%
        3010045, //披风敏捷卷轴65%
        3010046, //披风幸运卷轴65%
        3010047, //单手剑攻击卷轴65%
        3010048, //单手斧攻击卷轴65%
        3010049, //单手钝器攻击卷轴65%
        3010050, //刀攻击力卷轴65%
        3010051, //短杖魔力卷轴65%
        3010052, //短剑攻击卷轴65%
        3010053, //长杖魔力卷轴65%
        3010054, //双手剑攻击卷轴65%
        3010055, //双手斧攻击卷轴65%
        3010056, //双手钝器攻击卷轴65%
        3010057, //单手钝器命中卷轴65%
        3010058, //枪攻击卷轴65%
        3010059, //矛攻击卷轴65%
        3010060, //弓攻击卷轴65%
        3010061, //弩攻击卷轴65%
        3010062, //拳套攻击卷轴65%
        3010063, //拳甲攻击卷轴65%
        3010064, //指节命中卷轴65%
        3010065, //短枪攻击卷轴65%
        3010066, //双弩枪攻击力卷轴65%
        3010067, //50%混沌卷
        3010068, //60%混沌卷
        3010069, //皮制手提包
        3010070, //007提包
        3010071, //马桶吸
        3010072, //方形铁铲
        3010073, //三角铁铲
        3010074, //红色砖头
        3010075, //粉色花边游泳圈
        3010076, //永恒惊破天
        3010077, //重生惊破天
        3010078, //圣诞六翼天使武器(单手钝器)
        3010079, //采矿铁锹
        3010080, //野外烧烤串
        3010081, //枫叶3年旗
        3010082, //粉色花边游泳圈
        3010083, //初级盗贼的短剑
        3010084, //新手刮胡刀
        3010085, //高原之剑
        3010086, //半月巨刀
        3010087, //钢铁剑
        3010088, //木球棍
        3010089, //铝球棍
        3010090, //无极剑
        // 椅子部分
        3010106,
//雪狼战椅
//战神最爱的雪狼。\n每10秒HP和MP各恢复50。

        3010107,
//龙龙的蛋壳椅
//坐在上面时，每10秒恢复HP的龙龙的蛋壳。是只有龙神可以拥有的特殊椅子。

        3010108,
//幼龙秋千
//幼龙晃动的秋千椅。坐在上面，每10秒HP恢复40，MP恢复20。

        3010109,
//暖炉椅
//让人感觉温暖的椅子，使用后每10秒恢复HP 40、MP 20。

        3010110,
//舒适大白熊椅子
//抱着非常的温暖，每10秒钟回复HP、MP各50。

        3010111,
//虎虎生威
//王者最爱的椅子。坐在上面每10秒钟可恢复HP50、MP30。

        3010112,
//情书柜子
//堆满情书的柜子,适合送给恋人的椅子..\n每10秒钟恢复HP 50.

        3010113,
//幽魂发条熊椅子
//使用后每10秒恢复HP 50。
//
        3016000, //大象跷跷板椅子
        3015272, //紫蛙蛙滑梯椅子
        3015227, //与莫拉野餐椅子
        3015225, //和大象一起自拍椅子
        3010715, //幸福9周年蛋糕椅子
        3015227, //梦幻水晶球椅子	
        3015157, //安德洛墨达椅子
        3015182, //蝶恋花椅子
        3015193, //被驯服的鲸鱼椅子
        3015096, //羊羊幻想牧场椅子
        3015109, //花花幻想曲
        3015053, //松软三重绵羊椅
        3015304, //哗啦啦大水车
        // 能手册部分！
        2290245, //尖兵的神秘能手册
        2290285, //[能手册]神秘能手册
        2290448, //英雄的神秘能手册
        2290449, //圣骑士的神秘能手册
        2290450, //黑骑士的神秘能手册
        2290451, //火毒魔导师的神秘能手册
        2290452, //冰雷魔导师的神秘能手册
        2290453, //主教的神秘能手册
        2290454, //神射手的神秘能手册
        2290455, //箭神的神秘能手册
        2290456, //侠盗的神秘能手册
        2290457, //隐士的神秘能手册
        2290458, //暗影双刀的神秘能手册
        2290459, //冲锋队长的神秘能手册
        2290460, //船长的神秘能手册
        2290461, //火炮手的神秘能手册
        2290462, //战神的神秘能手册
        2290463, //龙神的神秘能手册
        2290464, //双弩精灵的神秘能手册
        2290465, //恶魔猎手的神秘能手册
        2290466, //唤灵斗师的神秘能手册
        2290467, //豹弩游侠的神秘能手册
        2290468, //机械师的神秘能手册
        2290571, //幻影的神秘能手册
        2290602, //米哈尔的神秘能手册
        2290723, //狂龙战士神秘能手册
        2290724, //爆莉萌天使神秘能手册
        2290868, //英雄的神秘能手册
        2290869, //圣骑士的神秘能手册
        2290870, //黑骑士的神秘能手册
        2290871, //火毒魔导师的神秘能手册
        2290872, //冰雷魔导师的神秘能手册
        2290873, //主教的神秘能手册
        2290874, //神射手的神秘能手册
        2290875, //箭神的神秘能手册
        2290876, //侠盗的神秘能手册
        2290877, //隐士的神秘能手册
        2290878, //暗影双刀的神秘能手册
        2290879, //冲锋队长的神秘能手册
        2290880, //船长的神秘能手册
        2290881, //火炮手的神秘能手册
        2290882, //战神的神秘能手册
        2290883, //龙神的神秘能手册
        2290884, //双弩精灵的神秘能手册
        2290885, //恶魔猎手的神秘能手册
        2290886, //唤灵斗师的神秘能手册
        2290887, //豹弩游侠的神秘能手册
        2290888, //机械师的神秘能手册
        2290889, //幻影的神秘能手册
        2290891, //狂龙战士神秘能手册
        2290892, //爆莉萌天使神秘能手册
        2290914, //恶魔复仇者的神秘能手册
        2290915, //恶魔复仇者的神秘能手册
        2291137 //隐月的神秘能手册
        );

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
            if (cm.getPlayer().getOnlineTime() < needOnlineTime) {
                cm.sendNextS("您当前在线时间不足#r" + needOnlineTime + "#k分钟,无法参与该活动,\r\n请#r" + (needOnlineTime - cm.getPlayer().getOnlineTime()) + "#k分钟后再试.", 3);
                cm.dispose();
                return;
            } else if (cm.getPQLog('HOTTIME隐藏椅子的箱子') > 0) {
                cm.sendNextS("今天你不能再参加这个活动了。\r\n隐藏椅子的箱子活动一天只能进行一次。", 3);
                cm.dispose();
                return;
            }
            for (var i = 1; i < 5; i++) {
                if (cm.getSpace(i) < 1) {
                    pass = false;
                }
            }
            if (cm.getSpace(2) >= 1 && cm.getSpace(4) >= 1) {
                var text = " #e今天我可能领取到的物品为：#n\r\n#r  - 请仔细看好您要的装备，稍后会打乱目录。\r\n  - 打乱目录后的道具将以问号箱子显示。\r\n  - 届时只要点击你想要的问号椅子箱子，就可以领取道具了！\r\n\r\n#b";
                Allitem.sort(function () {
                    return 0.5 - Math.random();
                });//随机打乱道具池
                for (var i = 0; i < Allitem.length; i++) {
                    if (i % 5 == 0 && i % 3 == 0) {
                        luckyItem.push(Allitem[i]);//特定计算部分加载到 可领取数组里面
                    }
                }
                for (var i = 0; i < luckyItem.length; i++) {
                    text += "#i" + luckyItem[i] + "# #z" + luckyItem[i] + "#\r\n";
                }
                cm.sendNextS(text, 3);
                cm.setPQLog('HOTTIME隐藏椅子的箱子');
            } else {
                cm.sendOk("请让你的所有背包栏空出一个格子。");
                cm.dispose();
            }
        } else if (a == 1) {
            luckyItem.sort(function () {
                return 0.5 - Math.random();
            });//随机打乱道具池
            var text = "今天的奖品都变成了可疑椅子的箱子，并且被打乱了。\r\n咦，到底是哪个呢？\r\n\r\n#b";
            for (var i = 0; i < luckyItem.length; i++) {
                text += "#L" + i + "##fUI/UIWindow.img/QuestIcon/5/0#    打开便知晓!#l\r\n";

            }
            cm.sendSimpleS(text, 3);
        } else if (a == 2) {
            var n = selection + 1;
            var text = "我刚才选择的是第" + n + "个道具.现在秘密的椅子箱子里面的道具跑出来了:\r\n - 点击下一步领取物品。\r\n\r\n#b";
            selectedItem = luckyItem[selection]
            for (var i = 0; i < luckyItem.length; i++) {
                if (selection == i) {
                    text += "#e#i" + luckyItem[i] + "#    #z" + luckyItem[i] + "#   (您选择的椅子箱子 )\r\n#n";
                } else {
                    text += "#i" + luckyItem[i] + "#    #z" + luckyItem[i] + "#\r\n";
                }
            }
            cm.sendNextS(text, 3);
        } else if (a == 3) {
            cm.gainItem(selectedItem, 1);
            cm.sendOk("成功打开箱子，我赠送给你了 #b#t" + selectedItem + "##k。");
            cm.dispose();
        }//a
    }//mode
}//f