var a = 0;
var text;
var selects; //记录玩家的选项
var buynum = 0;
var itemlist = Array(
//Array(2432069, 20),//公测删
//Array(2432741, 20),//公测删
//Array(1672016, 20),//公测删
//Array(2431938, 20),//公测删
//Array(1402180, 20),//公测删
Array(1022148, 390),//  这个是眼饰的 
//Array(1012319, 410), // 这个是脸饰的
//Array(1112918, 30),
//Array(2431938, 288),
Array(2070019, 20),
//Array(1132246, 228),
//Array(1122267, 228),
//Array(1032223, 300),
//Array(1113075, 300),
//Array(1122122, 420),//冒险觉醒之心
//Array(1122123, 420),//冒险觉醒之心
//Array(1122124, 420),// -冒险觉醒之心
//Array(1122125, 420),//  - 冒险觉醒之心
//Array(1122126, 420),//  -冒险觉醒之心
Array(1102471, 160), // 赫里希安精锐战士披风 // (无描述)
Array(1102472, 160), // 赫里希安精锐法师披风 // (无描述)
Array(1102473, 160), // 赫里希安精锐弓箭手披风 // (无描述)
Array(1102474, 160), // 赫里希安精锐飞侠披风 // (无描述)
Array(1102475, 160), // 赫里希安精锐海盗披风 // (无描述)
Array(1072732, 160), // 赫里希安精锐战士靴 // (无描述)
Array(1072733, 160), // 赫里希安精锐法师靴 // (无描述)
Array(1072734, 160), // 赫里希安精锐弓箭手靴 // (无描述)
Array(1072735, 160), // 赫里希安精锐飞侠靴 // (无描述)
Array(1072736, 160), // 赫里希安精锐海盗靴 // (无描述)
Array(1132164, 160), // 赫里希安精锐战士腰带 // (无描述)
Array(1132165, 160), // 赫里希安精锐法师腰带 // (无描述)
Array(1132166, 160), // 赫里希安精锐弓箭手腰带 // (无描述)
Array(1132167, 160), // 赫里希安精锐飞侠腰带 // (无描述)
Array(1132168, 160), // 赫里希安精锐海盗腰带 // (无描述)
/*
Array(1102476, 220), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 220), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 220), // 诺巴凯伦披风 // (无描述)
Array(1102479, 220), // 诺巴利卡昂披风 // (无描述)
Array(1102480, 220), // 诺巴阿尔泰披风 // (无描述)
Array(1072737, 220), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 220), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 220), // 诺巴凯伦靴 // (无描述)
Array(1072740, 220), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 220), // 诺巴阿尔泰靴 // (无描述)
Array(1132169, 250), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 250), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 250), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 250), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 250), // 诺巴阿尔泰腰带 // (无描述)
/*
Array(1102481, 298), // 暴君西亚戴斯披风 // (无描述)
Array(1102482, 298), // 暴君赫尔梅斯披风 // (无描述)
Array(1102483, 298), // 暴君凯伦披风 // (无描述)
Array(1102484, 298), // 暴君利卡昂披风 // (无描述)
Array(1102485, 298), // 暴君阿尔泰披风 // (无描述)
Array(1072743, 298), // 暴君西亚戴斯靴 // (无描述)
Array(1072744, 298), // 暴君赫尔梅斯靴 // (无描述)
Array(1072745, 298), // 暴君凯伦靴 // (无描述)
Array(1072746, 298), // 暴君利卡昂靴 // (无描述)
Array(1072747, 298), // 暴君阿尔泰靴 // (无描述)
Array(1132174, 298), // 暴君西亚戴斯腰带 // (无描述)
Array(1132175, 298), // 暴君赫尔梅斯腰带 // (无描述)
Array(1132176, 298), // 暴君凯伦腰带 // (无描述)
Array(1132177, 298),// 暴君利卡昂腰带 // (无描述)
Array(1132178, 298),// 暴君阿尔泰腰带 // (无描述)*/
Array(1142210, 60),//  - 
Array(1142178, 60)//  -
//Array(3994417,260)// - 红色蜡笔 - 红色蜡笔。
//Array(3994418,260),// - 橙色蜡笔 - 橙色蜡笔。
//Array(3994419,260)// - 黄色蜡笔 - 黄色蜡笔。
/*
Array(3994420,260),// - 绿色蜡笔 - 绿色蜡笔。
Array(3994421,260),// - 青色蜡笔 - 青色蜡笔。
Array(3994422,260)// - 蓝色蜡笔 - 蓝色蜡笔。Array(3994423,260)// - 紫色蜡笔 - 紫色蜡笔。 */
);

function start() {
    a = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
		cm.sendOk("好吧，等你考虑清楚了再来找我。");
        cm.dispose();
    } else {
        if (mode == 1)
            a++;
        else
            a--;
        if (a == -1) {
            cm.dispose();
        } else if (a == 0) {
			text = "#h0#,您可以在这里兑换#e#b上乘装备#n#k,请选择你想要购买的物品\r\n#b";
			for (var i=0; i<itemlist.length; i++) {
				var validtime = "";
				if (itemlist[i][2]!=null) {
					validtime="/ #e"+itemlist[i][2]+"天权#n";
				}
				text += "#L" + i + "##i" + itemlist[i] + ":##t" + itemlist[i] + "# "+validtime+" - #r"+itemlist[i][1]+"#b中介币  \r\n";
				if (i != 0 && (i+1) % 5 == 0) {
					text += "\r\n";
				}
			}
            cm.sendSimple(text);
			/*
        } else if (a == 1) {
			selects = selection;
            cm.sendGetNumber("请输入你请你输入想要购买的数量\r\n\r\n#r1个需要" + itemlist[selects][1] + "个#b中介币#k", 0, 0, 999999);*/
        } else if (a == 1) {
            selects = selection;
			buynum = 1;
            cm.sendYesNo("你想购买" + buynum + "个#r#i" + itemlist[selects][0] + "##k？\r\n你将使用掉" + (buynum * itemlist[selects][1]) + "中介币。");
        } else if (a == 2) {
            if (cm.haveItem(4000463,buynum * itemlist[selects][1])) {
                cm.gainItem(4000463, -buynum * itemlist[selects][1]);
				if (itemlist[selects][2]!=null) {
					cm.gainItem(itemlist[selects][0], buynum, itemlist[selects][2]);	
				} else {
                	cm.gainItem(itemlist[selects][0], buynum);
				}
				cm.sendOk("购买成功了！");
                cm.dispose();
            } else {
                cm.sendOk("对不起，你没有足够的中介币。");
                cm.dispose();
            }
        }
    }//mode
}//f
