/* 点卷商城 - 椅子 */

var status = -1;
var itemList = Array(
// -----价格为 30000 点卷 --------
Array(3010002, 30000), //绿色时尚转椅
Array(3010003, 30000), //红色时尚转椅
Array(3010006, 30000), //黄色时尚转椅
Array(3010004, 30000), //黄蓝休闲椅
Array(3010005, 30000), //红蓝休闲椅
Array(3010018, 30000), //椰子树沙滩椅
Array(3010029, 30000), //蓝环凳
Array(3010030, 30000), //黑环凳
Array(3010031, 30000), //红环凳
Array(3010032, 30000), //黄环凳
Array(3010033, 30000), //绿环凳
Array(3010043, 30000), //魔女的飞扫把
Array(3013002, 30000), //烟花祭
Array(3010166, 30000), //双刀同门
// -----价格为 45000 点卷 --------
Array(3010007, 45000), //粉色海豹靠垫
Array(3010008, 45000), //蓝色海豹靠垫
Array(3010010, 45000), //白色海豹靠垫
Array(3010016, 45000), //黑色海豹靠垫
Array(3010017, 45000), //金色海豹靠垫
Array(3010024, 45000), //玩具粉熊椅
Array(3010025, 45000), //枫叶纪念凳
// -----价格为 60000 点卷 --------
Array(3010014, 60000), //月亮弯
Array(3010019, 60000), //寿司椅
Array(3010021, 60000), //暖暖桌
Array(3010034, 60000), //悠长假期(红)
Array(3010035, 60000), //悠长假期(蓝)
Array(3010037, 60000), //猪猪凳
Array(3010038, 60000), //空气沙发
Array(3010040, 60000), //蝙蝠椅
Array(3010041, 60000), //骷髅王座
Array(3010044, 60000), //同一红伞下
Array(3010045, 60000), //寒冰椅子
Array(3010049, 60000), //雪房子
Array(3010068, 60000), //露水椅子
Array(3010050, 60000), //公主凳
Array(3010069, 60000), //大黄风
Array(3010093, 60000), //鲜美的火鸡
Array(3010094, 60000), //漂漂猪椅子
Array(3010095, 60000), //石头人座椅
// -----价格为 60000 点卷 --------
Array(3010009, 60000), //塌塌凳
Array(3010028, 60000), //海盗的俘虏
Array(3010036, 60000), //浪漫秋千
Array(3010046, 60000), //红龙椅
Array(3010047, 60000), //蓝龙椅
Array(3010048, 60000), //圣诞树椅子
Array(3010051, 60000), //沙漠兔子靠垫1
Array(3010052, 60000), //沙漠兔子靠垫2
Array(3010054, 60000), //呼噜呼噜床
Array(3010057, 60000), //血色玫瑰
Array(3010058, 60000), //世界末日
Array(3010071, 60000), //神兽椅
Array(3010073, 60000), //baby品克缤
Array(3010075, 60000), //我为音乐狂
Array(3010077, 60000), //猫头鹰椅子
Array(3010096, 60000), //恐龙化石宝座
Array(3010098, 60000), //电视宅人
Array(3010099, 60000), //北极熊椅子
Array(3010100, 60000), //财神椅子
Array(3010110, 60000), //舒适大白熊椅子
Array(3010111, 60000), //虎虎生威
Array(3010112, 60000), //情书柜子
Array(3010116, 60000), //摇滚之魂椅子
Array(3010117, 60000), //魔法书椅子
Array(3010118, 60000), //糖果音符椅子
Array(3010119, 60000), //羊羊椅子
Array(3010120, 60000), //彩蛋篮子
Array(3010123, 60000), //夏日花朵
Array(3010124, 60000), //都纳斯喷气椅子
Array(3010125, 60000), //尼贝隆战舰椅
Array(3010126, 60000), //蝙蝠魔王座
Array(3012001, 60000), //篝火
Array(3012002, 60000), //浴桶
Array(3010066, 60000), //深蓝色绒毛沙发
Array(3010067, 60000), //红色设计师椅
Array(3010080, 60000), //柿子树鞦韆 
Array(3010081, 60000), //红帽月妙抱枕椅
Array(3010082, 60000), //蓝帽月妙抱枕椅
Array(3010083, 60000), //扇子月妙抱枕椅
Array(3010084, 60000), //太平萧月妙抱枕椅
Array(3010107, 60000), //龙龙的蛋壳椅
Array(3010108, 60000), //幼龙秋千
Array(3010109, 60000), //暖炉椅
Array(3010113, 60000), //幽魂发条熊椅子
Array(3010055, 60000), //冰雪糕丸子椅
Array(3010145, 60000), //周年庆水晶枫叶椅
Array(3010136, 60000), //6周年怪物王座
Array(3010137, 60000), //神龙椅子
Array(3010149, 60000), //猫咪风扇椅
Array(3010144, 60000), //七夕椅子
Array(3010155, 60000), //暗影双刀的猫头鹰
Array(3010078, 60000), //大熊猫椅子
Array(3010132, 60000), //撒娇猫咪椅
Array(3010133, 60000), //帐篷椅
// -----价格为 60000 点卷 --------
Array(3012003, 60000), //爱心椅子
Array(3012006, 60000), //风吹稻香
Array(3012010, 60000), //巧克力蛋糕恋人
Array(3012011, 60000), //我爱巧克力火锅
Array(3010156, 60000), //浮游飞行器
Array(3010152, 60000), //黄三角帐篷椅
Array(3010162, 60000), //果月椅子
Array(3010163, 60000), //满月椅
Array(3010135, 60000), //节日独角兽椅子
Array(3010139, 60000), //私密空间
Array(3010168, 60000), //友谊万岁椅子
Array(3010172, 60000), //星空椅子
Array(3010173, 60000), //万圣节塔罗椅子
Array(3010175, 60000), //名画家椅子
Array(3010179, 60000), //燕尾服猫咪椅
Array(3010169, 60000), //纸箱里(求领养)
Array(3010171, 60000), //过来抱抱椅
Array(3010174, 60000), //女巫炼药椅
Array(3010182, 60000), //兔子家族椅
Array(3010183, 60000), //胡萝卜椅子
Array(3010053, 60000), //兔子纪念版椅子
Array(3010142, 60000), //水族馆椅子
Array(3010209, 60000), //草莓冰淇淋月饼椅
Array(3010210, 60000), //香草冰淇淋月饼椅
Array(3010197, 60000), //英雄的椅子-战神
Array(3010200, 60000), //英雄的椅子-龙神
Array(3010201, 60000), //英雄的椅子-暗影
Array(3010161, 60000), //鼠鼠椅
Array(3010226, 60000), //月光仙子椅子
Array(3010085, 60000), //鬼娃娃椅子
Array(3013000, 60000), //樱花树下
Array(3010177, 60000), //手柄座椅
Array(3010454, 60000), //云朵
Array(3010591, 100000), //漫画书椅子
Array(3010127, 100000), //扎昆宝座
Array(3010128, 100000), //黑龙王椅
Array(3010311, 100000), //黑龙椅子
Array(3010799, 150000), //坟墓幽灵椅子
Array(3010896, 250000), //我的女皇椅子
Array(3010689, 250000), //10周年椅子
Array(3010751, 250000), //鲸鱼椅子
Array(3010752, 250000), //玫瑰鸟笼
Array(3010754, 250000), //百鬼夜行
Array(3012020, 400000), //紫藤花吊篮椅
Array(3010779, 400000), //金马祥云轿
Array(3010788, 400000), //巨无霸年夜饭
Array(3010783, 300000), //蓝色邦尼屋
Array(3010876, 300000), //冒险岛行星椅子
Array(3010696, 300000), //大黄鸭
Array(3010715, 300000), //幸福9周年蛋糕气球椅
Array(3010070, 300000), //巨无霸品克缤
Array(3010828, 300000), //木星椅子
Array(3010829, 650000), //木星椅子
Array(3012025, 650000), //思念小鸡双人椅
Array(3010879, 500000), //枫叶冒险岛椅子
Array(3010877, 500000), //人鱼珊瑚礁
Array(3012024, 500000), //沙滩排球椅子
Array(3010832, 500000) //太阳椅子
);
var selectedItem = -1;
var selectedCost = -1;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status >= 0) {
            cm.dispose();
            return;
        }
        status--;
    }
    if (status == 0) {
        var selStr = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n#fUI/UIWindow2.img/QuestAlarm/BtQ/normal/0#亲爱的#r#h ##k您好，请选择您希望购买的道具：";
        for (var i = 0; i < itemList.length; i++) {
            selStr += "\r\n#L" + i + "##i" + itemList[i][0] + ":# #b#t" + itemList[i][0] + "##k   #r" + itemList[i][1] / 5 + " #k点卷#l";
        }
        cm.sendSimple(selStr);
    } else if (status == 1) {
        var item = itemList[selection];
        if (item != null) {
            selectedItem = item[0];
            selectedCost = item[1] / 5;
            cm.sendYesNo("您是否购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + " #k 点卷？");
        } else {
            cm.sendOk("出现错误...");
            cm.dispose();
        }
    } else if (status == 2) {
        if (selectedCost <= 0 || selectedItem <= 0) {
            cm.sendOk("购买道具出现错误...");
            cm.dispose();
            return;
        }
        if (cm.getPlayer().getCSPoints(1) >= selectedCost) {
            var gachaponItem = cm.gainGachaponItem(selectedItem, 1, "点卷商店", 3, true);
            if (gachaponItem != -1) {
                cm.gainNX( - selectedCost);
                cm.sendOk("恭喜您成功购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k。");
            } else {
                cm.sendOk("购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。");
            }
        } else {
            cm.sendOk("您没有那么多点卷。\r\n\r\n购买#i" + selectedItem + ":# #b#t" + selectedItem + "##k 需要 #r" + selectedCost + "#k 点卷。");
        }
        cm.dispose();
    }
}
