
var status = 0;

var mdx = 0;

var md1 = Array(
Array(0,0),
Array(50000,1),//大蘑菇
Array(100010100,10),//射手村-梦境小道
Array(100040000,20),//石人寺院-石人寺院入口
Array(106020100,30),//火焰之地-灰烬之地
Array(200081500,40),//神秘岛-通天塔7
Array(200010000,50),//神秘岛-云彩公园1
Array(551000200,59),//马来西亚-大红花路2
Array(261020300,88),//卡帕莱特研究所-研究所C-1
Array(240011000,99)//神木村-东边森林
)

var md2 = Array(
0,
910000000,//自由市场
104000000,//明珠港
102000000,//勇士部落
101000000,//魔法密林
100000000,//射手村
103000000,//废弃都市
120000100,//诺特勒斯
105000000,//林中之城
104000000,//明珠港
101050000,//埃欧雷
106020000,//蘑菇城
200000000,//天空之城
211000000,//冰封雪域
211060010,//狮子城堡入口
211041400,//死亡之林4
130000200,//圣地
230000000,//水下世界
914040000,//里恩
220000000,//玩具城
221000000,//地球防御本部
222000000,//童话村
300000000,//阿尔泰营地
240000000,//神木村
240030000,//龙林入口
310000000,//埃尔斯坦
310040200,//矿山入口
250000000,//武陵
251000000,//百草堂
260000000,//阿里安特
261000000,//玛加提亚
270000000,//三个门
271010000,//破坏的射手村
703000000,//被破坏的新叶城
701000000,//东方神州-上海
702000000,//东方神州-崇山镇
500000000,//泰国-水上市场
600000000,//新叶城
550000000,//马来西亚-吉隆大都市
801000000,//昭和村
540000000,//新加坡
800000000//古代神社
)

var md5 = Array(
0,
541020700,//克雷塞尔遗迹(千年树妖王)
551030100,//阴森世界入口
220080000,//时间塔的隐秘场所
689010000,//粉色扎昆入口
211042300,//扎昆入口
240050400//暗黑龙王洞穴入口
)

var md4 = Array(
0,
211042301,//进阶扎昆入口
272020110,//阿卡伊勒祭坛前面
240050400,//暗黑龙王洞穴入口
270050000,//忘却的黄昏
271040000//希纳斯的庭院
)

var md3 = Array(
0,
541020700,//克雷塞尔遗迹(千年树妖王)
551030100,//阴森世界入口
220080000,//时间塔的隐秘场所
689010000,//粉色扎昆入口
211042300,//扎昆入口
211042301,//进阶扎昆入口
240050400,//暗黑龙王洞穴入口
272020110,//阿卡伊勒祭坛前面
270050000,//忘却的黄昏
271040000//希纳斯的庭院
)

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
	var selStr = "您要去哪儿呢：\r\n#b#L1#练级地图\r\n#L2#城镇地图\r\n#L3#Boss地图" + ((cm.getPlayer().isGM())?"\r\n#L4#传送(GM专用)":"");
	cm.sendSimple(selStr);
    } else if(status == 1) {
	mdx = selection;
	var selStr = "选择您的目的地吧：#b"
	switch (mdx){
	case 1:
		for(var i = 1;i < md1.length;i++){
			selStr += "\r\n#L" + i + "##m" + md1[i][0] + "#(" + md1[i][1] + ")";
		}
		cm.sendSimple(selStr);
		break;
	case 2:
		for(var i = 1;i < md2.length;i++){
			selStr += "\r\n#L" + i + "##m" + md2[i] + "#";
		}
		cm.sendSimple(selStr);
		break;
	case 3:
		for(var i = 1;i < md3.length;i++){
			selStr += "\r\n#L" + i + "##m" + md3[i] + "#";
		}
		cm.sendSimple(selStr);
		break;
	case 4:
		if (cm.getPlayer().isGM()){
			cm.sendGetNumber("请输入您要去的地方",0,0,999999999);
		} else {
			cm.sendOk("对不起，此功能仅GM可用");
			cm.dispose();
		}
		break;
	default:
		cm.sendOk("default");
		cm.dispose();
		break;
	}
    } else if(status == 2) {
	switch (mdx){
	case 1:
		cm.warp(md1[selection][0]);
		break;
	case 2:
		cm.warp(md2[selection]);
		break;
	case 3:
		cm.warp(md3[selection]);
		break;
	case 4:
		cm.warp(selection);
		break;
	}
	cm.dispose();
    }
}