/* 传送幸运箱  转职送装备 */

var status;

var itemid = 2430472;

var jobs;
var items;
var nums;
var lvs;
var vipname;
var text0 = " ";//物品使用说明
var newjob;
var lvl;
var names;

var noThanks = "#d\r\n";

var noAdvance = "#k您现在的等级还不需要 #d转职向导服务 #k如果您是 #b冒险家#k 或者 #b骑士团 #k和 #b反抗者 #k达到 #e#r ";

var advance = " ";//第一主对话

var zbData = Array(
/*
//"剑", 
1302000, 0, 0,
//"小斧", 
1312004, 0, 0,
//"挑战之单手剑 - 10级", 
1302135, 10, 100,
//"挑战之单手斧 - 10级", 
1312049, 10, 100,
//"挑战之单手钝器 - 10级", 
1322077, 10, 100,
//"挑战之短刀 - 10级", 
1332104, 10, 400,
//"挑战之金属短杖 - 10级", 
1372063, 10, 200,
//"挑战之金属长杖 - 10级", 
1382085, 10, 200,
//"挑战之双手剑 - 10级", 
1402078, 10, 100,
//"挑战之双手斧 - 10级", 
1412048, 10, 100,
//"挑战之双手钝器 - 10级", 
1422050, 10, 100,
//"挑战之枪 - 10级", 
1432068, 10, 100,
//"挑战之矛 - 10级", 
1442096, 10, 100,
//"挑战之弓 - 10级", 
1452093, 10, 300,
//"挑战之弩 - 10级", 
1462078, 10, 300,
//"挑战之拳套 - 10级", 
1472104, 10, 400,
//"挑战之指节 – 10级", 
1482066, 10, 500,
//"挑战之短枪 – 10级", 
1492066, 10, 500,



//"挑战之单手剑 - 25级", 
1302138, 25, 100,
//"挑战之单手斧 - 25级", 
1312052, 25, 100,
//"挑战之单手钝器 - 25级", 
1322080, 25, 100,
//"挑战之短刀 - 25级", 
1332107, 25, 300,
//"挑战之金属短杖 - 25级", 
1372066, 25, 200,
//"挑战之金属长杖 - 25级", 
1382088, 25, 200,

*/

//"挑战之双手剑 - 25级", 
1402081, 25, 100,
//"挑战之双手斧 - 25级", 
1422053, 25, 100,
//"挑战之双手钝器 - 25级", 
1422053, 25, 100,
//"挑战之枪 - 25级", 
1432071, 25, 100, 100,
//"挑战之矛 - 25级", 
1442099, 25, 100, 100,
//"挑战之弓 - 25级", 
1452096, 25, 300, 300,
//"挑战之弩 - 25级", 
1462081, 25, 300, 300,
//"挑战之拳套 - 25级", 
1472107, 25, 400,
//"挑战之指节 – 25级", 
1482069, 25, 500,
//"挑战之短枪 – 25级", 
1492069, 25, 500,


//"挑战之单手剑  - 70级", 
1302141, 70, 100,
//挑战之单手斧 - 70级
1312055, 70, 100,
//"挑战之单手钝器 - 70级", 
1322083, 70, 100,
//"挑战之短刀 - 70级", 
1332110, 70, 300,
//"挑战之金属短杖 - 70级", 
1372069, 70, 200,
//"挑战之金属长杖 - 70级", 
1382091, 70, 200,
//"挑战之双手剑 - 70级", 
1402084, 70, 100,
//"挑战之双手斧 - 70级", 
1412054, 70, 100,
//"挑战之双手钝器 - 70级", 
1422056, 70, 100,
//"挑战之枪 - 70级", 
1432074, 70, 100,
//"挑战之矛 - 70级", 
1442102, 70, 100,
//"挑战之弓 - 70级", 
1452099, 70, 300,
//"挑战之弩 - 70级", 
1462084, 70, 300,
//"挑战之拳套 - 70级", 
1472110, 70, 400,
//"挑战之指节 – 70级", 
1482072, 70, 500,
//"挑战之短枪 – 70级", 
1492072, 70, 500,


//"挑战之单手剑 - 100级", 
1302078, 100, 100,
//"挑战之单手斧 - 100级", 
1312057, 100, 100,
//"挑战之单手钝器 - 100级", 
1322085, 100, 100,
//"挑战之短刀 - 100级", 
1332115, 100, 300,
//"挑战之双手剑 - 100级", 
1402075, 100, 100,
//"挑战之双手斧 - 100级", 
1412057, 100,  100,
//"挑战之双手钝器 - 100级", 
1422058, 100, 100,
//"挑战之枪 - 100级", 
1432076, 100, 100,
//"挑战之矛 - 100级", 
1442105, 100, 100,
//"挑战之金属短杖 - 100级", 
1372072, 100, 200,
//"挑战之金属长杖 - 100级", 
1382094, 100, 200,
//"挑战之弓 - 100级", 
1452101, 100, 300,
//"挑战之弩 - 100级", 
1462086, 100, 300,
//"挑战之拳套 - 100级", 
1472112, 100, 400,
//"挑战之指节 – 100级", 
1482074, 100, 500,
//"挑战之短枪 – 100级", 
1492074, 100, 500);



var jobDir;
var status;
var newJob;
var newJobName;
var Sp;
var a=1;
var first;
var sd;
var status = 0;
var job;


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        im.dispose();
    } else {
        if (mode == 0) {
            im.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        } else {
            status--;
        }
        if (status == 0) {


           lvs = im.getPlayer().getLevel();
           vipname = im.getVipname();
           jobs = im.getJob();
           lvl = 0;
           names = im.getVipname();
           advance += "#r ┈┈┈━═☆#i" + itemid + "##r   #t" + itemid + "#   #i" + itemid + "# #r☆═━┈┈┈ \r\n";
           noThanks += "\r\n#L1#查看  #i" + itemid + ":##t" + itemid + "#  使用说明#l";
           advance += "#d" + im.getVipname() + "  #k请选择您需要领取的装备：\r\n#r注意：已经拥有的下列物品不可以重复领取！";

            text0 += "#r ┈┈┈━═☆#i" + itemid + "##r   #t" + itemid + "#   #i" + itemid + "# #r☆═━┈┈┈ \r\n#rMaplewing 为了培养出更多强大的冒险家们！ \r\n#b所有玩家都可以在 #i" + itemid + ":##r #t" + itemid + "#   #b领取到相应等级需要的武器!  ";

           if (jobs == 0) {
              newjob = 0;
           } else if ((jobs > 0) && (jobs <= 150)) {
              newjob = 100;
           } else if ((jobs >= 200) && (jobs <= 250)) {
              newjob = 200;
           } else if ((jobs >= 300) && (jobs <= 350)) {
              newjob = 300;
           } else if ((jobs >= 400) && (jobs <= 450)) {
              newjob = 400;
           } else if ((jobs >= 500) && (jobs <= 550)) {
              newjob = 500;
           } else {
              newjob = 0;
           }

             if (lvs >= 100) {
                 lvl = 100;
             } else if ((lvs >= 70) && (lvs < 100)) {
                 lvl = 70;
             } else if ((lvs >= 25) && (lvs < 70)) {
                 lvl = 25;
             } else if ((lvs >= 10) && (lvs < 25)) {
                 lvl = 10;
             }


                    for (var i = 0; i <= zbData.length; i++)
                    if (i % 3 == 0 && (zbData[i + 2] == newjob) && (zbData[i + 1] == lvl)) {
                        advance += "\r\n#b#L" + zbData[i] + "##i" + zbData[i] + ":##t" + zbData[i] + "##l";
                    }
                


            advance += noThanks;
            im.sendSimple(advance);



        } else if (status == 1) {

           if (selection == 1) {
              im.sendOk(text0);
              }
          
           items = selection;

              if (im.getPlayer().haveItem(items) >= 1) {
                 im.sendOk("#r" + names + "  #k您已经拥有：\r\n#i" + items + ":##t" + items + "#.\r\n\r\n#r无法重复获得此物品！");
                 im.dispose();

             } else {
              if (im.getSpace(1) >= 1) {

           im.gainItem(items, 1);//给予装备 代码为 items
           im.sendOk("#r" + names + "  #k我已经把：\r\n#i" + items + ":##t" + items + "#.\r\n\r\n#r发送到了您的背包！请注意查看！");
                if (im.getChar().getAccountID() > 1) {
                   im.gainItem(itemid, -1);
                  }

           im.dispose();

               } else {

           im.sendOk("#r" + names + "  #k您的  #b装备栏 空间 不足 #e#r1#n#k 个！：\r\n#i" + items + ":##t" + items + "#.\r\n\r\n#r无法发送到 您的背包！请清理！");
           im.dispose();
             }

           }



        }
    }
}

















/*
            switch (selection) {
            case 0:
                im.gainItem(1662001,1);
                im.gainItem(1672008,1);
                im.gainItem(2430466,-1);
                im.dispose(); 
                break;
            case 1:
                im.dispose(); 
                break;
            case 2:
                im.warp(102000000, 0);
                break;
            case 3:
                im.warp(103000000, 0);
                break;
            }

            im.dispose();
*/

