/* 传送幸运箱  转职送装备 */

var status;

var itemid = 2430471;

var jobs;
var items;
var nums;
var lvs;
var vipname;
var text0 = " ";//物品使用说明
var newjob;
var lvl;
var names;

var cishu = 10;

var noThanks = "#d\r\n";

var noAdvance = "#k您现在的等级还不需要 #d转职向导服务 #k如果您是 #b冒险家#k 或者 #b骑士团 #k和 #b反抗者 #k达到 #e#r ";

var advance = " ";//第一主对话

//冒险家职业装备
var zbData = Array(
//"剑", 
0, 1302000, 0, 0,
//"小斧", 
10, 1312004, 0, 0,
//"挑战之单手剑 - 10级", 
10001, 1302135, 10, 100,
//"挑战之单手斧 - 10级", 
10002, 1312049, 10, 100,
//"挑战之单手钝器 - 10级", 
10003, 1322077, 10, 100,
//"挑战之短刀 - 10级", 
40004, 1332104, 10, 400,
//"挑战之金属短杖 - 10级", 
20005, 1372063, 10, 200,
//"挑战之金属长杖 - 10级", 
20006, 1382085, 10, 200,
//"挑战之双手剑 - 10级", 
10007, 1402078, 10, 100,
//"挑战之双手斧 - 10级", 
10008, 1412048, 10, 100,
//"挑战之双手钝器 - 10级", 
10009, 1422050, 10, 100,
//"挑战之枪 - 10级", 
10010, 1432068, 10, 100,
//"挑战之矛 - 10级", 
10011, 1442096, 10, 100,
//"挑战之弓 - 10级", 
30012, 1452093, 10, 300,
//"挑战之弩 - 10级", 
30013, 1462078, 10, 300,
//"挑战之拳套 - 10级", 
40014, 1472104, 10, 400,
//"挑战之指节 – 10级", 
50015, 1482066, 10, 500,
//"挑战之短枪 – 10级", 
50016, 1492066, 10, 500,
//"挑战之单手剑 - 25级", 
10017, 1302138, 25, 100,
//"挑战之单手斧 - 25级", 
10018, 1312052, 25, 100,
//"挑战之单手钝器 - 25级", 
10019, 1322080, 25, 100,
//"挑战之短刀 - 25级", 
30020, 1332107, 25, 300,
//"挑战之金属短杖 - 25级", 
20021, 1372066, 25, 200,
//"挑战之金属长杖 - 25级", 
20022, 1382088, 25, 200,//0001
//"挑战之双手剑 - 25级", 
10023, 1402081, 25, 100,
//"挑战之双手斧 - 25级", 
10024, 1422053, 25, 100,
//"挑战之双手钝器 - 25级", 
10025, 1422053, 25, 100,
//"挑战之枪 - 25级", 
10026, 1432071, 25, 100, 100,
//"挑战之矛 - 25级", 
10027, 1442099, 25, 100, 100,
//"挑战之弓 - 25级", 
30028, 1452096, 25, 300, 300,
//"挑战之弩 - 25级", 
30029, 1462081, 25, 300, 300,
//"挑战之拳套 - 25级", 
40030, 1472107, 25, 400,
//"挑战之指节 – 25级", 
50031, 1482069, 25, 500,
//"挑战之短枪 – 25级", 
50032, 1492069, 25, 500,
//"挑战之金属短杖 - 100级", 
20053, 1372072, 100, 200,
//"挑战之金属长杖 - 100级", 
20054, 1382094, 100, 200,

//"挑战之单手剑  - 70级
11035, 1302141, 70, 100,
//"挑战之单手斧 - 70级
11036, 1312055, 70, 100,

//"挑战之单手钝器 - 70级", 
10035, 1322083, 70, 100,
//"挑战之短刀 - 70级", 
30036, 1332110, 70, 300,
//"挑战之金属短杖 - 70级", 
20037, 1372069, 70, 200,
//"挑战之金属长杖 - 70级", 
20038, 1382091, 70, 200,
//"挑战之双手剑 - 70级", 
10039, 1402084, 70, 100,
//"挑战之双手斧 - 70级", 
10040, 1412054, 70, 100,
//"挑战之双手钝器 - 70级", 
10041, 1422056, 70, 100,
//"挑战之枪 - 70级", 
10042, 1432074, 70, 100,
//"挑战之矛 - 70级", 
10043, 1442102, 70, 100,
//"挑战之弓 - 70级", 
30044, 1452099, 70, 300,
//"挑战之弩 - 70级", 
30045, 1462084, 70, 300,
//"挑战之拳套 - 70级", 
40046, 1472110, 70, 400,
//"挑战之指节 – 70级", 
50047, 1482072, 70, 500,
//"挑战之短枪 – 70级", 
50048, 1492072, 70, 500,
//"挑战之单手剑 - 100级", 
10049, 1302078, 100, 100,
//"挑战之单手斧 - 100级", 
10050, 1312057, 100, 100,
//"挑战之单手钝器 - 100级", 
10051, 1322085, 100, 100,
//"挑战之短刀 - 100级", 
30052, 1332115, 100, 300,
//"挑战之双手剑 - 100级", 
10055, 1402075, 100, 100,
//"挑战之双手斧 - 100级", 
10056, 1412057, 100,  100,
//"挑战之双手钝器 - 100级", 
10057, 1422058, 100, 100,
//"挑战之枪 - 100级", 
10058, 1432076, 100, 100,
//"挑战之矛 - 100级", 
10059, 1442105, 100, 100,
//"挑战之弓 - 100级", 
30060, 1452101, 100, 300,
//"挑战之弩 - 100级", 
30061, 1462086, 100, 300,
//"挑战之拳套 - 100级", 
40062, 1472112, 100, 400,
//"挑战之指节 – 100级", 
50063, 1482074, 100, 500,
//"挑战之短枪 – 100级", 
50064, 1492074, 100, 500);


var check = "你确定你想成为一个 ";
var congrats = "你想成为一个 ";
var jobDir;
var status;
var newJob;
var newJobName;
var Sp;
var a=1;
var first;
var sd;
var status = 0;
var job;

var lcishu;


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        im.dispose();
    } else {
        if (mode == 0) {
            im.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        } else {
            status--;
        }
        if (status == 0) {


           lvs = im.getPlayer().getLevel();
           vipname = im.getVipname();
           jobs = im.getJob();
           lvl = 0;
           names = im.getVipname();
           lcishu = im.getBossLog("传说礼物箱")

           advance += "#r ┈┈┈━═☆#i" + itemid + "##r   #t" + itemid + "#   #i" + itemid + "# #r☆═━┈┈┈ \r\n";
           noThanks += "\r\n#L1#查看  #i" + itemid + ":##t" + itemid + "#  使用说明#l";
           advance += "#d" + im.getVipname() + "  #k请选择您需要领取的装备：\r\n#r注意：已经拥有的下列物品不可以重复领取！\r\n每日只能领取#r#e" + cishu + "#n次！今日你已经领取了#r#e" + lcishu + "#n次！";

            text0 += "#r ┈┈┈━═☆#i" + itemid + "##r   #t" + itemid + "#   #i" + itemid + "# #r☆═━┈┈┈ \r\n#rMaplewing 为了培养出更多强大的冒险家们！ \r\n#b所有玩家都可以在 #i" + itemid + ":##r #t" + itemid + "#   #b领取到相应等级需要的武器!  ";

           if (jobs == 0) {
              newjob = 0;
           } else if ((jobs > 0) && (jobs <= 150)) {
              newjob = 100;
           } else if ((jobs >= 200) && (jobs <= 250)) {
              newjob = 200;
           } else if ((jobs >= 300) && (jobs <= 350)) {
              newjob = 300;
           } else if ((jobs >= 400) && (jobs <= 450)) {
              newjob = 400;
           } else if ((jobs >= 500) && (jobs <= 550)) {
              newjob = 500;
           } else {
              newjob = 0;
           }

             if (lvs >= 100) {
                 lvl = 100;
             } else if ((lvs >= 70) && (lvs < 100)) {
                 lvl = 70;
             } else if ((lvs >= 25) && (lvs < 70)) {
                 lvl = 25;
             } else if ((lvs >= 10) && (lvs < 25)) {
                 lvl = 10;
             }


                    for (var i = 0; i <= zbData.length; i++)
                    if (i % 4 == 0 && (zbData[i + 3] == newjob) && (zbData[i + 2] == lvl)) {
                        advance += "\r\n#b#L" + zbData[i + 1] + "##i" + zbData[i + 1] + ":##t" + zbData[i + 1] + "##l";
                     //   items = zbData[i + 1];
                    }
                


            advance += noThanks;
            im.sendSimple(advance);



        } else if (status == 1) {

           if (selection == 1) {
              im.sendOk(text0);
              }
          
           items = selection;

              if (im.getPlayer().haveItem(items) >= 1) {
                 im.sendOk("#r" + names + "  #k您已经拥有：\r\n#i" + items + ":##t" + items + "#.\r\n\r\n#r无法重复获得此物品！");
                 im.dispose();

             } else {
              if (im.getSpace(1) >= 1) {

            if (im.getBossLog("传说礼物箱") < cishu) {
           im.gainItem(items, 1);//给予装备 代码为 items
                    im.setBossLog("传说礼物箱");

           im.sendOk("#r" + names + "  #k我已经把：\r\n#i" + items + ":##t" + items + "#.\r\n\r\n#r发送到了您的背包！请注意查看！");

           } else {
           im.sendOk("#r" + names + "  #k今日您已经领取了 #e#r" + cishu + "#n 次了！无法继续领取！");

           }


                if (im.getChar().getAccountID() > 1) {
                   im.gainItem(itemid, -1);
                  }

           im.dispose();

               } else {

           im.sendOk("#r" + names + "  #k您的  #b装备栏 空间 不足 #e#r1#n#k 个！：\r\n#i" + items + ":##t" + items + "#.\r\n\r\n#r无法发送到 您的背包！请清理！");
           im.dispose();
             }

           }



        }
    }
}

















/*
            switch (selection) {
            case 0:
                im.gainItem(1662001,1);
                im.gainItem(1672008,1);
                im.gainItem(2430466,-1);
                im.dispose(); 
                break;
            case 1:
                im.dispose(); 
                break;
            case 2:
                im.warp(102000000, 0);
                break;
            case 3:
                im.warp(103000000, 0);
                break;
            }

            im.dispose();
*/

