
var status = 0;  	
var itemS =  	
Array(
			
			Array(1042177,60000,"6W点卷"), //海盗头巾(绿)
			Array(1042176,60000,"6W点卷"), //海盗头巾(红)
			Array(1042174,60000,"6W点卷"), //海盗头巾(粉)
			Array(1042173,60000,"6W点卷"), //海盗头巾(灰)
			Array(1042172,60000,"6W点卷"), //海盗头巾(紫)
			
			Array(1042170,60000,"6W点卷"), //废报纸头盔
			Array(1042169,60000,"6W点卷"), //枫叶帽

			Array(1042169,60000,"6W点卷"), //月饼帽
			Array(1042168,60000,"6W点卷"), //地球帽
			Array(1042167,60000,"6W点卷"), //枫叶面具
			Array(1042166,60000,"6W点卷"), //金龙头盔
			Array(1042165,60000,"6W点卷"), //永恒冠军盔
			Array(1042164,60000,"6W点卷"), //永恒玄妙帽
			Array(1042163,60000,"6W点卷"), //永恒霓翎帽
			Array(1042162,60000,"6W点卷"), //永恒迷踪帽
			Array(1042161,60000,"6W点卷"), //永恒海王星
			Array(1042160,60000,"6W点卷"), //重生冠军盔
			Array(1042159,60000,"6W点卷"), //重生玄妙帽
			Array(1042158,60000,"6W点卷"), //重生霓翎帽
			Array(1042157,60000,"6W点卷"), //重生迷踪帽
			Array(1042156,60000,"6W点卷"), //重生海王星
			//------披风------
		
			
			Array(1042155,60000,"6W点卷"), //永恒定边手套
			Array(1042153,60000,"6W点卷"), //永恒逍遥手套
			Array(1042152,60000,"6W点卷"), //永恒白云手套
			Array(1042151,60000,"6W点卷"), //永恒探云手套
			Array(1042150,60000,"6W点卷"), //永恒抚浪手套
			Array(1042154,60000,"6W点卷"), //重生定边手套
			Array(1042149,60000,"6W点卷"), //重生逍遥手套
			Array(1042147,60000,"6W点卷"), //重生白云手套
			Array(1042146,60000,"6W点卷"), //重生探云手套
			Array(1042145,60000,"6W点卷"), //重生抚浪手套
			
		
			Array(1042143,60000,"6W点卷"), //烈焰之剑
			Array(1042142,60000,"6W点卷"), //枫叶旗
			Array(1042141,60000,"6W点卷"), //枫叶旗
		


			Array(1042140,60000,"6W点卷"), //燃烧的火焰刀
			Array(1042138,60000,"6W点卷"), //枫叶突击剑
			Array(1042127,60000,"6W点卷"), //枫叶3年旗
			Array(1042128,60000,"6W点卷"), //枫叶庆典旗


			Array(1042129,60000,"6W点卷"), //七彩霓虹灯泡
			Array(1042134,60000,"6W点卷"), //永恒破甲剑
		
			Array(1042133,60000,"6W点卷"), //叉子
			Array(1042132,60000,"6W点卷"), //重生破甲剑
			Array(1042131,60000,"6W点卷"), //火炬
			Array(1042130,60000,"6W点卷"), //鱿鱼剑
			Array(1042126,60000,"6W点卷"), //圣诞六翼天使武器(单手剑)
		
		
			Array(1042125,60000,"6W点卷"), //永恒断蚺斧
			Array(1042119,60000,"6W点卷"), //重生断蚺斧
			Array(1042118,60000,"6W点卷"), //圣诞六翼天使武器(单手斧)
			
			Array(1042122,60000,"6W点卷"), //米伽勒的平底锅
			
			Array(1042121,60000,"6W点卷"), //七夕
			
			
			Array(1042120,60000,"6W点卷"), //枫叶3年旗
			Array(1062118,60000,"6W点卷"), //粉色花边游泳圈
			Array(1062113,60000,"6W点卷"), //永恒惊破天
			Array(1062114,60000,"6W点卷"), //重生惊破天

			
			
			Array(1062112,60000,"6W点卷"), //永恒狂鲨锯
			Array(1062111,60000,"6W点卷"), //永恒断首刃
			Array(1062110,60000,"6W点卷"), //重生狂鲨锯
			Array(1062109,60000,"6W点卷"), //重生断首刃
		
		
			Array(1062108,60000,"6W点卷"), //领路灯
			
		
			Array(1062107,60000,"6W点卷"), //毒蘑菇
			Array(1062106,60000,"6W点卷"), //香菇
			

			Array(1062105,60000,"6W点卷"), //火灵珠长杖
			Array(1062104,60000,"6W点卷"), //毒灵珠长杖
			Array(1062103,60000,"6W点卷"), //冰灵珠长杖
			Array(1062102,60000,"6W点卷"), //雷灵珠长杖
			
			Array(1062101,60000,"6W点卷"), //永恒冰轮杖
			Array(1062100,60000,"6W点卷")
);                                              
var StringS;                                    
function start() {                              
	status = -1;                            
	action(1, 0, 0);                        
}                                               
                                                
function action(mode, type, selection) {        
	if (mode == -1) {                       
		cm.dispose();                   
	} else {                                
		if (status >= 0 && mode == 0) { 
			cm.dispose();           
			return;                 
		}                               
		if (mode == 1)                  
			status++;
		else
			status--;
		if (status == 0) {
				  cm.sendNext("5元冒险岛，点卷商场[衣服·裤子店][装备会慢慢添加，请玩家细心等待]");   
		}else if (status == 1) {
				StringS = "您好!您当前的点卷为#r " + cm.getPlayer().getCSPoints(0) + " #k选择你的物品.";
				for (var i = 0; i < itemS.length; i++){
					StringS += "\r\n#L" + i + "#" + itemS[i][2] + "#v" + itemS[i][0] + "#(需要#r" + itemS[i][1] + "#k点卷)#l"
				}
				cm.sendSimple(StringS);			 								     
		}else if (status == 2){
			if (cm.getPlayer().getCSPoints(0) >= itemS[selection][1]){
				if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(1)).isFull()){
						cm.sendOk("您至少应该让装备栏空出两格");
						cm.dospose();
				}
				//cm.getPlayer().modifyCSPoints(0,cm.getPlayer().getCSPoints(0) - itemS[selection][1]);
				cm.getChar().modifyCSPoints(0,-itemS[selection][1]);
				cm.gainItem(itemS[selection][0],1);
				cm.sendOk("购买成功！请查看背包！")
				cm.dispose();
			}else{
				cm.sendOk("穷鬼，你没有足够的点卷用来购买！");
				cm.dispose();
			}
		}
	}
}