var status = 0;

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
    if (status == 0) {
        var selStr = "欢迎使用蘑菇币系统:\r\n\r\n#L9#查看蘑菇币获得方式#l\r\n#b#L0#我要使用#v4000038#金杯(1个)兑换必成卷#l\r\n#L1#我要使用#v4031994#蘑菇金牌(1个)兑换3张祝福卷#l\r\n#L2#我要使用#v4031995#蘑菇银牌(1个)兑换2张祝福卷#l\r\n#L3#我要使用#v4031996#蘑菇铜牌(1个)兑换1张祝福卷#l\r\n#L4#我要使用#v4031997#蘑菇金币(10个)兑换1张%70卷轴#l\r\n#L5#我要使用#v4031997#蘑菇金币(15个)兑换1张%65卷轴#l\r\n#L6#我要使用#v4031997#蘑菇金币(20个)兑换1张%15卷轴#l\r\n#L7#我要使用#v4031997#蘑菇金币(20个)兑换1张%30诅咒卷轴#l\r\n#L8#我要使用#v4031997#蘑菇金币(30个)兑换1张任意卷轴#l\r\n\r\n   注:任意卷轴包含:60%混沌卷,正向混沌卷,白医卷轴—仙,   白医卷轴—神,祝福卷轴.";
        cm.sendSimple(selStr);
    } else if (status == 1) {
        switch (selection) {
            case 0:
                if(cm.haveItem(4000038,1)&&cm.getSpace(2)>3){
                    cm.gainItem(4000038,-1);
                    var itemList = new Array(2040303,//耳环智力必成卷
                        2040506,//全身盔甲敏捷必成卷
                        2040710,//鞋子跳跃必成卷
                        2040806,//手套敏捷必成卷
                        2040811,//手套攻击诅咒卷
                        2043103,//单手斧攻击必成卷
                        2043003,//单手剑攻击必成卷
                        2043203,//单手钝器攻击必成卷
                        2043303,//短剑攻击必成卷
                        2043703,//短杖攻击必成卷
                        2043803,//长杖攻击必成卷
                        2044003,//双手剑攻击必成卷
                        2044019,//双手剑魔力必成卷
                        2044103,//双手斧攻击必成卷
                        2044203,//双手钝器攻击必成卷
                        2044303,//枪攻击必成卷
                        2044403,//矛攻击必成卷
                        2044503,//弓攻击必成卷
                        2044603,//弩攻击必成卷
                        2044703,//拳套攻击必成卷
                        2044815,//指节攻击必成卷
                        2044908//短枪攻击必成卷
                        );
                    item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "蘑菇币系统");
                    cm.sendOk("你获得了 #b#t" + item + "##k.");
                    cm.dispose();
                }else{
                    cm.sendOk("你没有一个#v4000038#金杯哦。或你的消耗栏空间不足3格。");
                    cm.dispose();
                }
                break;
            case 1:
                if(cm.haveItem(4031994,1)&&cm.getSpace(2)>3){
                    cm.gainItem(4031994,-1);
                    cm.gainItem(2340000,3)
                    cm.sendOk("恭喜你成功兑换祝福卷轴3个。");
                }else{
                    cm.sendOk("你没有蘑菇金牌一个，或消耗栏空间不足3个。");
                    cm.dipose();
                }
                break;
            case 2:
                if(cm.haveItem(4031995,1)&&cm.getSpace(2)>3){
                    cm.gainItem(4031995,-1);
                    cm.gainItem(2340000,2)
                    cm.sendOk("恭喜你成功兑换祝福卷轴2个。");
                    cm.dipose();
                }else{
                    cm.sendOk("你没有蘑菇银牌一个，或消耗栏空间不足3个。");
                    cm.dipose();
                }
                break;
            case 3:
                if(cm.haveItem(4031996,1)&&cm.getSpace(2)>3){
                    cm.gainItem(4031996,-1);
                    cm.gainItem(2340000,1)
                    cm.sendOk("恭喜你成功兑换祝福卷轴1个。");
                    cm.dipose();
                }else{
                    cm.sendOk("你没有蘑菇铜牌一个，或消耗栏空间不足3个。");
                    cm.dipose();
                }
                break;
            case 4:
                if(cm.haveItem(4031997,10)&&cm.getSpace(2)>3){
                    cm.gainItem(4031997,-10);
                    var itemList = new Array(2040012,//头盔智力卷轴70
                        2040014,//头盔命中率诅咒卷轴70%
                        2040109,//脸部装饰回避率诅咒卷轴70%
                        2040209,//眼部装饰智力诅咒卷轴70%
                        2040304,//耳环智力诅咒卷轴,//成功率70%
                        2040306,//耳环敏捷卷轴,//成功率70%
                        2040406,//上衣力量卷轴,//成功率70%
                        2040410,//上衣运气诅咒卷轴70%,//成功率70%
                        2040610,//裤裙敏捷诅咒卷轴70%,//成功率70%
                        2040714,//鞋子跳跃诅咒卷轴,//成功率70%
                        2040810,//手套攻击诅咒卷轴,//成功率70%
                        2040814,//手套魔力诅咒卷轴70%,//成功率70%
                        2040906,//盾牌运气卷轴
                        2041034,//披风力量诅咒卷轴,//成功率70%
                        2041036,//披风智力诅咒卷轴,//成功率70%
                        2041038,//披风敏捷诅咒卷轴,//成功率70%
                        2041040,//披风运气诅咒卷轴,//成功率70%
                        2041205,//项链运气诅咒卷轴70%,//成功率70%
                        2043004,//单手剑攻击诅咒卷轴,//成功率70%
                        2043104,//单手斧攻击诅咒卷轴,//成功率70%
                        2043204,//单手钝器攻击诅咒卷轴,//成功率70%
                        2043304,//短剑攻击诅咒卷轴,//成功率70%
                        2043704,//短杖魔力诅咒卷轴,//成功率70%
                        2043804,//长杖魔力诅咒卷轴,//成功率70%
                        2044004,//双手剑攻击诅咒卷轴,//成功率70%
                        2044104,//双手斧攻击诅咒卷轴,//成功率70%
                        2044204,//双手钝器攻击诅咒卷轴,//成功率70%
                        2044304,//枪攻击诅咒卷轴,//成功率70%
                        2044404//矛攻击诅咒卷轴,//成功率70%
                        );
                    item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "蘑菇币系统");
                    cm.sendOk("你获得了 #b#t" + item + "##k.");
                    cm.dispose();
                }else{
                    cm.sendOk("你没有10个#v4031997#金币哦。或你的消耗栏空间不足3格。");
                    cm.dispose();
                }
                break;
            case 5:
                if(cm.haveItem(4031997,15)&&cm.getSpace(2)>3){
                    cm.gainItem(4031997,-15);
                    var itemList = new Array(2040043,//头盔敏捷卷轴65%
                        2040313,//耳环智力卷轴65%
                        2040335,//耳环装饰敏捷卷轴65%
                        2040337,//耳环装饰运气卷轴65%
                        2040431,//上衣力量卷轴65%
                        2040435,//上衣运气卷轴65%
                        2040522,//全身盔甲敏捷卷轴65%
                        2040528,//全身盔甲幸运卷轴65%
                        2040526,//全身盔甲智力卷轴65%
                        2040540,//全身盔甲力量卷轴65%
                        2040615,//裤裙防御卷轴65%
                        2040720,//鞋子跳跃卷轴65%
                        2040819,//手套敏捷卷轴65%
                        2040635,//裤裙敏捷卷轴65%
                        2040821,//手套攻击卷轴65%
                        2040941,//盾牌力量卷轴65%
                        2041052,//披风智力卷轴65%
                        2040937,//盾牌运气卷轴65%
                        2041054,//披风敏捷卷轴65%
                        2041056,//披风幸运卷轴65%
                        2043011,//单手剑攻击卷轴65%
                        2043106,//单手斧攻击卷轴65%
                        2043206,//单手钝器攻击卷轴65%
                        2043403,//刀攻击力卷轴65%
                        2043706,//短杖魔力卷轴65%
                        2043306,//短剑攻击卷轴65%
                        2043806,//长杖魔力卷轴65%
                        2044006,//双手剑攻击卷轴65%
                        2044106,//双手斧攻击卷轴65%
                        2044206,//双手钝器攻击卷轴65%
                        2044218,//单手钝器命中卷轴65%
                        2044306,//枪攻击卷轴65%
                        2044406,//矛攻击卷轴65%
                        2044506,//弓攻击卷轴65%
                        2044606,//弩攻击卷轴65%
                        2044706,//拳套攻击卷轴65%
                        2044811,//拳甲攻击卷轴65%
                        2044813,//指节命中卷轴65%
                        2044906,//短枪攻击卷轴65%
                        2045206,//双弩枪攻击力卷轴65%
                        2045308//手炮攻击力卷轴65%
                        );
                    item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "蘑菇币系统");
                    cm.sendOk("你获得了 #b#t" + item + "##k.");
                    cm.dispose();
                }else{
                    cm.sendOk("你没有15个#v4031997#金币哦。或你的消耗栏空间不足3格。");
                    cm.dispose();
                }
                break;
            case 6:
                if(cm.haveItem(4031997,20)&&cm.getSpace(2)>3){
                    cm.gainItem(4031997,-20);
                    var itemList = new Array(2043606,//手杖攻击力卷轴15%
                        2040044,//头盔敏捷卷轴15%
                        2040314,//耳环智力卷轴15%
                        2040336,//耳环装饰敏捷卷轴15%
                        2040338,//耳环装饰运气卷轴15%
                        2040432,//上衣力量卷轴15%
                        2040436,//上衣运气卷轴15%
                        2040527,//全身盔甲智力卷轴15%
                        2040523,//全身盔甲敏捷卷轴15%
                        2040541,//全身盔甲力量卷轴15%
                        2040636,//裤裙敏捷卷轴15%
                        2040529,//全身盔甲幸运卷轴15%
                        2040721,//鞋子跳跃卷轴15%
                        2040938,//盾牌运气卷轴15%
                        2040822,//手套攻击卷轴15%
                        2040820,//手套敏捷卷轴15% 
                        2041051,//披风力卷轴15%
                        2040942,//盾牌力量卷轴15%
                        2041053,//披风智力卷轴15%
                        2041055,//披风敏捷卷轴15%
                        2041057,//披风幸运卷轴15%
                        2043307,//短剑攻击卷轴15%
                        2043107,//单手斧攻击卷轴15%
                        2043404,//刀攻击力卷轴15%
                        2043207,//单手钝器攻击卷轴15%
                        2043012,//单手剑攻击卷轴15%
                        2043707,//短杖魔力卷轴15%
                        2043807,//长杖魔力卷轴15%
                        2044107,//双手斧攻击卷轴15%
                        2044007,//双手剑攻击卷轴15%
                        2044307,//枪攻击卷轴15%
                        2044207,//双手钝器攻击卷轴15%
                        2044119,//双手斧命中卷轴15%
                        2044507,//弓攻击卷轴15%
                        2044607,//弩攻击卷轴15%
                        2044707,//拳套攻击卷轴15%
                        2044812,//指节攻击卷轴15%
                        2044407,//矛攻击卷轴15%
                        2044907,//短枪攻击卷轴15% 
                        2045206,//双弩枪攻击力卷轴
                        2045306//手炮攻击力卷轴
                        );
                    item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "蘑菇币系统");
                    cm.sendOk("你获得了 #b#t" + item + "##k.");
                    cm.dispose();
                }else{
                    cm.sendOk("你没有20个#v4031997#金币哦。或你的消耗栏空间不足3格。");
                    cm.dispose();
                }
                break;
            case 7:
                if(cm.haveItem(4031997,20)&&cm.getSpace(2)>3){
                    cm.gainItem(4031997,-20);
                    var itemList = new Array(2043604,//手杖攻击力卷轴30%
                        2040108,//脸部装饰回避率诅咒卷轴30%
                        2040203,//眼部装饰命中率诅咒卷轴30%
                        2040208,//眼部装饰智力诅咒卷轴30%
                        2040411,//上衣运气诅咒卷轴30%
                        2040611,//裤裙敏捷诅咒卷轴30%
                        2040815,//手套魔力诅咒卷轴30%
                        2040922,//盾牌魔力诅咒卷轴30%
                        2040917,//盾牌攻击诅咒卷轴30%
                        2041204,//项链运气诅咒卷轴30%
                        2041209,//项链力量诅咒卷轴30% 
                        2043205,//单手钝器攻击诅咒卷轴
                        2043305,//短剑攻击诅咒卷轴
                        2043705,//短杖魔力诅咒卷轴
                        2043805,//长杖魔力诅咒卷轴
                        2044005,//双手剑攻击诅咒卷轴
                        2044105,//双手斧攻击诅咒卷轴
                        2044205,//双手钝器攻击诅咒卷轴
                        2044305,//枪攻击诅咒卷轴
                        2044405,//矛攻击诅咒卷轴
                        2044505,//弓攻击诅咒卷轴
                        2044605,//弩攻击诅咒卷轴
                        2044705,//拳套攻击诅咒卷轴
                        2044804,// 拳甲攻击卷轴
                        2044904,//短枪攻击卷轴
                        2045204,//双弩枪攻击力卷轴
                        2045304,//手炮攻击力卷轴30
                        2043604//手杖攻击力卷轴30
                        );
                    item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "蘑菇币系统");
                    cm.sendOk("你获得了 #b#t" + item + "##k.");
                    cm.dispose();
                }else{
                    cm.sendOk("你没有20个#v4031997#金币哦。或你的消耗栏空间不足3格。");
                    cm.dispose();
                }
                break;
            case 8:
                if(cm.haveItem(4031997,30)&&cm.getSpace(2)>3){
                    cm.gainItem(4031997,-30);
                    var itemList = new Array(2340000,//祝福卷轴
                        2049004,//白医卷轴—仙
                        2049005,//白医卷轴—神
                        2049122,//50%混沌卷
                        2049118//60%混沌卷
                        );
                    item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "蘑菇币系统");
                    cm.sendOk("你获得了 #b#t" + item + "##k.");
                    cm.dispose();
                }else{
                    cm.sendOk("你没有30个#v4031997#金币哦。或你的消耗栏空间不足3格。");
                    cm.dispose();
                }
                break;
                case 9:
                    cm.sendOk("(家族奖励暂时不开放)现在起，每天都会有家族成员在线奖励，只要家族长和家族成员在指定的时间，出现在指定的地图，管理员就会按照成员人数发放相同份数的奖励，以下为您介绍家族长和家族各成员的奖励内容：\r\n获得方式：\r\n1.金杯（兑换获得）=2*蘑菇金牌\r\n3*蘑菇银牌\r\n6*蘑菇铜牌\r\n2.蘑菇金牌=家族在线人数第一的家族长获得\r\n3.蘑菇银牌=家族在线人数第二的家族长获得\r\n4.蘑菇铜牌=家族在线人数第三的家族长获得\r\n5.蘑菇金币=每个家族在线的玩家数量*10，由家族长领取并发放.\r\n\r\n更多蘑菇币获得:\r\n1.积极参加各种线上活动\r\n2.邀请好友上线并加入家族\r\n3.收购交易币");
                    cm.dispose();
                    break;
        }
    }
}