status = -1;
var itemList = Array(
// ------ 卷轴 ------
Array(2340000, 600, 1, 2), //祝福卷轴
Array(2049752, 500, 2, 3), //S级潜能卷轴 30%
Array(2049750, 50, 1, 3),
Array(5064003, 500, 2, 3), //极真3星装备强化卷轴 80%
Array(2049137, 250, 5, 3),
Array(2613000, 350, 1, 3), // 星火单手武器攻击力卷轴 - 为单手武器附加提升攻击力的属性。
Array(2613001, 350, 1, 3), // 星火单手武器魔法力卷轴 - 为单手武器附加提升魔力的属性。
Array(2612010, 350, 1, 3), // 星火双手武器攻击力卷轴 - 为双手武器附加提升攻击力的属性。
Array(2049323, 600, 2, 3),//无损
// ------ 装备 ------
Array(2046913, 350, 1, 3), // 宿命正义单手武器攻击力卷轴 100% // 为单手武器增加攻击力属性。
Array(2046914, 350, 1, 3), // 宿命正义单手武器魔力卷轴 100% // 为单手武器增加魔法攻击力属性。
Array(2046173, 350, 1, 3), // 宿命正义双手武器攻击力卷轴 100% // 为双手武器增加攻击力属性。
Array(2046577, 350, 1, 3), // 宿命正义防具力量卷轴 100% // 为防具增加力量属性。
Array(2046578, 350, 1, 3), // 宿命正义防具智力卷轴 100% // 为防具增加智力属性。
Array(2046579, 350, 1, 3), // 宿命正义防具敏捷卷轴 100% // 为防具增加敏捷属性。
Array(2046580, 350, 1, 3), // 宿命正义防具运气卷轴 100% // 为防具增加运气属性。
Array(2046763, 350, 1, 3), // 宿命正义饰品力量卷轴 100% // 为饰品增加力量属性。
Array(2046764, 350, 1, 3), // 宿命正义饰品智力卷轴 100% // 为饰品增加智力属性。
Array(2046765, 350, 1, 3), // 宿命正义饰品敏捷卷轴 100% // 为饰品增加敏捷属性。
Array(2046766, 350, 1, 3), // 宿命正义饰品运气卷轴 100% // 为饰品增加运气属性。
Array(1012283, 550, 1, 3), // 烈日脸饰 // (无描述)
//钱
Array(4001713, 500, 1, 3), // 定居金10万金钱 - 为帮助反抗者角色定居而发行的纪念金币。卖给商店可以获得10万金钱。
Array(4001714, 300, 1, 3), // 定居金100万金钱 - 为帮助反抗者角色定居而发行的纪念金币。卖给商店可以获得100万金钱。
Array(4001715, 50, 1, 3), // 定居金1亿金钱 - 为帮助反抗者角色定居而发行的纪念金币。卖给商店可以获得1亿金钱。
// ------ 特殊 ------
Array(5064300, 600, 2, 2), //卷轴防护卷轴
Array(5062500, 600, 2, 2), //大师附加神奇魔方
Array(5062000, 600, 2, 2), //神奇魔方
Array(5064000, 600, 2, 2), //防爆卷轴
Array(5064100, 600, 2, 2), //保护卷轴
Array(5062002, 600, 2, 2),  //高级神奇魔方
Array(1102471, 150, 1, 3), // 赫里希安精锐战士披风 // (无描述)
Array(1102472, 150, 1, 3), // 赫里希安精锐法师披风 // (无描述)
Array(1102473, 150, 1, 3), // 赫里希安精锐弓箭手披风 // (无描述)
Array(1102474, 150, 1, 3), // 赫里希安精锐飞侠披风 // (无描述)
Array(1102475, 150, 1, 3), // 赫里希安精锐海盗披风 // (无描述)
Array(1072732, 150, 1, 3), // 赫里希安精锐战士靴 // (无描述)
Array(1072733, 150, 1, 3), // 赫里希安精锐法师靴 // (无描述)
Array(1072734, 150, 1, 3), // 赫里希安精锐弓箭手靴 // (无描述)
Array(1072735, 150, 1, 3), // 赫里希安精锐飞侠靴 // (无描述)
Array(1072736, 150, 1, 3), // 赫里希安精锐海盗靴 // (无描述)
Array(1132164, 150, 1, 3), // 赫里希安精锐战士腰带 // (无描述)
Array(1132165, 150, 1, 3), // 赫里希安精锐法师腰带 // (无描述)
Array(1132166, 150, 1, 3), // 赫里希安精锐弓箭手腰带 // (无描述)
Array(1132167, 150, 1, 3), // 赫里希安精锐飞侠腰带 // (无描述)
Array(1132168, 150, 1, 3), // 赫里希安精锐海盗腰带 // (无描述)
Array(1102476, 100, 1, 3), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 100, 1, 3), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 100, 1, 3), // 诺巴凯伦披风 // (无描述)
Array(1072737, 100, 1, 3), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 100, 1, 3), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 100, 1, 3), // 诺巴凯伦靴 // (无描述)
Array(1072740, 100, 1, 3), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 100, 1, 3), // 诺巴阿尔泰靴 // (无描述)
Array(1102479, 100, 1, 3), // 诺巴利卡昂披风 // (无描述)
Array(1102480, 100, 1, 3), // 诺巴阿尔泰披风 // (无描述)
Array(1132169, 100, 1, 3), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 100, 1, 3), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 100, 1, 3), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 100, 1, 3), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 100, 1, 3) // 诺巴阿尔泰腰带 // (无描述)
);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 610);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			
			/*
			if (im.getChar().getName() == "Super大y") {
				im.setBossLog("Super大y");
				if (im.getBossLog("Super大y") == 3) {
					itemId = 1242060;
					quantity = 1;
					notice = 3;
				}
			}*/
            item = im.gainGachaponItem(itemId, quantity, "被封印的箱子", notice);
            if (item != -1) {
				im.gainItem(2430051, -1);
				//im.gainItem(4310030, 10);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}