status = -1;
var itemList = Array(
Array(1142500, 100, 1, 3), // 神秘班·雷昂的恶梦 // (无描述)
Array(1142501, 100, 1, 3), // 神秘阿卡伊勒的恶梦 // (无描述)
Array(1142502, 100, 1, 3), // 神秘希拉的恶梦 // (无描述)
Array(1142503, 100, 1, 3), // 神秘扎昆的恶梦 // (无描述)
Array(1142504, 100, 1, 3), // 神秘暗黑龙王的恶梦 // (无描述)
Array(1142505, 100, 1, 3), // 神秘之门研究者 // (无描述)

// 图腾
Array(1202023, 600, 1, 3), // 真·乔图腾 // 聚集了乔的强烈灵魂的强力图腾。
Array(1202024, 600, 1, 3),  // 金·乔图腾 // 根据乔的样子所做的黄金图腾。
Array(1202025, 600, 1, 3),  // 银·乔图腾 // 根据乔的样子所做的银图腾。
Array(1202026, 600, 1, 3),  // 木·乔图腾 // 根据乔的样子所做的木图腾。
Array(1202027, 600, 1, 3),  // 真·海丽蜜图腾 // 聚集了海丽蜜的强烈灵魂的强力图腾。
Array(1202028, 300, 1, 3),  // 图腾。
Array(1202029, 300, 1, 3),  // 腾。
Array(1202030, 300, 1, 3),  //腾。
Array(1202031, 300, 1, 3),  // 腾。
Array(1202032, 300, 1, 3),  // 。
Array(1202033, 300, 1, 3),  // 
Array(1202034, 300, 1, 3),  // 
Array(1202035, 300, 1, 3),  // 力图腾。
Array(1202036, 300, 1, 3),  // 图腾。
Array(1202037, 300, 1, 3),  // 腾。
Array(1202038, 300, 1, 3),  // 
Array(1202039, 300, 1, 3),  // 
Array(1202040, 300, 1, 3),  // 
Array(1202041, 300, 1, 3),  // 
Array(1202042, 300, 1, 3),  // 
Array(1202083, 300, 1, 3),  // 
Array(1202084, 300, 1, 3),  //
Array(1202085, 300, 1, 3),  // 
Array(1202086, 300, 1, 3),  // 
//Array(1202098, 600, 1, 3),  // 
Array(1202099, 600, 1, 3),  // 
Array(1202100, 300, 1, 3),  // 
Array(1202101, 300, 1, 3),  // 
Array(1202102, 300, 1, 3), //
Array(1202103, 300, 1, 3),  // 
Array(1202104, 300, 1, 3),  // 黄色便当图腾 // 升级6次的图腾.
Array(1202105, 300, 1, 3),  // 橘黄色便当图腾 // 升级7次的图腾.
Array(1202106, 300, 1, 3),  // 真正的便当图腾 // 升级8次的图腾.
Array(1202107, 300, 1, 3),  // 
Array(1202108, 300, 1, 3),  // 真深蓝色便当图腾 // 升级1次的图腾.
Array(1202109, 300, 1, 3),  // 真紫色便当图腾 // 升级2次的图腾.
Array(1202110, 300, 1, 3),  // 真绿色便当图腾 // 升级3次的图腾.
Array(1202111, 300, 1, 3),  // 真红色便当图腾 // 升级4次的图腾.
Array(1202112, 300, 1, 3),  // 真蓝色便当图腾 // 升级5次的图腾.
Array(1202113, 300, 1, 3),  // 真黄色便当图腾 // 升级6次的图腾.
Array(1202114, 300, 1, 3),  // 真橘黄色便当图腾 // 升级7次的图腾.
Array(1202115, 300, 1, 3),  // 真正的便当图腾 // 升级8次的图腾.
Array(1202094, 300, 1, 3),  // 王魔女图腾 // 表现出班主任王美女真正恐怖之处的图腾
Array(1202095, 300, 1, 3),  // 王美女图腾 // 表现出班主任王美女深藏不露之美的图腾
Array(1202096, 300, 1, 3),  // 王微笑图腾 // 表现出班主任王美女多情一面的图腾
Array(3010552, 3, 1, 3), // 喵喵的免费拥抱, 3, 1, 3), // 看上去很善良的猫咪。感觉像跟人拥抱一样的猫咪椅子。每10秒HP恢复50，MP恢复50。
Array(3010553, 3, 1, 3), // 邪恶羊椅子, 3, 1, 3), // 可怕的羊。不要随便喂它。每10秒HP恢复50，MP恢复50。
Array(3010554, 3, 1, 3), // 粉色手柄, 3, 1, 3), // 梦想进入游戏排名的少女的梦想，粉红色的游戏手柄椅子。每10秒HP恢复50，MP恢复50。
Array(3010555, 3, 1, 3), // 深夜猫头鹰, 3, 1, 3), // 寂静森林中的猫头鹰，还有我。每10秒HP恢复50，MP恢复50。
Array(3010556, 3, 1, 3), // 皮肤皇后椅子, 3, 1, 3), // 不要害羞。专为在皮肤保养方面决不妥协的你准备的椅子。每10秒HP恢复50，MP恢复50。
Array(3010557, 3, 1, 3), // 睡觉小鸟椅子, 3, 1, 3), // 坐在天真的小鸟们中间，和它们一起打盹吧。每10秒HP恢复50，MP恢复50。
Array(3010558, 3, 1, 3), // 泡泡浴椅子, 3, 1, 3), // 让人感觉自己好像变干净了。每10秒HP恢复50，MP恢复50。
Array(3010559, 3, 1, 3),// 龙蛋, 3, 1, 3), // 裂开的蛋。坐在上面休息时，每10秒HP恢复50，MP恢复50。

// ------ 150级武器 ------
Array(1402196, 2, 1, 3),
Array(1432167, 2, 1, 3),
Array(1452205, 2, 1, 3),
Array(1462193, 2, 1, 3),
Array(1472214, 2, 1, 3),
Array(1332225, 2, 1, 3),
Array(1342082, 2, 1, 3),
Array(1362090, 2, 1, 3),
Array(1382208, 2, 1, 3),
Array(1372177, 2, 1, 3),
Array(1212063, 2, 1, 3),
Array(1242060, 2, 1, 3),
Array(1232057, 2, 1, 3),
Array(1522094, 2, 1, 3)
);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "祖母绿抽奖礼包", notice);
            if (item != -1) {
		im.gainItem(2430069, -1);
                im.gainItem(4310030, 10);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个，额外得到10个运动会币的奖励，可以在游戏商店中兑换#b运动会装备#k和#b必成卷轴#k。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}