status = -1;
var itemList = Array(
// ------ 卷轴 ------
	Array(4033924, 500, 1, 3), //神话耳环蓝图
	Array(2432013, 500, 1, 3),  //女神之泪
	Array(2432014, 100, 1, 3), //女神之血滴
	Array(1113077, 300, 1, 3),  //绝对之戒
	Array(5062010, 500, 1, 3),  //终极魔方
	Array(1032205, 200, 1, 3),  //神话耳环
	Array(2431354, 100, 1, 3),  //星火幸运箱子
	Array(4033356, 200, 1, 3),  //正义火种
	Array(3010879, 100, 1, 3), 
	Array(3010895, 300, 1, 3), 
	Array(3010896, 300, 1, 3), 
	Array(3010897, 300, 1, 3), 
	Array(3010898, 300, 1, 3), // 迷你神兽椅子, 300), /
	Array(3010899, 300, 1, 3), // 摆钟椅子, 300), // 
	Array(3010900, 300, 1, 3), // 宝石枫叶椅子, 300), 
	Array(3010901, 300, 1, 3), // 热情的红色药水椅子, 300), /
	Array(3010902, 300, 1, 3), // 新鲜的蓝色药水椅子, 300), 
	Array(3010903, 300, 1, 3), // 兔子椅子, 300), // 
	Array(3010904, 300, 1, 3), // 椰子树沙滩椅, 300), 
	Array(3010905, 300, 1, 3), // 柿子树鞦韆, 300), 
	Array(3010906, 300, 1, 3), // 云朵洗手间椅子, 300), // 
	Array(3010907, 300, 1, 3), // 公沙沙兔靠垫, 300), // 
	Array(3010908, 300, 1, 3), // 海蓝天鹅绒沙发, 300), // 
	Array(3010909, 300, 1, 3), // 红色设计师椅子, 300), // 
	Array(3010910, 300, 1, 3), // 艾莉珍椅子, 300), // 
	Array(3010911, 300, 1, 3), // 红帽月妙抱枕椅, 300), 
	Array(3010912, 300, 1, 3), // 蓝帽月妙抱枕椅, 300), 
	Array(3010913, 300, 1, 3), // 扇子月妙抱枕椅, 300), 
	Array(3010914, 300, 1, 3), // 太平萧月妙抱枕椅, 300),
	Array(3010915, 300, 1, 3), // 恶灵附身的娃娃椅子, 300), 
	Array(3010916, 300, 1, 3), // 粉红沙滩遮阳伞, 300), 
	Array(3010917, 300, 1, 3), // 红色龙椅, 300), // 
	Array(3010918, 300, 1, 3), // 蓝色龙椅, 300), //。
	Array(3010919, 300, 1, 3), // 精灵王座, 300), // 
	Array(3010920, 300, 1, 3), // 水晶月亮, 300), // 
	Array(3010921, 300, 1, 3), // 彩蛋篮子, 300), // 
	Array(3010922, 300, 1, 3), // 悠长假期(红色), 300),
	Array(3010923, 300, 1, 3), // 10周年椅子, 300), // 
	Array(3010936, 100, 1, 3), // 青蛙跳楼机, 300), // 
	Array(3010894, 200, 1, 3), // 一杯咖啡的悠闲, 300), 
	Array(3010747, 300, 1, 3), // 和风纸鸢椅子, 300), 
	Array(3010748, 300, 1, 3), // 日式拉面椅, 300), //
	Array(3010750, 300, 1, 3), // 焦糖布丁椅子, 300), // 
	Array(3010795, 100, 1, 3), // 森林中休息处(椅子), 300), // 
	Array(3010794, 200, 1, 3), // 抖动的舌头椅子, 300), // 
	Array(3010799, 300, 1, 3), // 坟墓幽灵椅子, 300), // 
	Array(3010714, 300, 1, 3), // 堆王冠, 300), // 
	Array(3010732, 200, 1, 3), // 翅膀自行车椅子, 300), 
	Array(3012019, 300, 1, 3) // 爱琴海椅子, 300), // 
);

var itemList2 = Array(
	Array(3010813, 300, 1, 3), // 爱情水晶球的回忆, 300), 
	Array(3012020, 100, 1, 3), // 紫藤花吊篮椅, 300), // 
	Array(3010820, 100, 1, 3), // 迷你玩具别墅椅子, 300), 
	Array(3010806, 300, 1, 3), // 桃樱芳菲椅, 300), // 
	Array(3010780, 300, 1, 3), // 旋转木马, 300), // 
	Array(3010779, 300, 1, 3), // 金马祥云轿, 300), 
	Array(3010781, 200, 1, 3), // 马上有你, 300), 
	Array(3010788, 100, 1, 3), // 巨无霸年夜饭, 300), 
	Array(3010783, 100, 1, 3), // 蓝色邦尼屋, 300), 
	Array(3010797, 300, 1, 3), // 新娘春节椅子, 300), 
	Array(3010798, 300, 1, 3), // 焰火椅子, 300), // 
	Array(3010800, 300, 1, 3), // 小学生月妙拜年椅子, 300), 
	Array(3010801, 300, 1, 3), // 学龄前月妙拜年椅子, 300), 
	Array(3010802, 300, 1, 3), // 中学生月妙拜年椅子, 300), 
	Array(3010803, 300, 1, 3), // 高3月妙拜年椅子, 300), 
	Array(3010804, 300, 1, 3), // 军人月妙拜年椅子, 300), 
	Array(3010810, 300, 1, 3), // 火车旅行椅, 300), // 
	Array(3010811, 300, 1, 3), // 嫩芽椅, 300), // 
	Array(3010812, 300, 1, 3), // 旋转木马椅, 300), // 
	Array(3010814, 300, 1, 3), // 粉丝抱枕椅子, 300), // 
	Array(3010815, 300, 1, 3), // 单身部队海报椅, 300), // 
	Array(3010835, 300, 1, 3), // 爱情水晶球记忆椅, 300), // 
	Array(3010844, 300, 1, 3), // 麻辣教室椅子, 300), // 
	Array(3010851, 300, 1, 3), // 夏日沁饮椅子, 300), // 
	Array(3010852, 300, 1, 3), // 鲜花椅, 300), // 
	Array(3010854, 300, 1, 3), // 神秘怪物共聚一堂！, 300),
	Array(3010789, 300, 1, 3), // 爆竹声声, 300), // 
	Array(3010606, 300, 1, 3), // 未上色的名画椅子, 300), //
	Array(3010608, 300, 1, 3), // 完美的名画椅子, 300), // 
	Array(1072337, 100, 1, 3), // 喜洋洋拖鞋, 100), // (无描述)
	Array(1112254, 100, 1, 3), // 豪华珍珠聊天戒指, 100), 
	Array(1112143, 100, 1, 3), // 豪华珍珠名片戒指, 100), 
	Array(1112118, 100, 1, 3), // 可乐名片戒指, 100), // 
	Array(1112119, 100, 1, 3), // 可乐(Red) 名片戒指, 100), 
	Array(1112120, 100, 1, 3), // 可乐(White) 名片戒指, 100), 
	Array(1112228, 100, 1, 3), // 可乐聊天戒指, 100), // 
	Array(1112229, 100, 1, 3), // 可乐(Red)聊天戒指, 100), 
	Array(1112230, 100, 1, 3), // 可乐(White)聊天戒指, 100), 
	Array(1002524, 100, 1, 3), // 可乐帽, 100), // (无描述)
	Array(1702533, 100, 1, 3), // 奶兔立拍得, 100), //
	Array(1702020, 100, 1, 3), // 棒棒糖, 100), // 
	Array(1702459, 100, 1, 3), // 棉花糖武器, 100),
	Array(1702302, 100, 1, 3), // 杯具, 100), // 
	Array(1042285, 100, 1, 3), // 拼色点点T恤, 100), // (无描述)
	Array(1042204, 100, 1, 3), // 汉堡T恤, 100), // (无描述)
	Array(1112103, 100, 1, 3), // 嫩黄名片戒指, 100), // 
	Array(1112253, 100, 1, 3), // 木乃伊对话框戒指, 100), //
	Array(1112142, 100, 1, 3), // 木乃伊名片戒指, 100), 
	Array(1112135, 100, 1, 3), // 水墨花名片戒指, 100), 
	Array(1112238, 100, 1, 3), // 水墨花聊天戒指, 100),
	Array(1003588, 100, 1, 3), // 玩具粉熊帽子, 100), // 
	//130装备
	Array(1232040, 290, 1, 3), // 豪华阿加雷斯猩红黄道剑
	Array(1302228, 290, 1, 3), // 豪华阿加雷斯拳刃
	Array(1312117, 290, 1, 3), // 豪华阿加雷斯头盔(名字显示有问题）
	Array(1322163, 290, 1, 3), // 豪华阿加雷斯锤
	Array(1402152, 290, 1, 3), // 豪华阿加雷斯双手剑
	Array(1412105, 290, 1, 3), // 豪华阿加雷斯拳套（名字显示有问题)
	Array(1422108, 290, 1, 3), // 豪华阿加雷斯大槌
	Array(1432139, 290, 1, 3) // 豪华阿加雷斯之矛
);

var itemList3 = Array(
	Array(1442183, 290, 1, 3), // 豪华阿加雷斯之矛
	Array(1332194, 290, 1, 3), // 豪华赫尔巴斯猎手
	Array(1362068, 290, 1, 3), // 豪华赫尔巴斯手杖         
	Array(1472180, 290, 1, 3), // 豪华赫尔巴斯手套
	Array(1212043, 290, 1, 3), // 豪华艾里格斯双头杖
	Array(1372140, 290, 1, 3), // 豪华艾里格斯短杖
	Array(1382169, 290, 1, 3), // 豪华艾里格斯笞鞭
	Array(1252030, 290, 1, 3), // 豪华艾里格斯猫梳魔法棒
	Array(1452171, 290, 1, 3), // 豪华伊布斯长弓
	Array(1462160, 290, 1, 3), // 豪华伊布斯弩
	Array(1522072, 290, 1, 3), // 豪华伊布斯双弩枪
	Array(1222043, 290, 1, 3), // 豪华维帕尔血月
	Array(1242046, 290, 1, 3), // 豪华维帕尔狮蝎剑
	Array(1482141, 290, 1, 3), // 豪华维帕尔指节手套
	Array(1492153, 290, 1, 3), // 豪华维帕尔之鹰
	Array(1532075, 290, 1, 3), // 豪华维帕尔火炮
	Array(1003589, 290, 1, 3), // 豪华阿加雷斯头箍
	Array(1003592, 290, 1, 3), // 豪华赫尔巴斯头箍
	Array(1003590, 290, 1, 3), // 豪华艾里格斯头箍
	Array(1003591, 290, 1, 3), // 豪华伊布斯头箍
	Array(1003593, 290, 1, 3), // 豪华维帕尔头箍
	Array(1052498, 290, 1, 3), // 豪华阿加雷斯锁子甲
	Array(1052501, 290, 1, 3), // 豪华赫尔巴斯锁子甲
	Array(1052499, 290, 1, 3), // 豪华艾里格斯锁子甲
	Array(1052500, 290, 1, 3), // 豪华伊布斯锁子甲
	Array(1052502, 290, 1, 3), // 豪华维帕尔锁子甲
	Array(1102445, 290, 1, 3), // 豪华阿加雷斯披风
	Array(1102448, 290, 1, 3), // 豪华赫尔巴斯披风
	Array(1102446, 290, 1, 3), // 豪华艾里格斯披风
	Array(1102447, 290, 1, 3), // 豪华伊布斯披风
	Array(1102449, 290, 1, 3), // 豪华维帕尔披风
	Array(1082466, 290, 1, 3), // 豪华阿加雷斯手套
	Array(1082469, 290, 1, 3), // 豪华赫尔巴斯手套
	Array(1082467, 290, 1, 3), // 豪华艾里格斯手套
	Array(1082468, 290, 1, 3), // 豪华伊布斯手套
	Array(1082470, 290, 1, 3), // 豪华维帕尔手套
	Array(1072703, 290, 1, 3), // 豪华阿加雷斯靴
	Array(1072706, 290, 1, 3), // 豪华赫尔巴斯靴
	Array(1072704, 290, 1, 3), // 豪华艾里格斯靴
	Array(1072705, 290, 1, 3), // 豪华伊布斯靴
	Array(1072707, 290, 1, 3) // 豪华维帕尔靴
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        for (var i = 0; i < itemList2.length; i++) {
            if (itemList2[i][1] >= chance) {
                finalitem.push(itemList2[i]);
            }
        }
        for (var i = 0; i < itemList3.length; i++) {
            if (itemList3[i][1] >= chance) {
                finalitem.push(itemList3[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "冒险岛8周年箱子", notice);
            if (item != -1) {
		im.gainItem(2430289, -1);
               // im.warp(910000000, 0);
                im.sendOk("恭喜你获得了 #b#t" + item + "##k ");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}