status = -1;
var itemList = Array(
Array(5062000, 700, 1, 3), //同一红伞下
Array(5062002, 700, 1, 3), //浴桶
Array(5064000, 700, 1, 3), //爱心椅子
Array(5062500, 700, 1, 3), //爱心椅子
Array(5062010, 700, 1, 3), //魔女的飞扫把
Array(2340000, 700, 1, 3), //红龙椅
Array(2049323, 350, 1, 3), //无损
Array(2049325, 700, 1, 3), //圣诞树椅子
Array(2049136, 500, 1, 3), //公主凳
Array(2049765, 500, 1, 3), 

Array(2030000, 500, 1, 3), 
Array(2030001, 500, 1, 3), 
Array(2030002, 500, 1, 3), 
Array(2030003, 500, 1, 3), 
Array(2030004, 500, 1, 3), 
Array(2030005, 500, 1, 3), 
Array(2030006, 500, 1, 3), 
Array(2030007, 500, 1, 3), 
//---
Array(1202112, 300, 1, 3),  // 真蓝色便当图腾 // 升级5次的图腾.
Array(1202113, 300, 1, 3),  // 真黄色便当图腾 // 升级6次的图腾.
Array(1202114, 300, 1, 3),  // 
Array(3010555, 300, 1, 3), // 深夜猫头鹰, 3, 1, 3), // 寂静森林中的猫头鹰，还有我。每10秒HP恢复50，MP恢复50。
Array(3010556, 300, 1, 3), // 皮肤皇后椅子, 3, 1, 3), // 不要害羞。专为在皮肤保养方面决不妥协的你准备的椅子。每10秒HP恢复50，MP恢复50。
Array(3010557, 300, 1, 3), // 睡觉小鸟椅子, 3, 1, 3), // 坐在天真的小鸟们中间，和它们一起打盹吧。每10秒HP恢复50，MP恢复50。
Array(3010558, 300, 1, 3), // 泡泡浴椅子, 3, 1, 3), // 让人感觉自己好像变干净了。每10秒HP恢复50，MP恢复50。
Array(3010559, 300, 1, 3),// 龙蛋, 3, 1, 3), // 裂开的蛋。坐在上面休息时，每10秒HP恢复50，MP恢复50。
Array(1142500, 100, 1, 3), // 神秘班·雷昂的恶梦 // (无描述)
Array(1142501, 100, 1, 3), // 神秘阿卡伊勒的恶梦 // (无描述)
Array(1142502, 100, 1, 3), // 神秘希拉的恶梦 // (无描述)
Array(1142503, 100, 1, 3), // 神秘扎昆的恶梦 // (无描述)
Array(1142504, 100, 1, 3), // 神秘暗黑龙王的恶梦 // (无描述)
Array(1142505, 100, 1, 3), // 神秘之门研究者 // (无描述)
Array(4033356, 500, 1, 3),
Array(4310036, 500, 100, 3),
Array(4031311, 500, 2, 3),
Array(4310020, 500, 40, 3),
Array(2590007, 500, 1, 3),
//----灵魂结晶
Array(2591085, 300, 1, 3),
Array(2591086, 300, 1, 3),
Array(2591087, 300, 1, 3),
Array(2591088, 300, 1, 3),
Array(2591163, 300, 1, 3),
Array(2591202, 300, 1, 3),
Array(2591233, 300, 1, 3),
Array(2591264, 300, 1, 3),
Array(2591296, 300, 1, 3),

Array(2591305, 300, 1, 3),
Array(2591314, 300, 1, 3),
Array(2591323, 300, 1, 3),
Array(2591332, 300, 1, 3),
Array(2591341, 300, 1, 3),
Array(2591391, 300, 1, 3),
Array(2591400, 300, 1, 3),
Array(2591409, 300, 1, 3),
Array(2591418, 300, 1, 3),
Array(2591427, 300, 1, 3),
Array(2591486, 300, 1, 3),
//wute
Array(1212101, 300, 1, 3),
Array(1222095, 300, 1, 3),
Array(1232095, 300, 1, 3),
Array(1402236, 300, 1, 3),
Array(1242102, 300, 1, 3),
Array(1262011, 300, 1, 3),
Array(1302315, 300, 1, 3),
Array(1312185, 300, 1, 3),
Array(1322236, 300, 1, 3),
Array(1332260, 300, 1, 3),
Array(1342100, 500, 1, 3),
Array(1362121, 500, 1, 3),
Array(1372207, 500, 1, 3),
Array(1382245, 500, 1, 3),
Array(1412164, 500, 1, 3),
Array(1422171, 500, 1, 3),
Array(1432200, 500, 1, 3),
Array(1442254, 500, 1, 3),

Array(1452238, 300, 1, 3),
Array(1462225, 300, 1, 3),
Array(1472247, 300, 1, 3),
Array(1482202, 300, 1, 3),
Array(1492212, 300, 1, 3),
Array(1522124, 300, 1, 3),
Array(1532130, 300, 1, 3),

Array(1252086, 300, 1, 3),
Array(1542101, 300, 1, 3),
Array(1552102, 300, 1, 3),
// ------ wuai ------
Array(1032221, 300, 1, 3), //
//Array(1032222, 300, 1, 3), // 
Array(1132244, 300, 1, 3), //
//Array(1132245, 300, 1, 3),
Array(1122265, 300, 1, 3),
//Array(1122266, 300, 1, 3),
//---低级贝勒
Array(1113072, 500, 1, 3),
Array(1032220, 500, 1, 3),
Array(1122264, 500, 1, 3),
Array(1132243, 500, 1, 3),
Array(1113072, 500, 1, 3),
Array(1032220, 500, 1, 3),
Array(1122264, 500, 1, 3),
Array(1132243, 500, 1, 3),


Array(1113074, 300, 1, 3),
Array(1113073, 300, 1, 3),
Array(1113073, 300, 1, 3),
Array(1132244, 300, 1, 3),
Array(1122265, 300, 1, 3),
Array(1032221, 300, 1, 3),
Array(1212044, 500, 1, 3),
Array(1222044, 500, 1, 3),
Array(1232041, 500, 1, 3),
Array(1242044, 500, 1, 3),
Array(1302248, 500, 1, 3),
Array(1312135, 500, 1, 3),
Array(1322181, 500, 1, 3),
Array(1332205, 500, 1, 3),
Array(1342075, 500, 1, 3),
Array(1362074, 500, 1, 3),
Array(1362079, 500, 1, 3),
Array(1372161, 500, 1, 3),
Array(1382192, 500, 1, 3),
Array(1402172, 500, 1, 3),
Array(1412122, 500, 1, 3),
Array(1422124, 500, 1, 3),
Array(1432150, 500, 1, 3),
Array(1442202, 500, 1, 3),
Array(1452189, 500, 1, 3),
Array(1462177, 500, 1, 3),
Array(1472197, 500, 1, 3),
Array(1482151, 500, 1, 3),
Array(1492162, 500, 1, 3),
Array(1522078, 500, 1, 3),
Array(1532081, 500, 1, 3),
Array(1252031, 500, 1, 3)

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "夏日浪花箱", notice);
            if (item != -1) {
		im.gainItem(2431341, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}