status = -1;
var itemList = Array(
// ------ 300武器 ------
Array(2613000, 500, 5, 3), // 星火单手武器攻击力卷轴 - 为单手武器附加提升攻击力的属性。
Array(2613001, 500, 5, 3), // 星火单手武器魔法力卷轴 - 为单手武器附加提升魔力的属性。
Array(2612010, 500, 5, 3), // 星火双手武器攻击力卷轴 - 为双手武器附加提升攻击力的属性。
Array(2047818, 500, 5, 3),// - 惊人的双手武器攻击力卷轴100% - 在双手武器上附加提升攻击力的属性。
Array(2046996, 500, 5, 3),// - 惊人的单手武器攻击力卷轴100% - 对单手武器增加攻击力提高属性。
Array(2046997, 500, 5, 3),// - 惊人的单手武器魔力卷轴100% - 对单手武器增加魔力提高属性。
/*
Array(1102471, 300, 1, 3), // 赫里希安精锐战士披风 // (无描述)
Array(1102472, 300, 1, 3), // 赫里希安精锐法师披风 // (无描述)
Array(1102473, 300, 1, 3), // 赫里希安精锐弓箭手披风 // (无描述)
Array(1102474, 300, 1, 3), // 赫里希安精锐飞侠披风 // (无描述)
Array(1102475, 300, 1, 3), // 赫里希安精锐海盗披风 // (无描述)
Array(1072732, 300, 1, 3), // 赫里希安精锐战士靴 // (无描述)
Array(1072733, 300, 1, 3), // 赫里希安精锐法师靴 // (无描述)
Array(1072734, 300, 1, 3), // 赫里希安精锐弓箭手靴 // (无描述)
Array(1072735, 300, 1, 3), // 赫里希安精锐飞侠靴 // (无描述)
Array(1072736, 300, 1, 3), // 赫里希安精锐海盗靴 // (无描述)
Array(1132164, 300, 1, 3), // 赫里希安精锐战士腰带 // (无描述)
Array(1132165, 300, 1, 3), // 赫里希安精锐法师腰带 // (无描述)
Array(1132166, 300, 1, 3), // 赫里希安精锐弓箭手腰带 // (无描述)
Array(1132167, 300, 1, 3), // 赫里希安精锐飞侠腰带 // (无描述)
Array(1132168, 300, 1, 3), // 赫里希安精锐海盗腰带 // (无描述)
Array(1102476, 100, 1, 3), // 诺巴西亚戴斯披风 // (无描述)
Array(1102477, 100, 1, 3), // 诺巴赫尔梅斯披风 // (无描述)
Array(1102478, 100, 1, 3), // 诺巴凯伦披风 // (无描述)
Array(1072737, 100, 1, 3), // 诺巴西亚戴斯靴 // (无描述)
Array(1072738, 100, 1, 3), // 诺巴赫尔梅斯靴 // (无描述)
Array(1072739, 100, 1, 3), // 诺巴凯伦靴 // (无描述)
Array(1072740, 100, 1, 3), // 诺巴利卡昂靴 // (无描述)
Array(1072741, 100, 1, 3), // 诺巴阿尔泰靴 // (无描述)
Array(1102479, 100, 1, 3), // 诺巴利卡昂披风 // (无描述)
Array(1102480, 100, 1, 3), // 诺巴阿尔泰披风 // (无描述)
Array(1132169, 100, 1, 3), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 100, 1, 3), // 诺巴赫尔梅斯腰带 // (无描述)
Array(1132171, 100, 1, 3), // 诺巴凯伦腰带 // (无描述)
Array(1132172, 100, 1, 3), // 诺巴利卡昂腰带 // (无描述)
Array(1132173, 100, 1, 3), // 诺巴阿尔泰腰带 // (无描述)*/
Array(2431996, 500, 1, 3)
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "惊喜箱子", notice);
            if (item != -1) {
		im.gainItem(2431989, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}