status = -1;
var itemList = Array(

//椅子
//Array(
//3015097, 300, 1, 3), // 金鱼
Array(
3015098, 300, 1, 3), // 花蘑菇伪装椅子
Array(
3015099, 300, 1, 3), // 扎纳罗非伪装椅子
//Array(
//3015015, 300, 1, 3), // 白羊座椅子
//Array(
//3015016, 300, 1, 3), // 金牛座椅子
//Array(
//3015017, 300, 1, 3), // 双鱼座椅子
//Array(
//3015018, 300, 1, 3), // 双子座椅子 
//Array(
//3015019, 300, 1, 3), // 巨蟹座椅子
//Array(
//3015020, 300, 1, 3), // 狮子座椅子 
//Array(
//3015021, 300, 1, 3), // 天秤座椅子  
//Array(
//3015022, 300, 1, 3), // 天蝎座椅子 
//Array(
//3015023, 300, 1, 3), // 处女座椅子
//Array(
//3015024, 300, 1, 3), // 射手座椅子
//Array(
//3015025, 300, 1, 3), // 山羊座椅子
//Array(
//3015026, 300, 1, 3), // 水瓶座椅子 
Array(
3015027, 300, 1, 3), // 安德洛墨达椅子
Array(
3012007, 300, 1, 3), // 石狮椅子
Array(
3012008, 300, 1, 3), // 稻荷神社椅子
Array(
3010967, 300, 1, 3), // 假面绅士海报椅子
Array(
3010968, 300, 1, 3), // 假面绅士抱枕椅子
Array(
3010973, 300, 1, 3), // 蝙蝠椅子
//Array(
//3010853, 300, 1, 3), // 心花怒放椅子
Array(
3015106, 300, 1, 3), // 罗曼蒂克天文台
//Array(
//3015076, 300, 1, 3), // 雏祭娃娃4
Array(
3015077, 300, 1, 3), // 雏祭娃娃5
Array(
3015078, 300, 1, 3), // 雏祭娃娃6
Array(
3015088, 300, 1, 3), // 元宵烟花椅
Array(
3015093, 300, 1, 3), // 烟花绽放椅子
Array(
3012027, 300, 1, 3), // 羊羊热气球椅子
Array(
3012023, 300, 1, 3), // mPhone椅子
Array(
3010756, 300, 1, 3), // 新年招财猫椅子
Array(
3010980, 300, 1, 3), // 兔子箱椅子
Array(
3010751, 300, 1, 3), // 鲸鱼椅子
Array(
3015080, 300, 1, 3), // 被蛋卷椅子
Array(
3010862, 300, 1, 3), // 兔子胡萝卜椅子
Array(
3010447, 300, 1, 3), // 睡觉小鸟椅子
Array(
3010448, 300, 1, 3), // 泡泡浴椅子
Array(
3010435, 300, 1, 3), // 千年狐椅子
Array(
3010411, 300, 1, 3), // 鱼尾狮椅子
Array(
3010405, 300, 1, 3), // 摆钟椅子
Array(
3700017, 300, 1, 3), // 摆钟椅子
Array(
3700018, 300, 1, 3), // 摆钟椅子
Array(
3700014, 300, 1, 3), // 摆钟椅子
Array(
3700013, 300, 1, 3), // 摆钟椅子
Array(
3700012, 300, 1, 3), // 摆钟椅子
Array(
3700011, 300, 1, 3), // 摆钟椅子
Array(
3700010, 300, 1, 3), // 摆钟椅子
Array(
3700009, 300, 1, 3), // 摆钟椅子
Array(
3700004, 300, 1, 3), // 摆钟椅子
Array(
3700001, 300, 1, 3), // 摆钟椅子
Array(
3700000, 300, 1, 3), // 摆钟椅子
Array(
3700042, 300, 1, 3), // 摆钟椅子
Array(
3700044, 300, 1, 3), // 摆钟椅子
Array(
3700042, 300, 1, 3), // 摆钟椅子
Array(
3700045, 300, 1, 3), // 摆钟椅子
Array(
3010405, 300, 1, 3), // 摆钟椅子
Array(
3700046, 300, 1, 3), // 摆钟椅子
Array(
3700047, 300, 1, 3), // 摆钟椅子
Array(
3700049, 300, 1, 3), // 摆钟椅子
Array(
3700060, 300, 1, 3), // 摆钟椅子
Array(
3700101, 300, 1, 3), // 摆钟椅子
Array(
3700104, 300, 1, 3), // 摆钟椅子
Array(
3700118, 300, 1, 3), // 摆钟椅子
Array(
3700124, 300, 1, 3), // 摆钟椅子
Array(
3700141, 300, 1, 3), // 摆钟椅子
Array(
3700148, 300, 1, 3), // 摆钟椅子
Array(
3700149, 300, 1, 3), // 摆钟椅子
Array(
3700150, 300, 1, 3), // 摆钟椅子
Array(
3015047, 300, 1, 3), // 摆钟椅子
Array(
2432466, 300, 1, 3), // 金色枫叶
Array(
3015046, 300, 1, 3), // 摆钟椅子1010
Array(
3015272, 300, 1, 3), // 摆钟椅子1010
Array(
3012030, 300, 1, 3), // 摆钟椅子1010
Array(
3015304, 300, 1, 3), // 摆钟椅子1010
Array(
3015263, 300, 1, 3), // 摆钟椅子1010
Array(
3015272, 300, 1, 3), // 摆钟椅子1010
Array(
3015268, 300, 1, 3), // 摆钟椅子1010
Array(
3015269, 300, 1, 3), // 摆钟椅子1010
Array(
3015271, 300, 1, 3), // 摆钟椅子1010
Array(
3996056, 300, 1, 3), // 摆钟椅子1010
Array(
3016101, 300, 1, 3), // 摆钟椅子1010
Array(
3015328, 200, 1, 3), // 摆钟椅子1010
Array(
3015329, 300, 1, 3), // 摆钟椅子1010
Array(
3015338, 300, 1, 3), // 摆钟椅子1010
Array(
3015312, 200, 1, 3), // 摆钟椅子1010
Array(
3015029, 250, 1, 3), // 摆钟椅子1010
Array(
3014010, 250, 1, 3), // 摆钟椅子1010
Array(
3010836, 300, 1, 3), // 度假地奥拉夫椅子
Array(
3010660, 300, 1, 3), // 梦幻公主城堡椅子
Array(
3010978, 300, 1, 3), // 生病的奥尔卡抱枕椅子
//Array(
//3015274, 300, 1, 3), // 1111
Array(
3015182, 300, 1, 3), // 1111
Array(
3012028, 300, 1, 3), // 1111
Array(
3015058, 300, 1, 3), // 1111
Array(
3010843, 300, 1, 3), // 1111
Array(
3010853, 300, 1, 3), // 1111
Array(
3010696, 300, 1, 3), // 1111
Array(
3010756, 300, 1, 3), // 1111
Array(604422, 300, 1, 3), // 
Array(604423, 300, 1, 3), // 
Array(604424, 300, 1, 3), //
Array(604425, 300, 1, 3), // 
Array(604426, 300, 1, 3)// 
/*
Array(1052882, 300, 1, 3), // 
Array(1052887, 300, 1, 3), // 
Array(1052888, 300, 1, 3), // 
Array(1052889, 300, 1, 3), // 
Array(1052890, 300, 1, 3), // 
Array(1073030, 300, 1, 3), // 赫里希安精锐战士腰带 // (无描述)
Array(1073032, 300, 1, 3), // 赫里希安精锐法师腰带 // (无描述)
Array(1073033, 300, 1, 3), // 赫里希安精锐弓箭手腰带 // (无描述)
Array(1073034, 300, 1, 3), // 赫里希安精锐飞侠腰带 // (无描述)
Array(1073035, 300, 1, 3), // 
Array(1082636, 100, 1, 3), // 诺巴西亚戴斯披风 // (无描述)
Array(1082637, 100, 1, 3), // 诺巴赫尔梅斯披风 // (无描述)
Array(1082638, 100, 1, 3), // 诺巴凯伦披风 // (无描述)
Array(1082639, 100, 1, 3), // 诺巴西亚戴斯靴 // (无描述)
Array(1082640, 100, 1, 3), // 
Array(1102775, 100, 1, 3), // 诺巴凯伦靴 // (无描述)
Array(1102794, 100, 1, 3), // 诺巴利卡昂靴 // (无描述)
Array(1102795, 100, 1, 3), // 诺巴阿尔泰靴 // (无描述)
Array(1102796, 100, 1, 3), // 诺巴利卡昂披风 // (无描述)
Array(1102797, 100, 1, 3), // 
Array(1132169, 100, 1, 3), // 诺巴西亚戴斯腰带 // (无描述)
Array(1132170, 100, 1, 3), // 诺巴赫尔梅斯腰带 // (无描述)
Array(3010845, 100, 1, 3), // 诺巴凯伦腰带 // (无描述)
Array(3015075, 100, 1, 3), // 诺巴利卡昂腰带 // (无描述)
Array(3015059, 100, 1, 3) // 诺巴阿尔泰腰带 // (无描述)
*/
);
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 300);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
			
			/*
			if (im.getChar().getName() == "Super大y") {
				im.setPQLog("Super大y");
				if (im.getPQLog("Super大y") == 3) {
					itemId = 1242060;
					quantity = 1;
					notice = 3;
				}
			}*/
            item = im.gainGachaponItem(itemId, quantity, "被封印的箱子", notice);
            if (item != -1) {
				im.gainItem(2431046, -1);
				//im.gainItem(436030, 10);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.gainItem(2431046, -1);
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}